include("Market_Def/zh.lua") --个人封装函数

local diaoluoxilie = {
	"强化系列","屠龙雷霆衣服系列","S1首饰系列","S1特殊系列","S1衣服系列","S1武器系列","S2系列","S2特殊系列","S2衣服系列","S2武器系列","S3系列","S3特殊系列","S3衣服系列","S3武器系列","S4系列","S4特殊系列","S4衣服系列","S5系列","S5衣服系列",
	"S6系列","S6衣服系列","S7系列","S7衣服系列","12万经验卷","50万经验卷","兽魂蛋","书页","金矿石","神兽之血","虎骨","庄主令牌","聚合之心","技能神石","神秘水晶","魔龙之血","主宰凭证","紫水晶矿",
	}
	
----合区前禁止爆出物品
local hequqianjinzhibao = {
["狂野战甲"]=1,["狂野战衣"]=1,["火凤之铠"]=1,["火凰之铠"]=1,["天使之羽"]=1,["天使之翼"]=1,["鬼浮屠(男)"]=1,["鬼浮屠(女)"]=1,["冥火(男)"]=1,["冥火(女)"]=1,["天罚(男)"]=1,["天罚(女)"]=1,
["赤影★圣盔"]=1,["赤影★圣链"]=1,["赤影★圣镯"]=1,["赤影★圣戒"]=1,["赤影★圣带"]=1,["赤影★圣靴"]=1,["焚天★魔盔"]=1,["焚天★魔链"]=1,["焚天★魔镯"]=1,["焚天★魔戒"]=1,["焚天★魔带"]=1,
["焚天★魔靴"]=1,["远古★道盔"]=1,["远古★道链"]=1,["远古★道镯"]=1,["远古★道戒"]=1,["远古★道带"]=1,["远古★道靴"]=1,["游龙ぬ锥心甲"]=1,["游龙ぬ锥心袍"]=1,["咆哮ぬ怒吼甲"]=1,["咆哮ぬ怒吼袍"]=1,
["契约ぬ神罚甲"]=1,["契约ぬ神罚袍"]=1,["游龙ぬ锥心盔"]=1,["游龙ぬ锥心链"]=1,["游龙ぬ锥心镯"]=1,["游龙ぬ锥心戒"]=1,["游龙ぬ锥心带"]=1,["游龙ぬ锥心靴"]=1,["咆哮ぬ怒吼盔"]=1,["咆哮ぬ怒吼链"]=1,
["咆哮ぬ怒吼镯"]=1,["咆哮ぬ怒吼戒"]=1,["咆哮ぬ怒吼带"]=1,["咆哮ぬ怒吼靴"]=1,["契约ぬ神罚盔"]=1,["契约ぬ神罚链"]=1,["契约ぬ神罚镯"]=1,["契约ぬ神罚戒"]=1,["契约ぬ神罚带"]=1,["契约ぬ神罚靴"]=1,
["阿修罗ぬ神甲"]=1,["阿修罗ぬ神袍"]=1,["帝释天ぬ神甲"]=1,["帝释天ぬ神袍"]=1,["迦楼罗ぬ神甲"]=1,["迦楼罗ぬ神袍"]=1,["阿修罗ぬ神盔"]=1,["阿修罗ぬ神链"]=1,["阿修罗ぬ神镯"]=1,["阿修罗ぬ神戒"]=1,
["阿修罗ぬ神带"]=1,["阿修罗ぬ神靴"]=1,["帝释天ぬ神盔"]=1,["帝释天ぬ神链"]=1,["帝释天ぬ神镯"]=1,["帝释天ぬ神戒"]=1,["帝释天ぬ神带"]=1,["帝释天ぬ神靴"]=1,["迦楼罗ぬ神盔"]=1,["迦楼罗ぬ神链"]=1,
["迦楼罗ぬ神镯"]=1,["迦楼罗ぬ神戒"]=1,["迦楼罗ぬ神带"]=1,["迦楼罗ぬ神靴"]=1,
}	

local jiangbaolv_wupin = {
["圣战头盔"]=1,["圣战项链"]=1,["圣战手镯"]=1,["圣战戒指"]=1,["法神头盔"]=1,["法神项链"]=1,["法神手镯"]=1,["法神戒指"]=1,["天尊头盔"]=1,["天尊项链"]=1,["天尊手镯"]=1,
["天尊戒指"]=1,["天魔神甲"]=1,["圣战宝甲"]=1,["血饮"]=1,["法神披风"]=1,["霓裳羽衣"]=1,["天尊道袍"]=1,["天师长袍"]=1,["圣战腰带"]=1,["圣战靴子"]=1,["法神腰带"]=1,
["法神靴子"]=1,["天尊腰带"]=1,["天尊靴子"]=1,["怒斩"]=1,["龙牙"]=1,["逍遥扇"]=1,["雷霆腰带"]=1,["雷霆战靴"]=1,["烈焰魔靴"]=1,["烈焰腰带"]=1,["光芒道靴"]=1,["光芒腰带"]=1,
["圣龙盔"]=1,["雷霆项链"]=1,["雷霆护腕"]=1,["雷霆战戒"]=1,["魔龙盔"]=1,["烈焰项链"]=1,["烈焰护腕"]=1,["烈焰魔戒"]=1,["天龙盔"]=1,["光芒项链"]=1,["光芒护腕"]=1,["光芒道戒"]=1,
["屠龙"]=1,["嗜魂法杖"]=1,["霸者之刃"]=1,["雷霆战甲(男)"]=1,["雷霆战甲(女)"]=1,["烈焰魔衣(男)"]=1,["烈焰魔衣(女)"]=1,["光芒道袍(男)"]=1,["光芒道袍(女)"]=1,["天之圣龙盔"]=1,
["天之雷霆项链"]=1,["天之雷霆护腕"]=1,["天之雷霆战戒"]=1,["天之雷霆腰带"]=1,["天之雷霆战靴"]=1,["天之魔龙盔"]=1,["天之烈焰项链"]=1,["天之烈焰护腕"]=1,["天之烈焰魔戒"]=1,
["天之烈焰魔靴"]=1,["天之烈焰腰带"]=1,["天之天龙盔"]=1,["天之光芒项链"]=1,["天之光芒护腕"]=1,["天之光芒道戒"]=1,["天之光芒道靴"]=1,["天之光芒腰带"]=1,["金矿石"]=1,["紫水晶矿"]=1,
}

function diaoluochakan(actor,par)
	local t = hequqianjinzhibao
	if par == "2" then
		t = jiangbaolv_wupin
	end
	for k,v in pairs(t) do
		sendmsg6(actor,k.."      应该掉落"..getsysint("应掉"..k).." 实际掉落"..getsysint("实掉"..k) )
	end
end
	
function show(actor)
	local msg = [[
		<Img|x=0|width=700|height=427|esc=1|loadDelay=1|bg=1|img=zhangheng/1.png|move=1|reset=1|show=4>
		<Button|x=696|y=1.5|nimg=public/1900000510.png|pimg=public/1900000511.png|link=@exit>
		<Img|x=-23.5|y=-15.5|img=zhangheng/2.png|esc=0>
		<Text|x=524.0|y=366.5|color=255|size=18|text=清理掉落|link=@qingli>
		<Text|x=124.0|y=366.5|color=255|size=18|text=掉落查看一|link=@diaoluochakan,1>
		<Text|x=224.0|y=366.5|color=255|size=18|text=掉落查看二|link=@diaoluochakan,2>
	]]
	
	for i = 1,#diaoluoxilie do
		msg = msg ..'<Text|x='.. 30 + (i-1)%4*170 ..'|y='.. 48+math.floor((i-1)/4) * 30 ..'|size=14|color=255|text='.. diaoluoxilie[i] ..'：'.. getsysint("掉落数量"..diaoluoxilie[i]) ..'>'
	end
	
	say(actor,msg)
end

function qingli(actor)
	for i = 1,#diaoluoxilie do
		setsysint("掉落数量"..diaoluoxilie[i],0)
	end
	return show(actor)
end

function show1(actor) --每日掉落查看
	local msg = [[
		<Img|x=0|width=700|height=427|esc=1|loadDelay=1|bg=1|img=zhangheng/1.png|move=1|reset=1|show=4>
		<Button|x=696|y=1.5|nimg=public/1900000510.png|pimg=public/1900000511.png|link=@exit>
		<Img|x=-23.5|y=-15.5|img=zhangheng/2.png|esc=0>

	]]
	
	for i = 1,#diaoluoxilie do
		msg = msg ..'<Text|x='.. 30 + (i-1)%4*170 ..'|y='.. 48+math.floor((i-1)/4) * 30 ..'|size=14|color=255|text='.. diaoluoxilie[i] ..'：'.. getsysint("每日掉落数量"..diaoluoxilie[i]) ..'>'
	end
	
	say(actor,msg)
end

