ItemTips = {}

local beizhu = {
["木剑"]={"一把普通的木剑,正适合新手使用",161},
["凝霜"]={"看上去朴素不起眼,却是令人防不胜防的杀人利器",161},
["斩马刀"]={"刀身巨大,利可斩马,能发挥超乎寻常的力量",161},
["青铜斧"]={"铸造工艺上乘,挥砍时虎虎生风",161},
["海魂"]={"据说这把法杖是用苍月岛附近的海水淬炼而成",161},
["半月"]={"十分锋利的弯刀,因形似天上半月而得名",161},
["罗刹"]={"刀身如鬼魅般,传说亡魂会附在刀锋上使其更锋利",161},
["降魔"]={"原是为控制勇士的心魔而打造的宝刃，但随后人们发现它更擅长致人死命",161},
["偃月"]={"杀伤力巨大的武器,常常能给敌人造成致命一击",161},
["修罗"]={"闪着寒光的斧刃，透着血腥的气息如修罗临世,令人胆颤",161},
["布衣(男)"]={"粗布做的上衣,可用来御寒",161},
["布衣(女)"]={"粗布做的上衣,可用来御寒",161},
["重盔甲(男)"]={"掺以重铁打造的肌肉型板甲,得到并不困难,但穿上它却需要经过更多的历练",161},
["重盔甲(女)"]={"掺以重铁打造的肌肉型板甲,得到并不困难,但穿上它却需要经过更多的历练",161},
["魔法长袍(男)"]={"一直以来,这件袍服都被看成中阶法师身份的象征",161},
["魔法长袍(女)"]={"一直以来,这件袍服都被看成中阶法师身份的象征",161},
["灵魂战衣(男)"]={"想当年,为了获得一套极品灵魂战衣，我可是在矿洞里熬了许久啊",161},
["灵魂战衣(女)"]={"想当年,为了获得一套极品灵魂战衣，我可是在矿洞里熬了许久啊",161},
["战神盔甲(男)"]={"充满了嗜血气息的盔甲,在战场上就是敌人的噩梦",161},
["战神盔甲(女)"]={"充满了嗜血气息的盔甲,在战场上就是敌人的噩梦",161},
["幽灵战衣(男)"]={"如幽灵前来,无声无息,曾第一个拥有它的玛法道士这样称赞道",161},
["幽灵战衣(女)"]={"如幽灵前来,无声无息,曾第一个拥有它的玛法道士这样称赞道",161},
["恶魔长袍(男)"]={"有传言说它是用死去恶魔的皮毛制成穿上它确实让人有种恶魔附身强大无匹的感觉",161},
["恶魔长袍(女)"]={"有传言说它是用死去恶魔的皮毛制成穿上它确实让人有种恶魔附身强大无匹的感觉",161},
["骷髅头盔"]={"相传是用死去魔兽的完整头骨制成,外形诡秘,也因此而备受争议",161},
["道士头盔"]={"虽然叫道士头盔,但所有人都可以戴,这也许是制作者的恶趣味吧",161},
["灯笼项链"]={"形似平凡人家檐下的灯笼,戴上它仿佛能听到亲人的祝愿",161},
["白金项链"]={"普通的项链,能增加些许法力",161},
["凤凰明珠"]={"传说中神鸟的眼泪,可以清心提神",161},
["蓝翡翠项链"]={"极为罕见的蓝色翡翠制成,流光溢彩,十分美丽",161},
["放大镜"]={"传说不论多细微的丑恶在它面前都将无所遁形但实际上它只有增强法术的作用",161},
["竹笛"]={"短小的竹笛,据说随身佩戴可以带来好运",161},
["金手镯"]={"与金戒指出自同一个工匠之手但它对佩戴者的要求似乎更挑剔些",161},
["黑檀手镯"]={"黑檀木是生命之树,能让佩戴者汲取能量",161},
["死神手套"]={"虽然它确实能让对手离死神更近一点，但它名字的由来却是商人们为了能卖出更好的价钱",161},
["魔力手镯"]={"请不要被它的名字所迷惑,虽然它也能为你增强实力,但仅仅如此而已",161},
["魔法手镯"]={"精制而成,朴实无华,不惧烈火",161},
["道士手镯"]={"专为道士打造的手镯,但提升道术的作用却少得可怜",161},
["蓝色水晶戒指"]={"蓝水晶的力量,让你攻击起来有如神助",161},
["魅力戒指"]={"青春的生命力从此汩汩流出,且用且珍惜",161},
["珊瑚戒指"]={"冒险者以命相搏带回来的戒指,带着沉重的血腥气",161},
["金戒指"]={"虽然是外形俗气难耐,但这一点都不影响它的优秀",161},
["降妖除魔戒指"]={"寄予了工匠们对它的深厚期盼,降服一切妖魔",161},
["骷髅戒指"]={"正面巨大的骷髅头也许可以更好的震慑对手",161},
["蛇眼戒指"]={"戴上这个戒指就会立刻感觉到杀意请尽量克制",161},
["道德戒指"]={"曾有一段时间,它是道术有成者的身份象征",161},
["43号勋章"]={"普通的勋章,能为佩戴者增加攻击属性",161},
["44号勋章"]={"普通的勋章,能为佩戴者增加魔法属性",161},
["45号勋章"]={"普通的勋章,能为佩戴者增加道术属性",161},
["43号斗笠"]={"普通的斗笠,能为佩戴者增加攻击属性",161},
["44号斗笠"]={"普通的斗笠,能为佩戴者增加魔法属性",161},
["45号斗笠"]={"普通的斗笠,能为佩戴者增加道术属性",161},
["魔杖"]={"采灵木之尊所制,集日月精华,万木之灵,蕴含着魔法的气息",161},
["银蛇"]={"玛法大陆上的学者们对它的来历一直争论不休，但它的可怕，却无人敢质疑",161},
["无极棍"]={"人族为报白日门虎卫的救命之恩人类三英雄遍访奇珍，委托铸剑谷主打造无极棍作为答谢",161},
["炼狱"]={"它会告诉你,什么才是真正的地狱",161},
["井中月"]={"如雾如电,似真实幻,如镜中之花井中之月",161},
["幽灵项链"]={"有人说这是被诅咒的项链,因为它的出现总是伴随着血雨腥风",161},
["生命项链"]={"最好的防守是攻击,最强韧的生命力是战斗力",161},
["天珠项链"]={"古籍曾记录了一种可令道士呼风唤雨的至尊项链，匠师们据此制造了这件饰品",161},
["幽灵手套"]={"它曾是恶魔的收藏，可对于它是如何出现的,人们却往往讳莫如深",161},
["思贝儿手镯"]={"这个手镯背后有一个悲伤的故事也许玛法大陆上最博学的人能告诉你",161},
["心灵手镯"]={"工匠原先要铸造一样举世无双的饰品，但半途却发生了意外，最终只得到这么一件半成品",161},
["龙之戒指"]={"为纪念击退火龙而打造的戒指,代表着力量与希望",161},
["红宝石戒指"]={"历史悠久的戒指,造型古朴含蓄也许可以带来更多的魔法力量",161},
["铂金戒指"]={"历经多重淬炼而成的戒指,可不是所有人都能戴上它",161},
["铁腰带"]={"上等精铁打造的腰带,拥有出色的防御力,即使在老一辈勇士中也不是所有人都见过它",161},
["鹿皮靴"]={"小鹿皮制成的轻便靴子，多年前它曾鼓舞了不少勇士继续踏上征途",161},
["骨玉权杖"]={"曾是高级魔法师的标志装备,可以释放出能量更强大的绚丽魔法",161},
["龙纹剑"]={"剑身上隐隐刻有龙的图案,唯有得到它的认可,才能发挥出龙纹剑的真正力量",161},
["裁决之杖"]={"百年前苍月圣女怒嫁祖玛教主后裁决便从苍月岛消失，当火龙乱世它却又神秘地出现了",161},
["黑铁头盔"]={"黑铁打造的头盔,防御力十分出众即便整个玛法大陆也不多见",161},
["绿色项链"]={"冒险者从矿洞深处带回了一种可以增加力量的绿色矿石，工匠们将其打造成项链",161},
["恶魔铃铛"]={"曾是恶魔手中的把玩之物,要小心里面的邪恶力量,它将吞噬心志不坚者的心魂",161},
["灵魂项链"]={"可以直击灵魂深处的项链,经常佩戴可以增强对道术的思考",161},
["骑士手镯"]={"拥有骑士之心,除了信仰光明,还要心怀正义",161},
["龙之手镯"]={"比奇的首饰商喜欢这么介绍它龙牙所制无往不利,值得拥有",161},
["三眼手镯"]={"毫无疑问,它是强大的,但所有的首饰商却都对它的来历闭口不言",161},
["力量戒指"]={"戴上它,就仿佛有一股极为强大的力量在身体里涌动",161},
["紫碧螺"]={"闪耀着元素光芒的戒指,它的存在令无数法师疯狂",161},
["泰坦戒指"]={"传说中古老神族的戒指,其中蕴含着毁坏天地的力量",161},
["降魔腰带"]={"经过时间沉淀的腰带，花纹斑斓似乎让人看到了一段热血的岁月",161},
["泰坦腰带"]={"经过时间沉淀的腰带，花纹斑斓似乎让人看到了一段热血的岁月",161},
["黑铁腰带"]={"经过时间沉淀的腰带，花纹斑斓似乎让人看到了一段热血的岁月",161},
["降魔靴子"]={"经过时间沉淀的靴子，花纹斑斓似乎让人看到了一段热血的岁月",161},
["泰坦靴子"]={"经过时间沉淀的靴子，花纹斑斓似乎让人看到了一段热血的岁月",161},
["黑铁靴子"]={"经过时间沉淀的靴子，花纹斑斓似乎让人看到了一段热血的岁月",161},
["黑铁勋章"]={"冒险者从矿洞深处带回了一种可以增加力量的黑铁矿石，工匠们将其打造成勋章",161},
["恶魔勋章"]={"曾是恶魔手中的把玩之物,要小心里面的邪恶力量,它将吞噬心志不坚者的灵魂",161},
["泰坦勋章"]={"可以直击灵魂深处的勋章,经常佩戴可以增强对道术的思考",161},
["黑铁斗笠"]={"冒险者从矿洞深处带回了一种可以增加力量的黑铁矿石，工匠们将其打造成斗笠",161},
["恶魔斗笠"]={"曾是恶魔手中的把玩之物,要小心里面的邪恶力量,它将吞噬心志不坚者的灵魂",161},
["泰坦斗笠"]={"可以直击灵魂深处的斗笠,经常佩戴可以增强对道术的思考",161},
["血饮"]={"要铸就血饮刀，必先饱尝鲜血,因铸造之法极为邪恶,英雄圣战明令禁止打造此刀",95},
["天魔神甲"]={"黑色战衣不仅在夜间行动更为隐秘还增加了神秘感，挑入眼帘的双翅是正义的代表",95},
["圣战宝甲"]={"它自然间透出一股威严之气,而最突出的是背后的一对翅膀,透露着神秘,不可捉摸",95},
["法神披风"]={"如同法神在身,天地万物俱在掌控只有天赋超群的法师才能够穿它",95},
["霓裳羽衣"]={"从上古流传至今的尊贵法衣,弥漫着火焰的暴戾气息,单是靠近就仿佛会被其所伤",95},
["天尊道袍"]={"百年前道术强者遗留之物,长存不灭,纵然幽冥烈火亦不能伤它分毫",95},
["天师长袍"]={"依据古老典籍的记录而缝制的长袍，清新而古典，是许多道士半生追求的尊者战衣",95},
["圣战头盔"]={"傲视天下,气势磅礴的战盔,相传得到它的人将获得称霸天下的能力",95},
["法神头盔"]={"耀眼的可与日争辉的头冠,玛法大陆上一直流传着它的传说",95},
["天尊头盔"]={"曾经的第一工匠感念天师的恩德依照从典籍里找到的古方打造了这个头冠",95},
["圣战项链"]={"玛法第一工匠为英雄圣战打造的三件圣器之一用材之珍贵手艺之精湛世间罕有",95},
["法神项链"]={"魔尊法神流落于世间的三件法器之一链珠之上隐现上古咒文，十分神秘",95},
["天尊项链"]={"上师天尊以万物之灵锤炼而成的三件神器之一,谓之“混沌”",95},
["圣战手镯"]={"玛法第一工匠为英雄圣战打造的三件圣器之一用材之珍贵手艺之精湛世间罕有",95},
["法神手镯"]={"魔尊法神流落于世间的三件法器之一其上法力涌动观之若浮光掠影佩戴腕上能觉察出心跳一般的脉动",95},
["天尊手镯"]={"上师天尊以万物之灵锤炼而成的三件神器之一,谓之“万物”",95},
["圣战戒指"]={"玛法第一工匠为英雄圣战打造的三件圣器之一用材之珍贵手艺之精湛世间罕有",95},
["法神戒指"]={"法神流落于世间的三件法器之一据说其中封印着强大的魔魂,如果自身魔法之力不济者强行佩戴,便会为之反噬",95},
["天尊戒指"]={"上师天尊以万物之灵锤炼而成的三件神器之一,谓之“阴阳”",95},
["圣战腰带"]={"上古之物,传说其中凝固着圣战的魂魄,佩戴者将受到古代英灵的终极保护",95},
["法神腰带"]={"上古之物,传说其中凝固着法神的魂魄,佩戴者将受到古代英灵的终极保护",95},
["天尊腰带"]={"上古之物,传说其中凝固着天尊的魂魄,佩戴者将受到古代英灵的终极保护",95},
["圣战靴子"]={"一个古老家族制作的靴子,穿上它就能得到莫名强大的力量,邪魂恶魄皆无法靠近",95},
["法神靴子"]={"一个古老家族制作的靴子,穿上它就能得到莫名强大的力量,邪魂恶魄皆无法靠近",95},
["天尊靴子"]={"一个古老家族制作的靴子,穿上它就能得到莫名强大的力量,邪魂恶魄皆无法靠近",95},
["圣战勋章"]={"以天外陨铁打造的勋章,邪名炽盛,杀意昂扬",95},
["法神勋章"]={"打造时融入了恶魔之血的勋章,曾有人妄想凭此章称霸玛法大陆",95},
["天尊勋章"]={"观其天地威能之势,夺造化之力铸造的勋章",95},
["圣战斗笠"]={"以天外陨铁打造的斗笠,邪名炽盛,杀意昂扬",95},
["法神斗笠"]={"打造时融入了恶魔之血的斗笠,曾有人妄想凭此章称霸玛法大陆",95},
["天尊斗笠"]={"观其天地威能之势,夺造化之力铸造的斗笠,",95},
["怒斩"]={"用魔族中最强战士的脊梁骨所打制的强悍兵刃,拥有可怕的杀伤力",95},
["龙牙"]={"龙牙仍然是牛魔王最钟爱的武器有一天它神秘的失踪了，牛魔王出动了所有的牛魔群寻找",95},
["逍遥扇"]={"它是数百年前一位沙巴克城主的贴身兵刃曾消失过一段时间后又神秘的出现在苍月岛",95},
["命运之刃"]={"铸剑谷主亲手打造送给盟重城主的神兵,相传拥有掌握命运的能力",95},
["圣龙盔"]={"其盔上纹有天空寰宇,神龙之息,喻作兜鍪不可盖,英雄持之,寰宇可驱",95},
["魔龙盔"]={"其盔上纹有天空寰宇,神龙之息,喻作兜鍪不可盖,英雄持之,寰宇可驱",95},
["天龙盔"]={"其盔上纹有天空寰宇,神龙之息,喻作兜鍪不可盖,英雄持之,寰宇可驱",95},
["雷霆项链"]={"以雷霆为名的凶邪项链,质地不明能唤醒人内心最深处的狂癫战意",95},
["烈焰项链"]={"传说诞生于魔火龙腹中的魔法饰品,拥有惊人的魔力",95},
["光芒项链"]={"出自某位上古道君的熔炉,吸纳日月光辉凝聚而成,其中蕴含道法无穷",95},
["雷霆护腕"]={"以雷霆为名的凶邪项链,质地不明能唤醒人内心最深处的狂癫战意",95},
["烈焰护腕"]={"传说诞生于魔火龙腹中的魔法饰品,拥有惊人的魔力",95},
["光芒护腕"]={"出自某位上古道君的熔炉,吸纳日月光辉凝聚而成,其中蕴含道法无穷",95},
["雷霆战戒"]={"以雷霆为名的凶邪项链,质地不明能唤醒人内心最深处的狂癫战意",95},
["烈焰魔戒"]={"传说诞生于魔火龙腹中的魔法饰品,拥有惊人的魔力",95},
["光芒道戒"]={"出自某位上古道君的熔炉,吸纳日月光辉凝聚而成,其中蕴含道法无穷",95},
["雷霆腰带"]={"以雷霆为名的凶邪腰带,质地不明能唤醒人内心最深处的狂癫战意",95},
["烈焰腰带"]={"传说诞生于魔火龙腹中的魔法饰品,拥有惊人的魔力",95},
["光芒腰带"]={"出自某位上古道君的熔炉,吸纳日月光辉凝聚而成,其中蕴含道法无穷",95},
["雷霆战靴"]={"以雷霆为名的战靴,穿上它行走颇有奔雷之势",95},
["烈焰魔靴"]={"以烈焰为名的战靴,涌动着磅礴地魔焰之力",95},
["光芒道靴"]={"以光芒为名的道靴,只有道术高深者才能驾驭",95},
["雷霆勋章"]={"傲视天下气势磅礴的勋章,只有拥有它的人才有资格逐鹿玛法大陆",95},
["烈焰勋章"]={"勇士和半兽人之间甚至爆发了一场旷日持久的战争,因此而死去的法师不计其数",95},
["光芒勋章"]={"玛法第一神匠花费了五年时间亲手为天尊打造的勋章,用材之珍贵,手艺之精湛,世间罕有",95},
["雷霆斗笠"]={"傲视天下气势磅礴的斗笠,只有拥有它的人才有资格逐鹿玛法大陆",95},
["烈焰斗笠"]={"勇士和半兽人之间甚至爆发了一场旷日持久的战争,因此而死去的法师不计其数",95},
["光芒斗笠"]={"玛法第一神匠花费了五年时间亲手为天尊打造的斗笠,用材之珍贵,手艺之精湛,世间罕有",95},
["屠龙"]={"神兵至尊，狂刀屠龙，在与魔龙的战斗中,五龙卫先师武尊化身宝刀屠灭魔龙",95},
["嗜魂法杖"]={"一出世就击杀了虹魔教主的神兵利器,但它随后便令持有者陷入了疯狂,意志不坚者无法拥有它",95},
["霸者之刃"]={"一把有灵气的刀,封印着地藏魔王的力量,只有它认定的主人才能驾驭",95},
["黄金屠龙"]={"由黄金铸造而成,散发着金黄色的光芒,是每一位战士梦寐以求的除魔利器",95},
["紫金嗜魂法杖"]={"由紫金铸造而成,散发着紫金色的光芒,蕴含着强大的魔法之力",95},
["赤金逍遥扇"]={"由赤金铸造而成,散发着赤金色的光芒,其自然之力足以撼动山河",95},
["雷霆战甲(男)"]={"铸造世家使用珍贵材料制作出的战甲随后这个家族遭到毁灭制作这绝世神甲的方法从此消失",95},
["雷霆战甲(女)"]={"铸造世家使用珍贵材料制作出的战衣随后这个家族遭到毁灭制作这绝世神甲的方法从此消失",95},
["烈焰魔衣(男)"]={"拥有上古以来天地之间魔法烈焰的无上力量这件魔衣几次出现在玛法,都引起无数的血雨腥风",95},
["烈焰魔衣(女)"]={"拥有上古以来天地之间魔法烈焰的无上力量这件魔衣几次出现在玛法,都引起无数的血雨腥风",95},
["光芒道袍(男)"]={"这是荣誉的象征,也足以让拥有他的人得到无数的赞誉,只有心志纯净之人才能发挥他巨大的威力",95},
["光芒道袍(女)"]={"这是荣誉的象征,也足以让拥有他的人得到无数的赞誉,只有心志纯净之人才能发挥他巨大的威力",95},
["天之圣龙盔"]={"天赐顶帽,镶嵌通天华珠,戴与头顶可开天眼,通古今",95},
["天之魔龙盔"]={"天赐顶帽,镶嵌通天华珠,戴与头顶可开天眼,通古今",95},
["天之天龙盔"]={"天赐顶帽,镶嵌通天华珠,戴与头顶可开天眼,通古今",95},
["天之雷霆项链"]={"璀璨的雷霆之石打造的项链,闪耀着光与影的恒久魅力,佩戴后坚硬不可侵犯",95},
["天之烈焰项链"]={"一条传说中的项链,无名匠人以火焰包裹寒铁,锻造而成",95},
["天之光芒项链"]={"以极罕见龙晶所造之链,佩戴后如有龙涎温养,血脉调和",95},
["天之雷霆护腕"]={"璀璨的雷霆之石打造的护腕,闪耀着光与影的恒久魅力,佩戴后坚硬不可侵犯",95},
["天之烈焰护腕"]={"一个传说中的护腕,无名匠人以火焰包裹寒铁,锻造而成",95},
["天之光芒护腕"]={"以极罕见龙晶所造之镯,佩戴后如有龙涎温养,血脉调和",95},
["天之雷霆战戒"]={"璀璨的雷霆之石打造的戒指,闪耀着光与影的恒久魅力,佩戴后坚硬不可侵犯",95},
["天之烈焰魔戒"]={"一枚传说中的魔戒,无名匠人以火焰包裹寒铁,锻造而成",95},
["天之光芒道戒"]={"以极罕见龙晶所造之戒,佩戴后如有龙涎温养,血脉调和",95},
["天之雷霆腰带"]={"璀璨的雷霆之石打造的戒指,闪耀着光与影的恒久魅力,佩戴后可敌万军",95},
["天之烈焰腰带"]={"一条传说中的腰带,无名匠人以火焰包裹寒铁锻造时,魔焰万丈势不可挡",95},
["天之光芒腰带"]={"以极罕见龙晶所造之带,佩戴后光芒万丈,邪魔不近",95},
["天之雷霆战靴"]={"据说是苍月岛昔日的一位将军留下的珍贵战靴,蕴含雷霆之力",95},
["天之烈焰魔靴"]={"据说是苍月岛昔日的一位勇士讨伐牛魔王时穿的靴子尚有深红的血迹",95},
["天之光芒道靴"]={"据说是苍月岛昔日的一位隐士曾经穿戴过的靴子朴素的纹路中暗暗透着玄法",95},
["天之雷霆勋章"]={"璀璨的雷霆之石打造的勋章,闪耀着光与影的恒久魅力,佩戴后坚硬不可侵犯",95},
["天之烈焰勋章"]={"一枚传说中的勋章,无名匠人以火焰包裹寒铁,能为佩戴者增强魔法属性",95},
["天之光芒勋章"]={"以极罕见的龙晶所造之章,佩戴后如有龙涎温养,可增强道士的属性",95},
["天之雷霆斗笠"]={"璀璨的雷霆之石打造的斗笠,闪耀着光与影的恒久魅力,佩戴后坚硬不可侵犯",95},
["天之烈焰斗笠"]={"一枚传说中的斗笠,无名匠人以火焰包裹寒铁,能为佩戴者增强魔法属性",95},
["天之光芒斗笠"]={"以极罕见的龙晶所造斗笠,佩戴后如有龙涎温养,可增强道士的属性",95},
["开天"]={"以整块玄铁打制而成的重剑只有战士力量达到巅峰的人才能发挥它开天辟地的力量",149},
["镇天"]={"来历成谜的一把剑,浑然天成自成型时,便拥有非凡的魔法之力",149},
["玄天"]={"据说,玄天是由先天灵气凝结而成只有道术最为纯洁的道士,才能发挥它的力量",149},
["奔雷战甲(男)"]={"以雷霆之力铸造而成,暗合弓手“如雷奔行,如云翻卷”蕴含奔雷之势",149,"战士职业S1系列",250},
["奔雷战甲(女)"]={"以雷霆之力铸造而成,暗合弓手“如雷奔行,如云翻卷”蕴含奔雷之势",149,"战士职业S1系列",250},
["怒焰魔衣(男)"]={"凶邪之甲,凶名与其所蕴含杀意同样炽盛,唯久经战阵之人方能穿之无碍",149,"法师职业S1系列",250},
["怒焰魔衣(女)"]={"凶邪之甲,凶名与其所蕴含杀意同样炽盛,唯久经战阵之人方能穿之无碍",149,"法师职业S1系列",250},
["极光道袍(男)"]={"于顶级道家中流传的宝甲,镶有一片龙之逆鳞,被视为阵战之道的传承",149,"道士职业S1系列",250},
["极光道袍(女)"]={"于顶级道家中流传的宝甲,镶有一片龙之逆鳞,被视为阵战之道的传承",149,"道士职业S1系列",250},
["战神头盔"]={"传承于上古战神的套装，能够稳定的发挥出战士那无坚不摧的攻击力让你在战斗中如鱼得水，无往不胜",149,"战士职业S1系列",250},
["圣魔头盔"]={"璀璨的星空之石打造的首饰,闪耀着光与影的恒久魅力,拥有强大的魔法属性,佩戴后神圣不可侵犯",149,"法师职业S1系列",250},
["真魂头盔"]={"对灵魂能力研究最深的道士才能使用的宝物，有汲取天地灵气的能力,曾让无数的道士为之疯狂",149,"道士职业S1系列",250},
["战神项链"]={"传承于上古战神的套装，能够稳定的发挥出战士那无坚不摧的攻击力让你在战斗中如鱼得水，无往不胜",149,"战士职业S1系列",250},
["圣魔项链"]={"璀璨的星空之石打造的首饰,闪耀着光与影的恒久魅力,拥有强大的魔法属性,佩戴后神圣不可侵犯",149,"法师职业S1系列",250},
["真魂项链"]={"对灵魂能力研究最深的道士才能使用的宝物，有汲取天地灵气的能力,曾让无数的道士为之疯狂",149,"道士职业S1系列",250},
["战神手镯"]={"传承于上古战神的套装，能够稳定的发挥出战士那无坚不摧的攻击力让你在战斗中如鱼得水，无往不胜",149,"战士职业S1系列",250},
["圣魔手镯"]={"璀璨的星空之石打造的首饰,闪耀着光与影的恒久魅力,拥有强大的魔法属性,佩戴后神圣不可侵犯",149,"法师职业S1系列",250},
["真魂手镯"]={"对灵魂能力研究最深的道士才能使用的宝物，有汲取天地灵气的能力,曾让无数的道士为之疯狂",149,"道士职业S1系列",250},
["战神戒指"]={"传承于上古战神的套装，能够稳定的发挥出战士那无坚不摧的攻击力让你在战斗中如鱼得水，无往不胜",149,"战士职业S1系列",250},
["圣魔戒指"]={"璀璨的星空之石打造的首饰,闪耀着光与影的恒久魅力,拥有强大的魔法属性,佩戴后神圣不可侵犯",149,"法师职业S1系列",250},
["真魂戒指"]={"对灵魂能力研究最深的道士才能使用的宝物，有汲取天地灵气的能力,曾让无数的道士为之疯狂",149,"道士职业S1系列",250},
["战神腰带"]={"传承于上古战神的套装，能够稳定的发挥出战士那无坚不摧的攻击力让你在战斗中如鱼得水，无往不胜",149,"战士职业S1系列",250},
["圣魔腰带"]={"璀璨的星空之石打造的首饰,闪耀着光与影的恒久魅力,拥有强大的魔法属性,佩戴后神圣不可侵犯",149,"法师职业S1系列",250},
["真魂腰带"]={"对灵魂能力研究最深的道士才能使用的宝物，有汲取天地灵气的能力,曾让无数的道士为之疯狂",149,"道士职业S1系列",250},
["战神圣靴"]={"传承于上古战神的套装，能够稳定的发挥出战士那无坚不摧的攻击力让你在战斗中如鱼得水，无往不胜",149,"战士职业S1系列",250},
["圣魔法靴"]={"璀璨的星空之石打造的首饰,闪耀着光与影的恒久魅力,拥有强大的魔法属性,佩戴后神圣不可侵犯",149,"法师职业S1系列",250},
["真魂道靴"]={"对灵魂能力研究最深的道士才能使用的宝物，有汲取天地灵气的能力,曾让无数的道士为之疯狂",149,"道士职业S1系列",250},
["战神勋章"]={"传承于上古战神的勋章，能够稳定的发挥出战士那无坚不摧的攻击力让你在战斗中如鱼得水，无往不胜",149},
["圣魔勋章"]={"璀璨的星空之石打造的勋章,闪耀着光与影的恒久魅力,拥有强大的魔法属性,佩戴后神圣不可侵犯",149},
["真魂勋章"]={"对灵魂能力研究最深的道士才能使用的勋章，有汲取天地灵气的能力,曾让无数的道士为之疯狂",149},
["战神斗笠"]={"传承于上古战神的斗笠,能够稳定的发挥出战士那无坚不摧的攻击力,让你在战斗中如鱼得水,无往不胜",149},
["圣魔斗笠"]={"璀璨的星空之石打造的斗笠,闪耀着光与影的恒久魅力,拥有强大的魔法属性,佩戴后神圣不可侵犯",149},
["真魂斗笠"]={"对灵魂能力研究最深的道士才能使用的斗笠，有汲取天地灵气的能力,曾让无数的道士为之疯狂",149},
["上古鬼炎"]={"它燃烧着熊熊烈焰,携带者的力量在其炽热中迸发,犹如烈火般强大无比",149},
["火凤之舞"]={"一柄灼热的利器挥舞间万千火花四溅，燃烧着敌人的防御释放出极致的魔法能量,引领法师征战沙场",149},
["绿玉无极"]={"散发着强大灵性波动的武器，让使用者能够准确地施展各种神秘的咒语和技能,战无不胜",149},
["真龙战甲"]={"钢劲无比的铠甲,犹如龙鳞般坚韧展现出战士强大的生命气息",149,"战士职业S2系列",250},
["真龙战衣"]={"钢劲无比的铠甲,犹如龙鳞般坚韧展现出战士强大的生命气息",149,"战士职业S2系列",250},
["狂魔披风"]={"神秘的黑色披风,散发着强大的魔法,让法师的战斗力大增度提升",149,"法师职业S2系列",250},
["狂魔雨衣"]={"神秘的黑色披风,散发着强大的魔法,让法师的战斗力大增度提升",149,"法师职业S2系列",250},
["皓尊道袍"]={"华丽的绿色长袍,高级道士的装束气势磅礴,彰显威严",149,"道士职业S2系列",250},
["皓尊长袍"]={"华丽的绿色长袍,高级道士的装束气势磅礴,彰显威严",149,"道士职业S2系列",250},
["狂战头盔"]={"铸于屠龙勇气之魂的战士装备,让他们在战斗中勇往直前,无坚不催闪耀着无尽的战斗荣耀",149,"战士职业S2系列",250},
["混世头盔"]={"炼于魔法之火的装备,能够令拥有者随心所欲破除一切阻碍,如同闪电般快速释放魔法,轻松击倒敌人",149,"法师职业S2系列",250},
["太极头盔"]={"以道士精气神凝成,蕴含着道家哲学的精髓,融合阴阳之力令恶魔闻风丧胆,是道士提升实力的套装",149,"道士职业S2系列",250},
["狂战项链"]={"铸于屠龙勇气之魂的战士装备,让他们在战斗中勇往直前,无坚不催闪耀着无尽的战斗荣耀",149,"战士职业S2系列",250},
["混世项链"]={"炼于魔法之火的装备,能够令拥有者随心所欲破除一切阻碍,如同闪电般快速释放魔法,轻松击倒敌人",149,"法师职业S2系列",250},
["太极项链"]={"以道士精气神凝成,蕴含着道家哲学的精髓,融合阴阳之力令恶魔闻风丧胆,是道士提升实力的套装",149,"道士职业S2系列",250},
["狂战手镯"]={"铸于屠龙勇气之魂的战士装备,让他们在战斗中勇往直前,无坚不催闪耀着无尽的战斗荣耀",149,"战士职业S2系列",250},
["混世手镯"]={"炼于魔法之火的装备,能够令拥有者随心所欲破除一切阻碍,如同闪电般快速释放魔法,轻松击倒敌人",149,"法师职业S2系列",250},
["太极手镯"]={"以道士精气神凝成,蕴含着道家哲学的精髓,融合阴阳之力令恶魔闻风丧胆,是道士提升实力的套装",149,"道士职业S2系列",250},
["狂战戒指"]={"铸于屠龙勇气之魂的战士装备,让他们在战斗中勇往直前,无坚不催闪耀着无尽的战斗荣耀",149,"战士职业S2系列",250},
["混世戒指"]={"炼于魔法之火的装备,能够令拥有者随心所欲破除一切阻碍,如同闪电般快速释放魔法,轻松击倒敌人",149,"法师职业S2系列",250},
["太极戒指"]={"以道士精气神凝成,蕴含着道家哲学的精髓,融合阴阳之力令恶魔闻风丧胆,是道士提升实力的套装",149,"道士职业S2系列",250},
["狂战腰带"]={"铸于屠龙勇气之魂的战士装备,让他们在战斗中勇往直前,无坚不催闪耀着无尽的战斗荣耀",149,"战士职业S2系列",250},
["混世腰带"]={"炼于魔法之火的装备,能够令拥有者随心所欲破除一切阻碍,如同闪电般快速释放魔法,轻松击倒敌人",149,"法师职业S2系列",250},
["太极腰带"]={"以道士精气神凝成,蕴含着道家哲学的精髓,融合阴阳之力令恶魔闻风丧胆,是道士提升实力的套装",149,"道士职业S2系列",250},
["狂战圣靴"]={"铸于屠龙勇气之魂的战士装备,让他们在战斗中勇往直前,无坚不催闪耀着无尽的战斗荣耀",149,"战士职业S2系列",250},
["混世法靴"]={"炼于魔法之火的装备,能够令拥有者随心所欲破除一切阻碍,如同闪电般快速释放魔法,轻松击倒敌人",149,"法师职业S2系列",250},
["太极道靴"]={"以道士精气神凝成,蕴含着道家哲学的精髓,融合阴阳之力令恶魔闻风丧胆,是道士提升实力的套装",149,"道士职业S2系列",250},
["狂战勋章"]={"铸于屠龙勇气之魂的战士勋章,让他们在战斗中勇往直前,无坚不催闪耀着无尽的战斗荣耀",149},
["混世勋章"]={"炼于魔法之火的勋章,能够令拥有者随心所欲破除一切阻碍,如同闪电般快速释放魔法,轻松击倒敌人",149},
["太极勋章"]={"以道士精气神凝成,蕴含着道家哲学的精髓,融合阴阳之力令恶魔闻风丧胆,此勋章提升实力的套装",149},
["狂战斗笠"]={"铸于屠龙勇气之魂的战士斗笠,让他们在战斗中勇往直前,无坚不催闪耀着无尽的战斗荣耀",149},
["混世斗笠"]={"炼于魔法之火的斗笠,能够令拥有者随心所欲破除一切阻碍,如同闪电般快速释放魔法,轻松击倒敌人",149},
["太极斗笠"]={"以道士精气神凝成,蕴含着道家哲学的精髓,融合阴阳之力令恶魔闻风丧胆,此斗笠道士提升实力的",149},

["鬼斧屠戮"] = {"以龙角为主材的绝世神兵，寒芒曾现苍月，即使由寻常兵卒掌握亦能激发不世霸气，听说<font color='#00FF00'>沙巴克武器店</font>隐藏着它的秘密....",149},
["聚灵法杖"] = {"这件青色法杖犹如一股神秘力量在内流动能够释放出无穷的魔力让法师的威力无可匹敌听说<font color='#00FF00'>沙巴克武器店</font>隐藏着它的秘密",149},
["毒龙刺"] = {"剑身锋利如狂风，每一次挥舞都能带来惊人的威力，引领着道士行走江湖，听说<font color='#00FF00'>沙巴克武器店</font>隐藏着它的秘密....",149},
["圣龙战甲"]={"一身龙鳞铸就的银甲,浑身散发着凛冽的气息,威武不凡,令人敬畏",149,"战士职业S3系列",250},
["圣龙战衣"]={"一身龙鳞铸就的银甲,浑身散发着凛冽的气息,威武不凡,令人敬畏",149,"战士职业S3系列",250},
["魔龙披风"]={"拥有神秘龙纹和强大魔力,为穿戴者带来无与伦比的威势与力量,是法师战斗中的高阶装备",149,"法师职业S3系列",250},
["魔龙羽衣"]={"拥有神秘龙纹和强大魔力,为穿戴者带来无与伦比的威势与力量,是法师战斗中的高阶装备",149,"法师职业S3系列",250},
["御龙道袍"]={"此件道袍以龙为图案,龙鳞铸就凝聚着龙之力量,展现出强大的威严气息是道士的绝佳选择",149,"道士职业S3系列",250},
["御龙道衣"]={"此件道袍以龙为图案,龙鳞铸就凝聚着龙之力量,展现出强大的威严气息是道士的绝佳选择",149,"道士职业S3系列",250},
["玄铁战盔"]={"傲视天下气势磅礴的玄铁套装,只有拥有它的战士,才能有资格逐鹿玛法大陆",149,"战士职业S3系列",250},
["风雷魔盔"]={"法神曾触碰魔神之境, 其后闭关千年, 最终依照魔神之法参透了风雷之力, 随后传于玛法大陆",149,"法师职业S3系列",250},
["蓝灵道盔"]={"出自某位上古道人的天地洪炉，吸收了万年天地灵气方才制作而成只有道术极为高深者方能驾驭",149,"道士职业S3系列",250},
["玄铁项链"]={"傲视天下气势磅礴的玄铁套装,只有拥有它的战士,才能有资格逐鹿玛法大陆",149,"战士职业S3系列",250},
["风雷项链"]={"法神曾触碰魔神之境, 其后闭关千年, 最终依照魔神之法参透了风雷之力, 随后传于玛法大陆",149,"法师职业S3系列",250},
["蓝灵项链"]={"出自某位上古道人的天地洪炉，吸收了万年天地灵气方才制作而成只有道术极为高深者方能驾驭",149,"道士职业S3系列",250},
["玄铁手镯"]={"傲视天下气势磅礴的玄铁套装,只有拥有它的战士,才能有资格逐鹿玛法大陆",149,"战士职业S3系列",250},
["风雷手镯"]={"法神曾触碰魔神之境, 其后闭关千年, 最终依照魔神之法参透了风雷之力, 随后传于玛法大陆",149,"法师职业S3系列",250},
["蓝灵手镯"]={"出自某位上古道人的天地洪炉，吸收了万年天地灵气方才制作而成只有道术极为高深者方能驾驭",149,"道士职业S3系列",250},
["玄铁戒指"]={"傲视天下气势磅礴的玄铁套装,只有拥有它的战士,才能有资格逐鹿玛法大陆",149,"战士职业S3系列",250},
["风雷戒指"]={"法神曾触碰魔神之境, 其后闭关千年, 最终依照魔神之法参透了风雷之力, 随后传于玛法大陆",149,"法师职业S3系列",250},
["蓝灵戒指"]={"出自某位上古道人的天地洪炉，吸收了万年天地灵气方才制作而成只有道术极为高深者方能驾驭",149,"道士职业S3系列",250},
["玄铁腰带"]={"傲视天下气势磅礴的玄铁套装,只有拥有它的战士,才能有资格逐鹿玛法大陆",149,"战士职业S3系列",250},
["风雷腰带"]={"法神曾触碰魔神之境, 其后闭关千年, 最终依照魔神之法参透了风雷之力, 随后传于玛法大陆",149,"法师职业S3系列",250},
["蓝灵腰带"]={"出自某位上古道人的天地洪炉，吸收了万年天地灵气方才制作而成只有道术极为高深者方能驾驭",149,"道士职业S3系列",250},
["玄铁战靴"]={"傲视天下气势磅礴的玄铁套装,只有拥有它的战士,才能有资格逐鹿玛法大陆",149,"战士职业S3系列",250},
["风雷魔靴"]={"法神曾触碰魔神之境, 其后闭关千年, 最终依照魔神之法参透了风雷之力, 随后传于玛法大陆",149,"法师职业S3系列",250},
["蓝灵道靴"]={"出自某位上古道人的天地洪炉，吸收了万年天地灵气方才制作而成只有道术极为高深者方能驾驭",149,"道士职业S3系列",250},
["玄铁勋章"]={"傲视天下气势磅礴的玄铁勋章,只有拥有它的战士,才能有资格发挥出它那恐怕的攻击力",149},
["风雷勋章"]={"法神曾触碰魔神之境, 其后闭关千年, 最终依照魔神之法参透了风雷之力, 随后传于玛法大陆",},
["蓝灵勋章"]={"出自某位上古道人的天地洪炉，吸收了万年天地灵气方才制作而成只有道术极为高深者方能驾驭",149},
["玄铁斗笠"]={"傲视天下气势磅礴的玄铁斗笠,只有拥有它的战士,才能有资格发挥出它那恐怕的攻击力",149},
["风雷斗笠"]={"法神曾触碰魔神之境, 其后闭关千年, 最终依照魔神之法参透了风雷之力, 随后传于玛法大陆",149},
["蓝灵斗笠"]={"出自某位上古道人的天地洪炉，吸收了万年天地灵气方才制作而成只有道术极为高深者方能驾驭",149},

["暗黑审判者"] = {"代表着战士最坚定的信仰和最强大的力量，挥舞间风云变色，让你成为无敌王者，<font color='#00FF00'>白日门虎卫堂</font>的天尊对它很感兴趣..",249},
["天行权杖"] = {"此杖以雷霆之力为核心，千军万马皆可舞动于杖下，掌控乾坤无人可挡，绝世神威<font color='#00FF00'>白日门虎卫堂</font>的天尊对它很感兴趣....",249},
["太极羽扇"] = {"一扇翻涌天地间，万物皆可降服妙手回春，象征着玄妙无穷的道家精髓，是道士的法器<font color='#00FF00'>白日门虎卫堂</font>的天尊对它很感兴趣...",249},
["狂野战甲"]={"这款战甲外观狂野豪放,仿佛与野兽融为一体,展现出战士无畏无惧的战斗精神",249,"战士职业S4系列",253},
["狂野战衣"]={"这款战甲外观狂野豪放,仿佛与野兽融为一体,展现出战士无畏无惧的战斗精神",249,"战士职业S4系列",253},
["火凤之铠"]={"这款铠甲熔合着古老魔法,在战场上如火凤一般翱翔,绽放出毁天灭地的力量",249,"法师职业S4系列",253},
["火凰之铠"]={"这款铠甲熔合着古老魔法,在战场上如凤凰一般翱翔,绽放出毁天灭地的力量",249,"法师职业S4系列",253},
["天使之羽"]={"华丽的外观,展现出不俗气息，神秘符文的点缀,散发出深邃的神秘感",249,"道士职业S4系列",253},
["天使之翼"]={"华丽的外观,展现出不俗气息，神秘符文的点缀,散发出深邃的神秘感",249,"道士职业S4系列",253},
["傲天々圣盔"]={"据说只有最强大的战士才有资格佩戴，它赋予了战士无与伦比的力量和防御，能够在战斗中霸气无双",249,"战士职业S4系列",253},
["幻天々魔盔"]={"它蕴含着神秘的魔力是法师们梦寐以求的装备，可以大幅提升法师的法术和防御，让法师成为战场上的主宰者",249,"法师职业S4系列",253},
["玄天々道盔"]={"神秘的玄天能量凝聚,铸就出道士最为霸气的装备它扼住天地之力蕴含着无尽的力量,在战场上成为道士的最强后盾",249,"道士职业S4系列",253},
["傲天々圣链"]={"据说只有最强大的战士才有资格佩戴，它赋予了战士无与伦比的力量和防御，能够在战斗中霸气无双",249,"战士职业S4系列",253},
["幻天々魔链"]={"它蕴含着神秘的魔力是法师们梦寐以求的装备，可以大幅提升法师的法术和防御，让法师成为战场上的主宰者",249,"法师职业S4系列",253},
["玄天々道链"]={"神秘的玄天能量凝聚,铸就出道士最为霸气的装备它扼住天地之力蕴含着无尽的力量,在战场上成为道士的最强后盾",249,"道士职业S4系列",253},
["傲天々圣镯"]={"据说只有最强大的战士才有资格佩戴，它赋予了战士无与伦比的力量和防御，能够在战斗中霸气无双",249,"战士职业S4系列",253},
["幻天々魔镯"]={"它蕴含着神秘的魔力是法师们梦寐以求的装备，可以大幅提升法师的法术和防御，让法师成为战场上的主宰者",249,"法师职业S4系列",253},
["玄天々道镯"]={"神秘的玄天能量凝聚,铸就出道士最为霸气的装备它扼住天地之力蕴含着无尽的力量,在战场上成为道士的最强后盾",249,"道士职业S4系列",253},
["傲天々圣戒"]={"据说只有最强大的战士才有资格佩戴，它赋予了战士无与伦比的力量和防御，能够在战斗中霸气无双",249,"战士职业S4系列",253},
["幻天々魔戒"]={"它蕴含着神秘的魔力是法师们梦寐以求的装备，可以大幅提升法师的法术和防御，让法师成为战场上的主宰者",249,"法师职业S4系列",253},
["玄天々道戒"]={"神秘的玄天能量凝聚,铸就出道士最为霸气的装备它扼住天地之力蕴含着无尽的力量,在战场上成为道士的最强后盾",249,"道士职业S4系列",253},
["傲天々圣带"]={"据说只有最强大的战士才有资格佩戴，它赋予了战士无与伦比的力量和防御，能够在战斗中霸气无双",249,"战士职业S4系列",253},
["幻天々魔带"]={"它蕴含着神秘的魔力是法师们梦寐以求的装备，可以大幅提升法师的法术和防御，让法师成为战场上的主宰者",249,"法师职业S4系列",253},
["玄天々道带"]={"神秘的玄天能量凝聚,铸就出道士最为霸气的装备它扼住天地之力蕴含着无尽的力量,在战场上成为道士的最强后盾",249,"道士职业S4系列",253},
["傲天々圣靴"]={"据说只有最强大的战士才有资格佩戴，它赋予了战士无与伦比的力量和防御，能够在战斗中霸气无双",249,"战士职业S4系列",253},
["幻天々魔靴"]={"它蕴含着神秘的魔力是法师们梦寐以求的装备，可以大幅提升法师的法术和防御，让法师成为战场上的主宰者",249,"法师职业S4系列",253},
["玄天々道靴"]={"神秘的玄天能量凝聚,铸就出道士最为霸气的装备它扼住天地之力蕴含着无尽的力量,在战场上成为道士的最强后盾",249,"道士职业S4系列",253},
["傲天々斗笠"]={"据说只有最强大的战士才有资格佩戴，它赋予了战士无与伦比的力量和防御，能够在战斗中霸气无双",249},
["幻天々斗笠"]={"它蕴含着神秘的魔力是法师们梦寐以求的斗笠，可以大幅提升法师的法术和防御，让法师成为战场上的主宰者",249},
["玄天々斗笠"]={"神秘的玄天能量凝聚,铸就出道士最为霸气的勋章能调动天地之力蕴含着无尽的道法,是道士在战场上的最强后盾",249},
["傲天々勋章"]={"据说只有最强大的战士才有资格佩戴，它赋予了战士无与伦比的力量和防御，能够在战斗中霸气无双",249},
["幻天々勋章"]={"它蕴含着神秘的魔力是法师们梦寐以求的勋章，可以大幅提升法师的法术和防御，让法师成为战场上的主宰者",249},
["玄天々勋章"]={"神秘的玄天能量凝聚,铸就出道士最为霸气的勋章能调动天地之力蕴含着无尽的道法,是道士在战场上的最强后盾",249},
["传说:无影剑"]={"剑锋闪耀着刺破天际的光芒，一股沉稳而又激烈的力量从剑身传来犹如战士内心的火焰与信念一般",249},
["传说:易水寒"]={"这把法杖犹如冰川中的一抹清流蕴含着冰雪元素的能量，能够让法师的魔法更为强大以及凌厉",249},
["传说:太乙扇"]={"挥舞间风起云涌散发着神秘之力无论是平定战局还是斩妖除魔，都能给予道士无与伦比的信仰",249},
["冥火(男)"]={"以深邃的黑色为主色调,配有炫目的火红色饰边,仿佛能召唤出熊熊燃烧的烈焰将敌人化为灰烬",249,"法师职业S5系列",253},
["冥火(女)"]={"以深邃的黑色为主色调,配有炫目的火红色饰边,仿佛能召唤出熊熊燃烧的烈焰将敌人化为灰烬",249,"法师职业S5系列",253},
["天罚(男)"]={"以天空为灵感,流畅的线条勾勒出独特的灵气,色彩鲜亮至高无上的威严让人心生敬畏",249,"道士职业S5系列",253},
["天罚(女)"]={"以天空为灵感,流畅的线条勾勒出独特的灵气,色彩鲜亮至高无上的威严让人心生敬畏",249,"道士职业S5系列",253},
["鬼浮屠(男)"]={"这套神秘的黑衣银甲,锋芒毕露,彰显战士雄风,威压四方,让你成为战场上的霸主",249,"战士职业S5系列",253},
["鬼浮屠(女)"]={"这套神秘的黑衣银甲,锋芒毕露,彰显战士雄风,威压四方,让你成为战场上的霸主",249,"战士职业S5系列",253},
["赤影★圣盔"]={"这套装备拥有自己的灵性，只有勇敢的战士才能获得它的青睐，传说它从诞生至今只侍奉过两位主人他们皆是拯救玛法大陆的英雄",249,"战士职业S5系列",253},
["焚天★魔盔"]={"它是法师们一生追求的至宝,锋利的刺针闪耀着魔法的光芒,可以轻松地打破敌人的防御,同时还能为其提供强大的防御和增益效果",249,"法师职业S5系列",253},
["远古★道盔"]={"蕴含着无穷的神秘能量,仿佛能够融入天地间最纯粹的灵气,让道士的灵魂得到升华,化身为最神秘的潜行者,让万物俯首称臣",249,"道士职业S5系列",253},
["赤影★圣链"]={"这套装备拥有自己的灵性，只有勇敢的战士才能获得它的青睐，传说它从诞生至今只侍奉过两位主人他们皆是拯救玛法大陆的英雄",249,"战士职业S5系列",253},
["焚天★魔链"]={"它是法师们一生追求的至宝,锋利的刺针闪耀着魔法的光芒,可以轻松地打破敌人的防御,同时还能为其提供强大的防御和增益效果",249,"法师职业S5系列",253},
["远古★道链"]={"蕴含着无穷的神秘能量,仿佛能够融入天地间最纯粹的灵气,让道士的灵魂得到升华,化身为最神秘的潜行者,让万物俯首称臣",249,"道士职业S5系列",253},
["赤影★圣镯"]={"这套装备拥有自己的灵性，只有勇敢的战士才能获得它的青睐，传说它从诞生至今只侍奉过两位主人他们皆是拯救玛法大陆的英雄",249,"战士职业S5系列",253},
["焚天★魔镯"]={"它是法师们一生追求的至宝,锋利的刺针闪耀着魔法的光芒,可以轻松地打破敌人的防御,同时还能为其提供强大的防御和增益效果",249,"法师职业S5系列",253},
["远古★道镯"]={"蕴含着无穷的神秘能量,仿佛能够融入天地间最纯粹的灵气,让道士的灵魂得到升华,化身为最神秘的潜行者,让万物俯首称臣",249,"道士职业S5系列",253},
["赤影★圣戒"]={"这套装备拥有自己的灵性，只有勇敢的战士才能获得它的青睐，传说它从诞生至今只侍奉过两位主人他们皆是拯救玛法大陆的英雄",249,"战士职业S5系列",253},
["焚天★魔戒"]={"它是法师们一生追求的至宝,锋利的刺针闪耀着魔法的光芒,可以轻松地打破敌人的防御,同时还能为其提供强大的防御和增益效果",249,"法师职业S5系列",253},
["远古★道戒"]={"蕴含着无穷的神秘能量,仿佛能够融入天地间最纯粹的灵气,让道士的灵魂得到升华,化身为最神秘的潜行者,让万物俯首称臣",249,"道士职业S5系列",253},
["赤影★圣带"]={"这套装备拥有自己的灵性，只有勇敢的战士才能获得它的青睐，传说它从诞生至今只侍奉过两位主人他们皆是拯救玛法大陆的英雄",249,"战士职业S5系列",253},
["焚天★魔带"]={"它是法师们一生追求的至宝,锋利的刺针闪耀着魔法的光芒,可以轻松地打破敌人的防御,同时还能为其提供强大的防御和增益效果",249,"法师职业S5系列",253},
["远古★道带"]={"蕴含着无穷的神秘能量,仿佛能够融入天地间最纯粹的灵气,让道士的灵魂得到升华,化身为最神秘的潜行者,让万物俯首称臣",249,"道士职业S5系列",253},
["赤影★圣靴"]={"这套装备拥有自己的灵性，只有勇敢的战士才能获得它的青睐，传说它从诞生至今只侍奉过两位主人他们皆是拯救玛法大陆的英雄",249,"战士职业S5系列",253},
["焚天★魔靴"]={"它是法师们一生追求的至宝,锋利的刺针闪耀着魔法的光芒,可以轻松地打破敌人的防御,同时还能为其提供强大的防御和增益效果",249,"法师职业S5系列",253},
["远古★道靴"]={"蕴含着无穷的神秘能量,仿佛能够融入天地间最纯粹的灵气,让道士的灵魂得到升华,化身为最神秘的潜行者,让万物俯首称臣",249,"道士职业S5系列",253},
["猎魔人★勋章(传说)"]={"此勋章是玛法大陆中最为崇高的荣誉象征，只有战功赫赫的玩家才能拥有它，凝聚着千万玩家的信仰和荣耀",249},
["猎魔人★勋章"]={"它如同一面闪烁着神秘光芒的荣耀标志，象征着勇气力量，智慧和毅力拥有它的人就是玛法大陆中真正的猎手",249},
["猎魔人★斗笠"]={"黑色魔法之力凝聚神秘而又威严承载着猎魔人的决心与力量，无论面对何种丧心病狂的怪物，都能令其闻风丧胆",249},
["猎魔人★斗笠(传说)"]={"此斗笠是玛法大陆中最为崇高的荣誉象征，只有战功赫赫的玩家才能拥有它，凝聚着千万玩家的信仰和荣耀",249},
["游龙ぬ锥心斩"]={"这把武器剑芒如游龙出海，每一次斩击都仿佛能撕裂敌人的防御直插敌心,展现出战士强悍的战斗力",249},
["咆哮ぬ怒吼杖"]={"这柄法杖恍若一条神龙,凝聚着无上魔法,每一次挥舞都能引起恐怖的魔法波动,摧毁敌人的防御",249},
["契约ぬ神罚剑"]={"凝聚玄妙道法的神器,锋利无比所过之处无不颤抖,无数敌人在其锋芒下灰飞烟灭,更是威不可挡",249},
["游龙ぬ锥心甲"]={"这件战甲强悍无比,穿上后不仅能够增加战士的攻击力和防御力,更能令敌人在面对战士时心生畏惧",249,"战士职业S6系列",253},
["游龙ぬ锥心袍"]={"这件战袍强悍无比,穿上后不仅能够增加战士的攻击力和防御力,更能令敌人在面对战士时心生畏惧",249,"战士职业S6系列",253},
["咆哮ぬ怒吼甲"]={"它所蕴含的魔法力和防御,足以让任何敌人颤抖,犹如一头狂暴的巨兽在咆哮,每一次施法都似乎要撕裂整片大陆",249,"法师职业S6系列",253},
["咆哮ぬ怒吼袍"]={"它所蕴含的魔法力和防御,足以让任何敌人颤抖,犹如一头狂暴的巨兽在咆哮,每一次施法都似乎要撕裂整片大陆",249,"法师职业S6系列",253},
["契约ぬ神罚甲"]={"契约神罚甲神圣之光护体，道法无尽道士凌空一指，天地为之变色唯有此甲才能抵御魔王侵蚀可镇压天下群魔",249,"道士职业S6系列",253},
["契约ぬ神罚袍"]={"契约神罚袍神圣之光护体，道法无尽道士凌空一指，天地为之变色唯有此甲才能抵御魔王侵蚀可镇压天下群魔",249,"道士职业S6系列",253},
["游龙ぬ锥心盔"]={"铸就巅峰战士的套装,它散发着逆天的威能,凝聚着战士的勇气和决心,只有那些勇敢无畏，永不言败的战士才能佩戴它",249,"战士职业S6系列",253},
["咆哮ぬ怒吼盔"]={"蕴含着法师的狂傲与霸气,施法时就如巨龙咆哮，让人心生敬畏,是法师界中最为神秘强大的套装",249,"法师职业S6系列",253},
["契约ぬ神罚盔"]={"此套装备其上蕴含着天地灵气,拥有着毁天灭地的威力,只要戴上神罚即刻降临，让敌人无所遁形,只能任凭其神圣之力洗礼",249,"道士职业S6系列",253},
["游龙ぬ锥心链"]={"铸就巅峰战士的套装,它散发着逆天的威能,凝聚着战士的勇气和决心,只有那些勇敢无畏，永不言败的战士才能佩戴它",249,"战士职业S6系列",253},
["咆哮ぬ怒吼链"]={"蕴含着法师的狂傲与霸气,施法时就如巨龙咆哮，让人心生敬畏,是法师界中最为神秘强大的套装",249,"法师职业S6系列",253},
["契约ぬ神罚链"]={"此套装备其上蕴含着天地灵气,拥有着毁天灭地的威力,只要戴上神罚即刻降临，让敌人无所遁形,只能任凭其神圣之力洗礼",249,"道士职业S6系列",253},
["游龙ぬ锥心镯"]={"铸就巅峰战士的套装,它散发着逆天的威能,凝聚着战士的勇气和决心,只有那些勇敢无畏，永不言败的战士才能佩戴它",249,"战士职业S6系列",253},
["咆哮ぬ怒吼镯"]={"蕴含着法师的狂傲与霸气,施法时就如巨龙咆哮，让人心生敬畏,是法师界中最为神秘强大的套装",249,"法师职业S6系列",253},
["契约ぬ神罚镯"]={"此套装备其上蕴含着天地灵气,拥有着毁天灭地的威力,只要戴上神罚即刻降临，让敌人无所遁形,只能任凭其神圣之力洗礼",249,"道士职业S6系列",253},
["游龙ぬ锥心戒"]={"铸就巅峰战士的套装,它散发着逆天的威能,凝聚着战士的勇气和决心,只有那些勇敢无畏，永不言败的战士才能佩戴它",249,"战士职业S6系列",253},
["咆哮ぬ怒吼戒"]={"蕴含着法师的狂傲与霸气,施法时就如巨龙咆哮，让人心生敬畏,是法师界中最为神秘强大的套装",249,"法师职业S6系列",253},
["契约ぬ神罚戒"]={"此套装备其上蕴含着天地灵气,拥有着毁天灭地的威力,只要戴上神罚即刻降临，让敌人无所遁形,只能任凭其神圣之力洗礼",249,"道士职业S6系列",253},
["游龙ぬ锥心带"]={"铸就巅峰战士的套装,它散发着逆天的威能,凝聚着战士的勇气和决心,只有那些勇敢无畏，永不言败的战士才能佩戴它",249,"战士职业S6系列",253},
["咆哮ぬ怒吼带"]={"蕴含着法师的狂傲与霸气,施法时就如巨龙咆哮，让人心生敬畏,是法师界中最为神秘强大的套装",249,"法师职业S6系列",253},
["契约ぬ神罚带"]={"此套装备其上蕴含着天地灵气,拥有着毁天灭地的威力,只要戴上神罚即刻降临，让敌人无所遁形,只能任凭其神圣之力洗礼",249,"道士职业S6系列",253},
["游龙ぬ锥心靴"]={"铸就巅峰战士的套装,它散发着逆天的威能,凝聚着战士的勇气和决心,只有那些勇敢无畏，永不言败的战士才能佩戴它",249,"战士职业S6系列",253},
["咆哮ぬ怒吼靴"]={"蕴含着法师的狂傲与霸气,施法时就如巨龙咆哮，让人心生敬畏,是法师界中最为神秘强大的套装",249,"法师职业S6系列",253},
["契约ぬ神罚靴"]={"此套装备其上蕴含着天地灵气,拥有着毁天灭地的威力,只要戴上神罚即刻降临，让敌人无所遁形,只能任凭其神圣之力洗礼",249,"道士职业S6系列",253},
["猎魔人★勋章(神话)"]={"拥有它的玩家,不仅在战斗中具备强大的能力,更能展现出无与伦比的王者风范,成为玛法大陆中最耀眼的存在",249},
["猎魔人★斗笠(神话)"]={"拥有它的玩家,不仅在战斗中具备强大的能力,更能展现出无与伦比的王者风范,成为玛法大陆中最耀眼的存在!",249},
["阿修罗ぬ命运之殇"]={"唯有愤怒，才能呼唤它的降临,钢铁般的坚韧与血腥般的暴戾,瞬间能展现其犀利的攻击,持剑者从此独步天下",249},
["帝释天ぬ流星之陨"]={"唯此神杖能引领天下风华，蕴含了宇宙的力量和法师的智慧，能够在一瞬间释放出超乎想象的毁灭性能量,让敌人彻底崩溃",249},
["迦楼罗ぬ万剑归宗"]={"此剑其锋利足以撕裂天际之云,其威力足以镇压魔物之心,传承天地之灵气,参悟无上道法，为拥有者带来一份无上的霸气",249},
["阿修罗ぬ神甲"]={"穿上此甲犹如天上降临的战神,剑指敌阵铁蹄踏破战场,神威盖世战意燃烧如火,誓要歼灭敌人驱散黑暗铸就传奇",249,"战士职业S7系列",253},
["阿修罗ぬ神袍"]={"穿上此甲犹如天上降临的战神,剑指敌阵铁蹄踏破战场,神威盖世战意燃烧如火,誓要歼灭敌人驱散黑暗铸就传奇",249,"战士职业S7系列",253},
["帝释天ぬ神甲"]={"身披帝释天神甲犹如神明降下凡间,无坚不摧,任何敢于挑战他的人,最终都将在那闪耀着神光的铠甲下败北",249,"法师职业S7系列",253},
["帝释天ぬ神袍"]={"身披帝释天神袍犹如神明降下凡间,无坚不摧,任何敢于挑战他的人,最终都将在那闪耀着神光的铠甲下败北",249,"法师职业S7系列",253},
["迦楼罗ぬ神甲"]={"穿戴者拥有无坚不摧的防御力和强大的道术力,令人惊叹的是它的美丽与霸气并存,彰显着道士的威严和尊贵",249,"道士职业S7系列",253},
["迦楼罗ぬ神袍"]={"穿戴者拥有无坚不摧的防御力和强大的道术力,令人惊叹的是它的美丽与霸气并存,彰显着道士的威严和尊贵",249,"道士职业S7系列",253},
["阿修罗ぬ神盔"]={"熔炼魔族战魂而成的神装,象征着战士的最高荣耀,就像阿修罗族一样,易怒好斗但骁勇善战，令人勇往直前,无所畏惧",249,"战士职业S7系列",253},
["帝释天ぬ神盔"]={"法师的巅峰套装产自雷云之海的神器，铸成之时群龙乱舞天雷响彻苍穹，此神器装备时亦有雷声轰呜偶尔还可听见龙吟低吼",249,"法师职业S7系列",253},
["迦楼罗ぬ神盔"]={"迦楼罗是传说中的神鸟以龙为食常被形容为有着火红的羽毛和龙头蛇尾的外形其骸骨打造成为最顶级的道士装备",249,"道士职业S7系列",253},
["阿修罗ぬ神链"]={"熔炼魔族战魂而成的神装,象征着战士的最高荣耀,就像阿修罗族一样,易怒好斗但骁勇善战，令人勇往直前,无所畏惧",249,"战士职业S7系列",253},
["帝释天ぬ神链"]={"法师的巅峰套装产自雷云之海的神器，铸成之时群龙乱舞天雷响彻苍穹，此神器装备时亦有雷声轰呜偶尔还可听见龙吟低吼",249,"法师职业S7系列",253},
["迦楼罗ぬ神链"]={"迦楼罗是传说中的神鸟以龙为食常被形容为有着火红的羽毛和龙头蛇尾的外形其骸骨打造成为最顶级的道士装备",249,"道士职业S7系列",253},
["阿修罗ぬ神镯"]={"熔炼魔族战魂而成的神装,象征着战士的最高荣耀,就像阿修罗族一样,易怒好斗但骁勇善战，令人勇往直前,无所畏惧",249,"战士职业S7系列",253},
["帝释天ぬ神镯"]={"法师的巅峰套装产自雷云之海的神器，铸成之时群龙乱舞天雷响彻苍穹，此神器装备时亦有雷声轰呜偶尔还可听见龙吟低吼",249,"法师职业S7系列",253},
["迦楼罗ぬ神镯"]={"迦楼罗是传说中的神鸟以龙为食常被形容为有着火红的羽毛和龙头蛇尾的外形其骸骨打造成为最顶级的道士装备",249,"道士职业S7系列",253},
["阿修罗ぬ神戒"]={"熔炼魔族战魂而成的神装,象征着战士的最高荣耀,就像阿修罗族一样,易怒好斗但骁勇善战，令人勇往直前,无所畏惧",249,"战士职业S7系列",253},
["帝释天ぬ神戒"]={"法师的巅峰套装产自雷云之海的神器，铸成之时群龙乱舞天雷响彻苍穹，此神器装备时亦有雷声轰呜偶尔还可听见龙吟低吼",249,"法师职业S7系列",253},
["迦楼罗ぬ神戒"]={"迦楼罗是传说中的神鸟以龙为食常被形容为有着火红的羽毛和龙头蛇尾的外形其骸骨打造成为最顶级的道士装备",249,"道士职业S7系列",253},
["阿修罗ぬ神带"]={"熔炼魔族战魂而成的神装,象征着战士的最高荣耀,就像阿修罗族一样,易怒好斗但骁勇善战，令人勇往直前,无所畏惧",249,"战士职业S7系列",253},
["帝释天ぬ神带"]={"法师的巅峰套装产自雷云之海的神器，铸成之时群龙乱舞天雷响彻苍穹，此神器装备时亦有雷声轰呜偶尔还可听见龙吟低吼",249,"法师职业S7系列",253},
["迦楼罗ぬ神带"]={"迦楼罗是传说中的神鸟以龙为食常被形容为有着火红的羽毛和龙头蛇尾的外形其骸骨打造成为最顶级的道士装备",249,"道士职业S7系列",253},
["阿修罗ぬ神靴"]={"熔炼魔族战魂而成的神装,象征着战士的最高荣耀,就像阿修罗族一样,易怒好斗但骁勇善战，令人勇往直前,无所畏惧",249,"战士职业S7系列",253},
["帝释天ぬ神靴"]={"法师的巅峰套装产自雷云之海的神器，铸成之时群龙乱舞天雷响彻苍穹，此神器装备时亦有雷声轰呜偶尔还可听见龙吟低吼",249,"法师职业S7系列",253},
["迦楼罗ぬ神靴"]={"迦楼罗是传说中的神鸟以龙为食常被形容为有着火红的羽毛和龙头蛇尾的外形其骸骨打造成为最顶级的道士装备",249,"道士职业S7系列",253},
["猎魔人★勋章(完美)"]={"象征着持之以恒,不断突破自我的勇气和毅力,获得它的玩家不仅证明了自己的实力,更获得了众人的尊敬和仰慕",249},
["猎魔人★斗笠(完美)"]={"象征着持之以恒,不断突破自我的勇气和毅力,获得它的玩家不仅证明了自己的实力,更获得了众人的尊敬和仰慕",249},
["虹魔项链"]={"以血精石打造而成的装备,闪烁着鲜艳的红色光芒,攻击目标时可吸收对方生命值",149,"特殊系列装备",250},
["虹魔手镯"]={"以血精石打造而成的装备,闪烁着鲜艳的红色光芒,攻击目标时可吸收对方生命值",149,"特殊系列装备",250},
["虹魔戒指"]={"以血精石打造而成的装备,闪烁着鲜艳的红色光芒,攻击目标时可吸收对方生命值",149,"特殊系列装备",250},
["吸血项链"]={"上古邪教用古老妖法淬炼而成,弥漫着邪恶的气息,仿佛能将世间的鲜血吸食殆忠",149,"特殊系列装备",250},
["吸血手镯"]={"上古邪教用古老妖法淬炼而成,弥漫着邪恶的气息,仿佛能将世间的鲜血吸食殆忠",149,"特殊系列装备",250},
["吸血戒指"]={"上古邪教用古老妖法淬炼而成,弥漫着邪恶的气息,仿佛能将世间的鲜血吸食殆忠",149,"特殊系列装备",250},
["魔血项链"]={"打造时融入了魔龙之血的项链,十多年前出世时,也曾在玛法大陆掀起过一场血雨腥风",149,"特殊系列装备",250},
["魔血手镯"]={"打造时融入了魔龙之血的手镯,曾有人妄想凭此镯称霸玛法大陆,但显然他并没有成功",149,"特殊系列装备",250},
["魔血戒指"]={"打造时融入了魔龙之血的戒指,曾有人妄想凭此戒称霸玛法大陆,但显然他并没有成功",149,"特殊系列装备",250},
["怒血项链"]={"以怒血为名的凶邪项链,质地不明能唤醒人内心最深处的狂癫战意",149,"特殊系列装备",250},
["怒血手镯"]={"以怒血为名的凶邪手镯,质地不明能唤醒人内心最深处的狂癫战意",149,"特殊系列装备",250},
["怒血戒指"]={"以怒血为名的凶邪戒指,质地不明能唤醒人内心最深处的狂癫战意",149,"特殊系列装备",250},
["祈祷项链"]={"祈祷套的出现往往是大灾变的前兆天尊因不忍人间生灵涂炭，联合三大神匠铸造了全新的祈祷套装",149,"特殊系列装备(人物死亡后消失)",250},
["祈祷手镯"]={"祈祷套的出现往往是大灾变的前兆天尊因不忍人间生灵涂炭，联合三大神匠铸造了全新的祈祷套装",149,"特殊系列装备(人物死亡后消失)",250},
["祈祷戒指"]={"祈祷套的出现往往是大灾变的前兆天尊因不忍人间生灵涂炭，联合三大神匠铸造了全新的祈祷套装",149,"特殊系列装备(人物死亡后消失)",250},
["祈祷头盔"]={"祈祷套的出现往往是大灾变的前兆天尊因不忍人间生灵涂炭，联合三大神匠铸造了全新的祈祷套装",149,"特殊系列装备(人物死亡后消失)",250},
["重击头盔"]={"蕴含着无穷的力量和气势,能够为玩家提升无与伦比的重击几率,让你在战场上无往不利,霸气十足",149,"特殊系列装备",250},
["重击靴子"]={"蕴含着无穷的力量和气势,能够为玩家提升无与伦比的重击几率,让你在战场上无往不利,霸气十足",149,"特殊系列装备",250},
["重击腰带"]={"蕴含着无穷的力量和气势,能够为玩家提升无与伦比的重击几率,让你在战场上无往不利,霸气十足",149,"特殊系列装备",250},
["坚固的阎罗手套"]={"它的外观威武霸气,具有较大的防御力,能够为玩家提供强大的战斗保护,是很多玩家梦寐以求的装备",149,"特殊系列装备",250},
["1.1倍防御盔"]={"该装备拥有着独特的设计和精湛的制作工艺具备着极高的防御属性能够有效抵御来自敌人的伤害",149,"特殊系列装备",250},
["1.2倍防御盔"]={"具有极高防御属性的头盔能够有效提升使用者的生存能力和战斗力让你在战斗中更加强悍和霸气",149,"特殊系列装备",250},
["破甲指环"]={"拥有强大的主属性和破防效果,穿戴者可轻松的突破对手的防御,造成致命伤害,很多勇士都想拥有它",149,"特殊系列装备",250},
["记忆头盔"]={"神秘高人所打造的宝物它能够提供较强的防御力和对怪增伤属性让玩家在打宝过程中如虎添翼",149,"特殊系列装备",250},
["记忆项链"]={"神秘高人所打造的宝物它能够提供较强的防御力和对怪增伤属性让玩家在打宝过程中如虎添翼",149,"特殊系列装备",250},
["降妖除魔镯"]={"寄予了工匠们对它的深厚期盼赋予了较强的主属性以及对怪物有一定的增伤效果",149,"特殊系列装备",250},
["降妖除魔戒"]={"寄予了工匠们对它的深厚期盼赋予了较强的主属性以及对怪物有一定的增伤效果",149,"特殊系列装备",250},
["打野盔"]={"具备强大的属性加成和防御能力该装备可以大大提高玩家在野外战斗中的生存能力和输出能力",149,"特殊系列装备",250},
["魔鬼头盔"]={"穿戴后可提升人物的暴击几率犹如鬼魅一般闪动着蛊惑人心的欲念",149,"特殊系列装备",250},
["魔鬼腰带"]={"穿戴后可提升人物的暴击几率犹如鬼魅一般闪动着蛊惑人心的欲念",149,"特殊系列装备",250},
["魔鬼靴子"]={"穿戴后可提升人物的暴击几率犹如鬼魅一般闪动着蛊惑人心的欲念",149,"特殊系列装备",250},
["暴君头盔"]={"它拥有高强度的物理和魔法防御能有效保护玩家免受敌人的伤害同时能提升佩戴者的暴击几率",149,"特殊系列装备",250},
["暴君腰带"]={"它拥有高强度的魔法防御能有效保护玩家免受敌人的伤害同时能提升佩戴者的暴击几率",149,"特殊系列装备",250},
["暴君靴子"]={"它拥有高强度的物理防御能有效保护玩家免受敌人的伤害同时能提升佩戴者的暴击几率",149,"特殊系列装备",250},
["祝福项链"]={"作为玛法大陆最为珍贵的装备之一蕴含着祝福仙子的祝福之力可使佩戴者的战斗力达到最高境界",149,"特殊系列装备",249},
["上帝之吻"]={"曾有人怀疑过上帝的存在而这一只被上帝亲吻过的手镯证实了他们的愚不可及",149,"特殊系列装备",250},
["后羿之光"]={"拥有高属性和暴击抵抗率，能够有效提升玩家的战斗力，同时霸气的属性更令人惊叹在战斗中更具优势",149,"特殊系列装备",250},
["死神戒指"]={"具有强大的属性加成和抵抗暴击伤害的效果能大幅度提升使用者的战斗力,让勇士们趋之若鹜",149,"特殊系列装备",250},
["龙渊戒指"]={"它的属性极为强大,不仅拥有高额的主属性,还能抵抗敌人的吸血效果,一眼就能感受到它的强大威势",149,"特殊系列装备",250},
["狂风项链"]={"就像被密封起来的狂风,它将提高佩戴者的攻击速度,玛法大陆增速装备之一",149,"特殊系列装备",250},
["狂风戒指"]={"就像被密封起来的狂风,它将提高佩戴者的攻击速度,玛法大陆增速装备之一",149,"特殊系列装备",250},
["疾风项链"]={"它的名字来源于狂风般的速度和强大的攻击力即使在瞬间战斗中也能助你扭转战局",149,"特殊系列装备",249},
["疾风戒指"]={"它的名字来源于狂风般的速度和强大的攻击力即使在瞬间战斗中也能助你扭转战局",149,"特殊系列装备",249},
["白色虎齿项链"]={"具备强大的单体魔法和火雨躲避效果让佩戴者更加神勇无敌霸气十足",149,"特殊系列装备",250},
["辟邪手镯"]={"以红绳捆缚的手镯,可以辟邪明目增强佩戴者的敏捷",149,"特殊系列装备",250},
["躲避手链"]={"魔龙教主之牙所铸手链,以魂玉抑制魔气,能提高佩戴者的敏捷善战者的高端配置",149,"特殊系列装备",250},
["夏普尔手镯"]={"这个手镯背后有一个悲伤的故事也许玛法大陆上最博学的人能告诉你",149,"特殊系列装备",250},
["幽灵戒指"]={"它拥有超高的主属性,还能使佩戴者的宝宝提升攻击速度,是道士跟法师不可缺少的神装",149,"特殊系列装备",250},
["恶魔之带"]={"具有主属性加成和强大的吸蓝效果使你在战斗中具有更强的战斗力和生存能力,是强者梦寐以求的装备",149,"特殊系列装备",249},
["恶魔之靴"]={"具有主属性加成和强大的吸蓝效果使你在战斗中具有更强的战斗力和生存能力,是强者梦寐以求的装备",149,"特殊系列装备",249},
["神秘头盔"]={"来历成谜的装备,能让佩戴者快速的突破自我,更难得的是它自带经验加成属性",149,"特殊系列装备",250},
["神秘腰带"]={"来历成谜的装备,能让佩戴者快速的突破自我,更难得的是它自带经验加成属性",149,"特殊系列装备",250},
["神秘戒指"]={"拥有强大的主属性,能够大幅度提升玩家的战斗力,铸成时自带药品疗效加成",149,"特殊系列装备",250},
["炼狱戒指"]={"拥有强大的属性加成和对战增伤可提高人物的攻击和生存能力是战士法师,道士职业的必备装备之一",149},
["记忆戒指"]={"拥有强大的属性加成和对道增伤可提高人物的攻击和生存能力是战士法师,道士职业的必备装备之一",149},
["恶魔戒指"]={"拥有强大的属性加成和对法增伤可提高人物的攻击和生存能力是战士法师,道士职业的必备装备之一",149},
["炼狱手镯"]={"拥有强大的属性加成和受战减伤可提高人物的攻击和防御能力是战士法师,道士职业的必备装备之一",149},
["记忆手镯"]={"拥有强大的属性加成和受道减伤可提高人物的攻击和防御能力是战士法师,道士职业的必备装备之一",149},
["恶魔手镯"]={"拥有强大的属性加成和受法减伤可提高人物的攻击和防御能力是战士法师,道士职业的必备装备之一",149},
["黑铁项链"]={"漆黑的造型使黑铁项链具有一种天生的神秘感不自流露出傲视一切的轻蔑和固执",149},
["黑铁戒指"]={"漆黑的造型使黑铁戒指具有一种天生的神秘感不自流露出傲视一切的轻蔑和固执",149},
["黑铁手镯"]={"漆黑的造型使黑铁手镯具有一种天生的神秘感不自流露出傲视一切的轻蔑和固执",149},
["龙骨圣靴"]={"以魔龙之骨锻造而成,附有较高的防御跟魔御属性,是战斗狂人最喜爱的装备",149},
["龙骨圣带"]={"以魔龙之骨锻造而成,附有较高的防御跟魔御属性,是战斗狂人最喜爱的装备",149},
["天威ぁ龙源戒"]={"以天界神龙之鳞注雷霆之力锻造而成的套装让佩戴者在战斗中犹如一头霸气的龙,不屈不挠无人可挡",253,"特殊系列装备",249},
["天威ぁ龙源镯"]={"以天界神龙之鳞注雷霆之力锻造而成的套装让佩戴者在战斗中犹如一头霸气的龙,不屈不挠无人可挡",253,"特殊系列装备",249},
["天威ぁ龙源靴"]={"以天界神龙之鳞注雷霆之力锻造而成的套装让佩戴者在战斗中犹如一头霸气的龙,不屈不挠无人可挡",253,"特殊系列装备",249},
["天威ぁ龙源带"]={"以天界神龙之鳞注雷霆之力锻造而成的套装让佩戴者在战斗中犹如一头霸气的龙,不屈不挠无人可挡",253,"特殊系列装备",249},
["天威ぁ龙源盔"]={"以天界神龙之鳞注雷霆之力锻造而成的套装让佩戴者在战斗中犹如一头霸气的龙,不屈不挠无人可挡",253,"特殊系列装备",249},
["天威ぁ龙源链"]={"以天界神龙之鳞注雷霆之力锻造而成的套装让佩戴者在战斗中犹如一头霸气的龙,不屈不挠无人可挡",253,"特殊系列装备",249},
["天命ぁ赤霄戒"]={"取火龙洞赤霄神石打造而成的套装附于天赐之运穿戴后可调动冰霜之力逆天改命",253,"特殊系列装备",249},
["天命ぁ赤霄镯"]={"取火龙洞赤霄神石打造而成的套装附于天赐之运穿戴后可调动冰霜之力逆天改命",253,"特殊系列装备",249},
["天命ぁ赤霄靴"]={"取火龙洞赤霄神石打造而成的套装附于天赐之运穿戴后可调动冰霜之力逆天改命",253,"特殊系列装备",249},
["天命ぁ赤霄带"]={"取火龙洞赤霄神石打造而成的套装附于天赐之运穿戴后可调动冰霜之力逆天改命",253,"特殊系列装备",249},
["天命ぁ赤霄盔"]={"取火龙洞赤霄神石打造而成的套装附于天赐之运穿戴后可调动冰霜之力逆天改命",253,"特殊系列装备",249},
["天命ぁ赤霄链"]={"取火龙洞赤霄神石打造而成的套装附于天赐之运穿戴后可调动冰霜之力逆天改命",253,"特殊系列装备",249},
["天机ぁ无尘戒"]={"拥有它的人将成为战场上的绝对霸主其阵法运用自如可批阴阳断五行占后世之事",253,"特殊系列装备",249},
["天机ぁ无尘镯"]={"拥有它的人将成为战场上的绝对霸主其阵法运用自如可批阴阳断五行占后世之事",253,"特殊系列装备",249},
["天机ぁ无尘靴"]={"拥有它的人将成为战场上的绝对霸主其阵法运用自如可批阴阳断五行占后世之事",253,"特殊系列装备",249},
["天机ぁ无尘带"]={"拥有它的人将成为战场上的绝对霸主其阵法运用自如可批阴阳断五行占后世之事",253,"特殊系列装备",249},
["天机ぁ无尘盔"]={"拥有它的人将成为战场上的绝对霸主其阵法运用自如可批阴阳断五行占后世之事",253,"特殊系列装备",249},
["天机ぁ无尘链"]={"拥有它的人将成为战场上的绝对霸主其阵法运用自如可批阴阳断五行占后世之事",253,"特殊系列装备",249},
["涅槃菩提戒"]={"由绝世神匠取\"涅槃菩提珠\"锻造而成的套装蕴含重生之力穿戴者将会是搅动风云变幻的天命之子",253,"特殊系列装备",249},
["涅槃菩提镯"]={"由绝世神匠取\"涅槃菩提珠\"锻造而成的套装蕴含重生之力穿戴者将会是搅动风云变幻的天命之子",253,"特殊系列装备",249},
["涅槃菩提靴"]={"由绝世神匠取\"涅槃菩提珠\"锻造而成的套装蕴含重生之力穿戴者将会是搅动风云变幻的天命之子",253,"特殊系列装备",249},
["涅槃菩提带"]={"由绝世神匠取\"涅槃菩提珠\"锻造而成的套装蕴含重生之力穿戴者将会是搅动风云变幻的天命之子",253,"特殊系列装备",249},
["涅槃菩提盔"]={"由绝世神匠取\"涅槃菩提珠\"锻造而成的套装蕴含重生之力穿戴者将会是搅动风云变幻的天命之子",253,"特殊系列装备",249},
["涅槃菩提链"]={"由绝世神匠取\"涅槃菩提珠\"锻造而成的套装蕴含重生之力穿戴者将会是搅动风云变幻的天命之子",253,"特殊系列装备",249},
["聚魔觉醒戒"]={"传说中它是由一位神秘的魔法师所铸造蕴含着强大的聚魔之力拥有它的人会获得无与伦比的属性",253,"特殊系列装备",249},
["聚魔觉醒镯"]={"传说中它是由一位神秘的魔法师所铸造蕴含着强大的聚魔之力拥有它的人会获得无与伦比的属性",253,"特殊系列装备",249},
["聚魔觉醒靴"]={"传说中它是由一位神秘的魔法师所铸造蕴含着强大的聚魔之力拥有它的人会获得无与伦比的属性",253,"特殊系列装备",249},
["聚魔觉醒带"]={"传说中它是由一位神秘的魔法师所铸造蕴含着强大的聚魔之力拥有它的人会获得无与伦比的属性",253,"特殊系列装备",249},
["聚魔觉醒盔"]={"传说中它是由一位神秘的魔法师所铸造蕴含着强大的聚魔之力拥有它的人会获得无与伦比的属性",253,"特殊系列装备",249},
["聚魔觉醒链"]={"传说中它是由一位神秘的魔法师所铸造蕴含着强大的聚魔之力拥有它的人会获得无与伦比的属性",253,"特殊系列装备",249},

["武穆遗书"]={"相传武穆遗书是抗金名将岳飞留<br>下最为珍贵的遗物，使用<font color='#00FF00'>书页</font>可<br>提升此书等级，便可解开隐藏在<br>其中的奥秘...",149},

["金条"]={"<font color='#EEC591'>流通于玛法大陆的一种货币</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重土城NPC所需之物双<br>击使用后可获得100万金币<br><font color='#00ff00'>可在头顶按钮拍卖行交易</font>",161},
["金砖"]={"<font color='#EEC591'>用金条锻造而成的材料</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重土城NPC所需之物",161},
["金盒"]={"<font color='#EEC591'>用金砖锻造而成的材料</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重土城NPC所需之物",161},

["神兽之角"]={"<font color='#EEC591'>上古神兽遗留在大陆的兽角</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重土城NPC<font color='#00FF00'>\"伏羲\"</font>知道<br>它的用处,可找他了解下",161},
["神兽之血"]={"<font color='#EEC591'>取自上古四大神兽的血液</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重土城NPC<font color='#00FF00'>\"伏羲\"</font>知道<br>它的用处,可找他了解下",161},
["玛法结晶"]={"<font color='#EEC591'>神圣的结晶,可提升装备星级</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重土城NPC<font color='#00FF00'>\"天星师\"</font>所需<br>之物,找他了解下使用方法",161},
["一级金针"]={"<font color='#EEC591'>用黄金制作而成的金针</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重土城NPC<font color='#00FF00'>孙思藐</font>所<br>需之物,可穿刺全身经脉",161},
["二级金针"]={"<font color='#EEC591'>用黄金制作而成的金针</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重土城NPC<font color='#00FF00'>孙思藐</font>所<br>需之物,可穿刺全身经脉<br><font color='#00BFFF'>[材料出处]：</font><br>可在土城NPC<font color='#00FF00'>特殊锻造</font><br>处锻造或者打怪掉落",161},
["三级金针"]={"<font color='#EEC591'>用黄金制作而成的金针</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重土城NPC<font color='#00FF00'>孙思藐</font>所<br>需之物,可穿刺全身经脉<br><font color='#00BFFF'>[材料出处]：</font><br>可在土城NPC<font color='#00FF00'>特殊锻造</font><br>处锻造或者打怪掉落",161},
["四级金针"]={"<font color='#EEC591'>用黄金制作而成的金针</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重土城NPC<font color='#00FF00'>孙思藐</font>所<br>需之物,可穿刺全身经脉<br><font color='#00BFFF'>[材料出处]：</font><br>可在土城NPC<font color='#00FF00'>特殊锻造</font><br>处锻造或者打怪掉落",161},
["五级金针"]={"<font color='#EEC591'>用黄金制作而成的金针</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重土城NPC<font color='#00FF00'>孙思藐</font>所<br>需之物,可穿刺全身经脉<br><font color='#00BFFF'>[材料出处]：</font><br>可在土城NPC<font color='#00FF00'>特殊锻造</font><br>处锻造或者打怪掉落",161},
["六级金针"]={"<font color='#EEC591'>用黄金制作而成的金针</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重土城NPC<font color='#00FF00'>孙思藐</font>所<br>需之物,可穿刺全身经脉<br><font color='#00BFFF'>[材料出处]：</font><br>可在土城NPC<font color='#00FF00'>特殊锻造</font><br>处锻造或者打怪掉落",161},
["七级金针"]={"<font color='#EEC591'>用黄金制作而成的金针</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重土城NPC<font color='#00FF00'>孙思藐</font>所<br>需之物,可穿刺全身经脉<br><font color='#00BFFF'>[材料出处]：</font><br>可在土城NPC<font color='#00FF00'>特殊锻造</font><br>处锻造或者打怪掉落",161},
["八级金针"]={"<font color='#EEC591'>用黄金制作而成的金针</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重土城NPC<font color='#00FF00'>孙思藐</font>所<br>需之物,可穿刺全身经脉<br><font color='#00BFFF'>[材料出处]：</font><br>可在土城NPC<font color='#00FF00'>特殊锻造</font><br>处锻造或者打怪掉落",161},
["九级金针"]={"<font color='#EEC591'>用黄金制作而成的金针</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重土城NPC<font color='#00FF00'>孙思藐</font>所<br>需之物,可穿刺全身经脉<br><font color='#00BFFF'>[材料出处]：</font><br>可在土城NPC<font color='#00FF00'>特殊锻造</font><br>处锻造或者打怪掉落",161},
["十级金针"]={"<font color='#EEC591'>用黄金制作而成的金针</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重土城NPC<font color='#00FF00'>孙思藐</font>所<br>需之物,可穿刺全身经脉<br><font color='#00BFFF'>[材料出处]：</font><br>可在土城NPC<font color='#00FF00'>特殊锻造</font><br>处锻造或者打怪掉落",161},
["疏筋活络丸"]={"<font color='#EEC591'>它记载于上古奇书皇<br>帝内经中的神奇药丸<br></font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重土城NPC<font color='#00FF00'>\"孙思藐\"</font>所需<br>之物,可打破脉搏枷锁的药丸",161},
["铜矿石"]={"<font color='#EEC591'>产自紫金矿洞的铜矿石</font><br><font color='#00BFFF'>[材料用途]：</font><br>凑齐50个铜矿可提交给盟重<br>土城NPC<font color='#00FF00'>矿洞守卫</font>可获得大<br>量奖励",161},
["鹤嘴锄"]={"<font color='#EEC591'>玛法大陆上矿工的必备之物</font><br><font color='#00BFFF'>[材料用途]：</font><br>可在<font color='#00FF00'>\"守矿老人\"</font>处获得挖矿<br>时的必备物品",161},
["书页"]={"<font color='#EEC591'>来自各大地图怪物掉落的物品</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重省NPC<font color='#00FF00'>名将岳飞</font>所需之物<br>可以对武穆遗书增加经验值哦",161},
["承包凭证"]={"<font color='#EEC591'>六大经典教主大量掉落之物</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重省NPC<font color='#00FF00'>七星塔</font>所需之物<br>提交后,有机会成为幸运玩家<br>可获得官方赠送的大量福利",161},
["紫水晶矿"]={"<font color='#EEC591'>漫长时间演化而来的矿石</font><br><font color='#00BFFF'>[材料用途]：</font><br>进各大地图所需之物打怪<br>大量掉落通过<font color='#00FF00'>回收装备</font>也<br>可获得",161},
["永恒之泪"]={"<font color='#EEC591'>产自上古雷泽的圣物</font><br><font color='#00BFFF'>[材料用途]：</font><br>玛法大陆NPC所需之<br>物通过分解装备获得<br><font color='#00ff00'>可在头顶按钮拍卖行交易</font>",161},
["庄主令牌"]={"<font color='#EEC591'>卧龙山庄<font color='#00FF00'>\"庄主\"</font>的令牌</font><br><font color='#00BFFF'>[材料用途]：</font><br>把它交给卧龙山庄地图<br>里的山庄护卫可获得解<br>救卧龙夫人的重任",161},
["一星龙珠"]={"<font color='#EEC591'>上古神龙遗落在玛法大陆的珠子</font><br><font color='#00BFFF'>[材料用途]：</font><br>召唤<font color='#00FF00'>许愿神龙</font>的必备材料可在<br>盟重省NPC<font color='#FF1493'>龙族传说</font>了解它的<br>用途玛法大陆的珍稀材料之一",161},
["二星龙珠"]={"<font color='#EEC591'>上古神龙遗落在玛法大陆的珠子</font><br><font color='#00BFFF'>[材料用途]：</font><br>召唤<font color='#00FF00'>许愿神龙</font>的必备材料可在<br>盟重省NPC<font color='#FF1493'>龙族传说</font>了解它的<br>用途玛法大陆的珍稀材料之一",161},
["三星龙珠"]={"<font color='#EEC591'>上古神龙遗落在玛法大陆的珠子</font><br><font color='#00BFFF'>[材料用途]：</font><br>召唤<font color='#00FF00'>许愿神龙</font>的必备材料可在<br>盟重省NPC<font color='#FF1493'>龙族传说</font>了解它的<br>用途玛法大陆的珍稀材料之一",161},
["四星龙珠"]={"<font color='#EEC591'>上古神龙遗落在玛法大陆的珠子</font><br><font color='#00BFFF'>[材料用途]：</font><br>召唤<font color='#00FF00'>许愿神龙</font>的必备材料可在<br>盟重省NPC<font color='#FF1493'>龙族传说</font>了解它的<br>用途玛法大陆的珍稀材料之一",161},
["五星龙珠"]={"<font color='#EEC591'>上古神龙遗落在玛法大陆的珠子</font><br><font color='#00BFFF'>[材料用途]：</font><br>召唤<font color='#00FF00'>许愿神龙</font>的必备材料可在<br>盟重省NPC<font color='#FF1493'>龙族传说</font>了解它的<br>用途玛法大陆的珍稀材料之一",161},
["六星龙珠"]={"<font color='#EEC591'>上古神龙遗落在玛法大陆的珠子</font><br><font color='#00BFFF'>[材料用途]：</font><br>召唤<font color='#00FF00'>许愿神龙</font>的必备材料可在<br>盟重省NPC<font color='#FF1493'>龙族传说</font>了解它的<br>用途玛法大陆的珍稀材料之一",161},
["七星龙珠"]={"<font color='#EEC591'>上古神龙遗落在玛法大陆的珠子</font><br><font color='#00BFFF'>[材料用途]：</font><br>召唤<font color='#00FF00'>许愿神龙</font>的必备材料可在<br>盟重省NPC<font color='#FF1493'>龙族传说</font>了解它的<br>用途玛法大陆的珍稀材料之一",161},
["黑铁矿石"]={"<font color='#EEC591'>产自玛法大陆的稀有矿石</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重省的NPC<font color='#00FF00'>云游铁匠</font>可运用此<br>矿石,可为冒险者的<font color='#FF1493'>武器</font>提升属性",161},
["神秘水晶"]={"<font color='#EEC591'>神秘代表着它的不同凡响</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重省的NPC<font color='#00FF00'>逍遥子</font>对它的作<br>用了如指掌,你可以去找他试试",161},
["鸿运之锤"]={"<font color='#EEC591'>用天外陨铁打造而成的锤子</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重土城NPC<font color='#00FF00'>珍禽异兽</font>对它有所钻研去找他了解下用途",161},

["兽魂蛋"]={"<font color='#EEC591'>产自玛法大陆各族怪物</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重土城NPC<font color='#00FF00'>珍禽异兽</font>对它<br>有钻研你可以去找他了解下<br>此蛋的用途",161},
["开天斩"]={"<font color='#EEC591'>战士职业的高级技能书</font><br><font color='#00BFFF'>[技能书介绍]：</font><br>人物等级达到50级可双击<br>使用,52级自动激活2级技<br>能威力,55级自动激活3级<br>技能威力",161},
["灭天火"]={"<font color='#EEC591'>法师职业的高级技能书</font><br><font color='#00BFFF'>[技能书介绍]：</font><br>人物等级达到50级可双击<br>使用,52级自动激活2级技<br>能威力,55级自动激活3级<br>技能威力",161},
["噬血术"]={"<font color='#EEC591'>道士职业的高级技能书</font><br><font color='#00BFFF'>[材料用途]：</font><br>人物等级达到50级可双击<br>使用,52级自动激活2级技<br>能威力,55级自动激活3级<br>技能威力",161},

["火把"]={"<font color='#EEC591'>能照亮你心中梦想的火把</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重省NPC<font color='#00FF00'>未知暗殿</font>处使用<br>可助你在未知暗殿畅通无阻",161},
["黄色药剂"]={"<font color='#EEC591'>毒蜘蛛炼制而成的药粉</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重省的<font color='#00FF00'>屠夫</font>对它有较<br>深的研究你可找他了解",161},
["鹤顶红"]={"<font color='#EEC591'>盟重省屠夫炼制的毒药</font><br><font color='#00BFFF'>[材料用途]：</font><br>双击使用后,输入人物名<br>字可使目标<font color='#00FF00'>\"今日攻魔道<br>上限降低12点\"</font>",161},
["红色药剂"]={"<font color='#EEC591'>沙漠毒蝎炼制而成的药剂</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重省的<font color='#00FF00'>屠夫</font>对它有较<br>深的研究你可找他了解",161},
["断肠草"]={"<font color='#EEC591'>盟重省屠夫炼制的毒药</font><br><font color='#00BFFF'>[材料用途]：</font><br>双击使用后,输入人物名<br>字可使目标<font color='#00FF00'>\"今日双防降<br>低上限15点\"</font>",161},
["声望卷"]={"<font color='#EEC591'>通过击杀各大地图怪物获得</font><br><font color='#00BFFF'>[材料用途]：</font><br>双击后可获得声望点可在<br>盟重省NPC<font color='#00FF00'>斗勋锻造</font>处了<br>解它的用途",161},
["50点声望卷"]={"<font color='#EEC591'>通过击杀各大地图怪物获得</font><br><font color='#00BFFF'>[材料用途]：</font><br>双击后可获得声望点可在<br>盟重省NPC<font color='#00FF00'>斗勋锻造</font>处了<br>解它的用途",161},
["100点声望卷"]={"<font color='#EEC591'>通过击杀各大地图怪物获得</font><br><font color='#00BFFF'>[材料用途]：</font><br>双击后可获得声望点可在<br>盟重省NPC<font color='#00FF00'>斗勋锻造</font>处了<br>解它的用途",161},
["250点声望卷"]={"<font color='#EEC591'>通过击杀各大地图怪物获得</font><br><font color='#00BFFF'>[材料用途]：</font><br>双击后可获得声望点可在<br>盟重省NPC<font color='#00FF00'>斗勋锻造</font>处了<br>解它的用途",161},
["500点声望卷"]={"<font color='#EEC591'>通过击杀各大地图怪物获得</font><br><font color='#00BFFF'>[材料用途]：</font><br>双击后可获得声望点可在<br>盟重省NPC<font color='#00FF00'>斗勋锻造</font>处了<br>解它的用途",161},
["1000点声望卷"]={"<font color='#EEC591'>通过击杀各大地图怪物获得</font><br><font color='#00BFFF'>[材料用途]：</font><br>双击后可获得声望点可在<br>盟重省NPC<font color='#00FF00'>斗勋锻造</font>处了<br>解它的用途",161},
["药品捆绳"]={"<font color='#EEC591'>产自赤月峡谷的捆绳</font><br><font color='#00BFFF'>[材料用途]：</font><br>双击使用后可对<font color='#00FF00'>万年雪<br>霜</font>以及<font color='#00FF00'>疗伤药</font>进行打捆",161},
["经验宝典"]={"<font color='#EEC591'>可在土城药店老板处获得</font><br><font color='#00BFFF'>[材料用途]：</font><br>双击使用后可获得<font color='#00FF00'>1.5倍</font>打<br>怪经验,持续时间60分钟<br>时间可以累计叠加 死亡小<br>退不消失",161},
["双倍经验卷"]={"<font color='#EEC591'>它是玛法勇士最喜爱的宝典</font><br><font color='#00BFFF'>[材料用途]：</font><br>双击使用后可获得<font color='#00FF00'>2倍</font>打<br>怪经验，持续时间60分钟",161},
["九穗禾"]={"<font color='#EEC591'>生长在蛮荒遗迹的禾苗</font><br><font color='#00BFFF'>[材料用途]：</font><br>可交于盟重省酒馆的<font color='#00FF00'>\"酒<br>剑仙\"</font>是获得剑仙传承的<br>必备材料",161},
["怀梦草"]={"<font color='#EEC591'>生长在蛮荒禁地的仙草</font><br><font color='#00BFFF'>[材料用途]：</font><br>可交于盟重省酒馆的<font color='#00FF00'>\"酒<br>剑仙\"</font>是获得剑仙传承的<br>必备材料",161},
["紫罗兰"]={"<font color='#EEC591'>生长在龙之神域二层的仙花</font><br><font color='#00BFFF'>[材料用途]：</font><br>可交于盟重省酒馆的<font color='#00FF00'>\"酒<br>剑仙\"</font>是获得剑仙传承的<br>必备材料",161},
["幽冥花"]={"<font color='#EEC591'>生长在铁血魔窟的奇异花朵</font><br><font color='#00BFFF'>[材料用途]：</font><br>可交于盟重省酒馆的<font color='#00FF00'>\"酒<br>剑仙\"</font>是获得剑仙传承的<br>必备材料",161},
["不死草"]={"<font color='#EEC591'>生长在堕落深渊二层的仙草</font><br><font color='#00BFFF'>[材料用途]：</font><br>可交于盟重省酒馆的<font color='#00FF00'>\"酒<br>剑仙\"</font>是获得剑仙传承的<br>必备材料",161},
["人参果树"]={"<font color='#EEC591'>生长在桃花谷一层的仙家果树</font><br><font color='#00BFFF'>[材料用途]：</font><br>可交于盟重省酒馆的<font color='#00FF00'>\"酒<br>剑仙\"</font>是获得剑仙传承的<br>必备材料",161},
["护心莲"]={"<font color='#EEC591'>生长于桃花谷底天池的仙莲</font><br><font color='#00BFFF'>[材料用途]：</font><br>可交于盟重省酒馆的<font color='#00FF00'>\"酒<br>剑仙\"</font>是获得剑仙传承的<br>必备材料",161},

["酒剑仙的推荐信"]={"<font color='#EEC591'>蜀山剑派酒剑仙的推荐信</font><br><font color='#00BFFF'>[材料用途]：</font><br>可交于<font color='#00FF00'>酒馆一楼</font>的店小二<br>他可帮你引见酒馆老板娘",161},
["玫瑰花"]={"<font color='#EEC591'>艳丽的玫瑰花朵</font><br><font color='#00BFFF'>[材料用途]：</font><br>交于<font color='#00FF00'>酒馆一楼</font>的老板<br>娘有机会领悟酿酒术",161},
["泉水"]={"<font color='#EEC591'>采集于高级地图泉眼的山泉水</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重<font color='#00FF00'>酒馆一楼的品酒师</font>对它<br>比较感兴趣是炼制<font color='#FF1493'>\"酒\"</font>的必<br>备材料<font color='#00FF00'>具有高保值性</font>前期切<br>记不可贱卖",161},
["高粱"]={"<font color='#EEC591'>产自玛法大陆农田的农作物</font><br><font color='#00BFFF'>[材料用途]：</font><br>可到盟重<font color='#00FF00'>酒馆一楼的品酒师</font><br>师炼制<font color='#FF1493'>\"高梁酒\"</font>后期酿酒必<br>备材料<font color='#00FF00'>具有高保值</font>前期切记<br>不可贱卖",161},
["虎骨"]={"<font color='#EEC591'>产自玛法大陆农田的农作物</font><br><font color='#00BFFF'>[材料用途]：</font><br>可到盟重<font color='#00FF00'>酒馆一楼的品酒师</font><br>师炼制<font color='#FF1493'>\"虎骨酒\"</font>后期酿酒必<br>备材料<font color='#00FF00'>具有高保值</font>前期切记<br>不可贱卖",161},
["高粱酒"]={"<font color='#EEC591'>用泉水配上高粱酿制而成的酒</font><br><font color='#00BFFF'>[材料用途]：</font><br>双击使用后可增加仙剑酒葫芦<br><font color='#00FF00'>10%</font>的酒气值",161},
["虎骨酒"]={"<font color='#EEC591'>用泉水配上虎骨酿制而成的酒</font><br><font color='#00BFFF'>[材料用途]：</font><br>双击使用后可增加仙剑酒葫芦<br><font color='#00FF00'>25%</font>的酒气值",161},
["金矿石"]={"<font color='#EEC591'>产自上古矿洞的神奇金石</font><br><font color='#00BFFF'>[获取途径]：</font><br>挖矿过程中有概率获得,打<br>怪大量掉落,商铺也可购买<br><font color='#00BFFF'>[材料用途]：</font><br>可在盟重省NPC<font color='#00FF00'>\"仓库保管<br>员\"</font>了解它的用途",161},
["金锭"]={"<font color='#EEC591'>对金矿石千锤百炼得到的产物</font><br><font color='#00BFFF'>[材料用途]：</font><br>可在盟重省NPC<font color='#00FF00'>\"仓库保管员\"<br></font>了解它的用途",161},
["金箔"]={"<font color='#EEC591'>由黄金锤炼而成的金色薄片</font><br><font color='#00BFFF'>[材料用途]：</font><br>可在盟重省NPC<font color='#00FF00'>\"仓库保管员\"<br></font>了解它的用途",161},

["1万经验卷"]={"<font color='#EEC591'>可提升人物等级经验的卷轴</font><br><font color='#00BFFF'>[材料用途]：</font><br>双击使用后可获得<font color='#FF1493'>1万</font>经验值",161},
["12万经验卷"]={"<font color='#EEC591'>可提升人物等级经验的卷轴</font><br><font color='#00BFFF'>[材料用途]：</font><br>双击使用后可获得<font color='#FF1493'>12万</font>经验值<br><font color='#00ff00'>可在头顶按钮拍卖行交易</font>",161},
["50万经验卷"]={"<font color='#EEC591'>可提升人物等级经验的卷轴</font><br><font color='#00BFFF'>[材料用途]：</font><br>双击使用后可获得<font color='#FF1493'>50万</font>经验值<br><font color='#00ff00'>可在头顶按钮拍卖行交易</font>",161},
["沃玛密函"]={"<font color='#00FF00'>沃玛寺庙地图爆出的密函</font><br><font color='#00BFFF'>[材料用途]：</font><br>寻得它,就等于寻到了沃玛族<br>的宝藏,可以交给<font color='#00FF00'>沃玛大殿</font>的<br>信使",161},
["祖玛头像"]={"<font color='#00FF00'>祖玛寺庙地图爆出的头像</font><br><font color='#00BFFF'>[材料用途]：</font><br>守在<font color='#00FF00'>\"祖玛之家\"</font>的祖玛族<br>长老正在等候有缘人帮他<br>寻得本族圣物\"祖玛头像\"",161},

["通关文牒"]={"<font color='#EEC591'>古代通过关戍时的凭证</font><br><font color='#00BFFF'>[材料用途]：</font><br>勇士拿着它去寻找镇守<br>在<font color='#00FF00'>通天之路</font>的守陵武将<br>他可以让你面见秦始皇",161},
["孟婆汤"]={"<font color='#00FF00'>骨魔洞地图爆出的孟婆汤</font><br><font color='#00BFFF'>[材料用途]：</font><br>听说守在<font color='#00FF00'>\"骨魔洞五层\"</font>的<br>孟婆正在苦苦寻找此此汤<br>你可以交给她试试",161},
["牛魔王的推荐信"]={"<font color='#00FF00'>牛魔洞地图爆出的推荐信</font><br><font color='#00BFFF'>[材料用途]：</font><br>你可以交给守望在牛魔寺庙<br>大厅的<font color='#00FF00'>\"铁扇公主\"</font>她能帮你<br>传送至牛魔族的宝库",161},
["九珠连环炮"]={"<font color='#EEC591'>能释放出绚丽多彩的烟花</font><br><font color='#00BFFF'>[材料用途]：</font><br>在<font color='#00FF00'>\"赤月魔穴\"</font>双击后有极<br>大概率传送至烟花迷宫进<br>入到烟花神殿",161},
["魔教信物"]={"<font color='#EEC591'>魔族战败后遗留下的信物</font><br><font color='#00BFFF'>[材料用途]：</font><br>可在魔龙城任何地方双击<br>使用,能召唤出<font color='#00FF00'>\"邪魔统帅\"</font>",161},
["魔龙之血"]={"<font color='#EEC591'>由上古龙脉孕育而成的魔之血</font><br><font color='#00BFFF'>[材料用途]：</font><br>可到比奇城的<font color='#00FF00'>\"比奇皇宫\"</font>找到<br>珍宝馆了解它的用处<font color='#FF1493'>玛法最稀<br>有材料</font>之一",161},
["祝福油"]={"<font color='#EEC591'>这个就不用做过多的介绍了</font><br><font color='#00BFFF'>[材料用途]：</font><br>双击使用后,可以给武器提升幸运<br>的物品,其他妙用你得去<font color='#00FF00'>白日门</font>找<br>NPC呼延剑客他会告诉你",161},
["超级祝福油"]={"<font color='#EEC591'>能给人物带来超级幸运的油</font><br><font color='#00BFFF'>[材料用途]：</font><br>白日门的NPC<font color='#00FF00'>\"呼延剑客\"</font>对<br>它了如指掌,你可以找他试试",161},
["技能神石"]={"<font color='#EEC591'>色如灵石微深红,纹似金星细入肌</font><br><font color='#00BFFF'>[材料用途]：</font><br>封魔谷的<font color='#00FF00'>\"淬炼大师\"</font>了解它的用途",161},
["主宰凭证"]={"<font color='#EEC591'>天界之主留在玛法大陆的凭证</font><br><font color='#00BFFF'>[材料用途]：</font><br>可到<font color='#00FF00'>封魔谷的</font>\"封魔堡\"找到封<br>魔谷主了解它的用处<font color='#FF1493'>玛法最稀<br>有材料</font>之一",161},
["求婚戒指"]={"<font color='#EEC591'>慢慢传奇路,悠悠玛法情</font><br><font color='#00BFFF'>[材料用途]：</font><br>可带上心爱之人,到<font color='#00FF00'>婚缘神殿</font><br>找到红娘帮你完成结婚仪式",161},
["沃玛号角"]={"<font color='#EEC591'>沃玛寺庙教主头顶的巨角</font><br><font color='#00BFFF'>[材料用途]：</font><br>创建行会的必备之物",161},
["蚕丝"]={"<font color='#EEC591'>产自蜈蚣洞巨型蠕虫的丝绒<br>游戏中大量爆出</font><br><font color='#00BFFF'>[材料用途]：</font><br>土城左上角仓库保管员处使用",161},
["金蚕丝"]={"<font color='#EEC591'>产自沃玛神庙盘丝大仙的丝绒<br>游戏中大量爆出</font><br><font color='#00BFFF'>[材料用途]：</font><br>土城左上角仓库保管员处使用",161},
["赏金值"]={"<font color='#EEC591'>通过击杀各大地图怪物获得</font><br><font color='#00BFFF'>[材料用途]：</font><br>盟重土城NPC<font color='#00FF00'>\"赏金猎人\"</font>正<br>在收集它，你可以去找他打<br>听下用途",161},
["修复神水"]={"<font color='#EEC591'>取自天池的神奇灵水</font><br><font color='#00BFFF'>[材料用途]：</font><br>双击后可修复装备的持久",161},
["穿云箭"]={"<font color='#EEC591'>一只穿云箭,千军万马来相见<br>拥有了它,你不在是孤胆英雄</font><br><font color='#00BFFF'>[材料用途]：</font><br>可在地图,<font color='#00FF00'>死亡棺材,沃玛二层<br>石墓六层,封魔殿堂,牛魔六层<br>骨魔洞五层,祖玛七层三,魔龙<br>谷</font>使用。<br>可将行会成员召集至你身边",161},
["001号图纸"]={"<font color='#EEC591'>远古时期,天界战神遗留在世间的神兵图纸,也许在<font color='#FF1493'>封魔谷</font>的干将莫邪能帮你解开他的秘密...</font><br>",161},
["002号图纸"]={"<font color='#EEC591'>远古时期,天界战神遗留在世间的神兵图纸,也许在<font color='#FF1493'>封魔谷</font>的干将莫邪能帮你解开他的秘密...</font><br>",161},
["003号图纸"]={"<font color='#EEC591'>远古时期,天界战神遗留在世间的神兵图纸,也许在<font color='#FF1493'>封魔谷</font>的干将莫邪能帮你解开他的秘密...</font><br>",161},
["004号图纸"]={"<font color='#EEC591'>远古时期,天界战神遗留在世间的神兵图纸,也许在<font color='#FF1493'>封魔谷</font>的干将莫邪能帮你解开他的秘密...</font><br>",161},
["005号图纸"]={"<font color='#EEC591'>远古时期,天界战神遗留在世间的神兵图纸,也许在<font color='#FF1493'>封魔谷</font>的干将莫邪能帮你解开他的秘密...</font><br>",161},
["006号图纸"]={"<font color='#EEC591'>远古时期,天界战神遗留在世间的神兵图纸,也许在<font color='#FF1493'>封魔谷</font>的干将莫邪能帮你解开他的秘密...</font><br>",161},
["007号图纸"]={"<font color='#EEC591'>远古时期,天界战神遗留在世间的神兵图纸,也许在<font color='#FF1493'>封魔谷</font>的干将莫邪能帮你解开他的秘密...</font><br>",161},
["008号图纸"]={"<font color='#EEC591'>远古时期,天界战神遗留在世间的神兵图纸,也许在<font color='#FF1493'>封魔谷</font>的干将莫邪能帮你解开他的秘密...</font><br>",161},
["009号图纸"]={"<font color='#EEC591'>远古时期,天界战神遗留在世间的神兵图纸,也许在<font color='#FF1493'>封魔谷</font>的干将莫邪能帮你解开他的秘密...</font><br>",161},
["010号图纸"]={"<font color='#EEC591'>远古时期,天界战神遗留在世间的神兵图纸,也许在<font color='#FF1493'>封魔谷</font>的干将莫邪能帮你解开他的秘密...</font><br>",161},
["011号图纸"]={"<font color='#EEC591'>远古时期,天界战神遗留在世间的神兵图纸,也许在<font color='#FF1493'>封魔谷</font>的干将莫邪能帮你解开他的秘密...</font><br>",161},
["012号图纸"]={"<font color='#EEC591'>远古时期,天界战神遗留在世间的神兵图纸,也许在<font color='#FF1493'>封魔谷</font>的干将莫邪能帮你解开他的秘密...</font><br>",161},
["聚合之心"]={"<font color='#00BFFF'>[材料用途]：</font><br>盟重省的NPC<font color='#00FF00'>\"赏金猎人\"</font><br>知道它的用途",161},
["红名清洗卷"]={"<font color='#EEC591'>可清除pk值200点</font>",161},
["庆典蛋糕"]={"<font color='#EEC591'>无任何作用 仅供欣赏</font>",161},
}

local shouhun_ttt = {
["稻草人"]=1,["多钩猫"]=1,["红蛇"]=1,["食人花"]=1,["毒蜘蛛"]=1,["森林雪人"]=1,["巨型多角虫"]=1,["半兽统领"]=1,["沃玛勇士"]=1,["沃玛护卫"]=1,["火焰沃玛"]=1,["沃玛战将"]=1,
["祖玛弓箭手"]=1,["祖玛雕像"]=1,["祖玛卫士"]=1,["祖玛教主"]=1,["红野猪"]=1,["邪恶毒蛇"]=1,["白野猪"]=1,["触龙神"]=1,["虹魔蝎卫"]=1,["虹魔猪卫"]=1,["千年树妖"]=1,["虹魔教主"]=1,
["骷髅长枪兵"]=1,["骷髅锤兵"]=1,["骷髅刀斧手"]=1,["牛魔战士"]=1,["牛魔法师"]=1,["牛魔祭司"]=1,["牛魔将军"]=1,["牛魔王"]=1,["钢牙蜘蛛"]=1,["天狼蜘蛛"]=1,["黑锷蜘蛛"]=1,["花吻蜘蛛"]=1,
["血影巨人"]=1,["双头金刚"]=1,["双头血魔"]=1,["赤月恶魔"]=1,["魔龙邪眼"]=1,["魔龙血蛙"]=1,["魔龙射手"]=1,["魔龙刀兵"]=1,["魔龙战将"]=1,["魔龙力士"]=1,["魔龙巨蛾"]=1,["魔龙教主"]=1,
}

ItemTips.fabao_bh = {
	"断玉钩","混元凤凰珠","雷公锤","琉璃佩","妖魄之瞳","镇魂钟","崆峒印","炼妖壶",
	"玉净瓶","闪电五连鞭","番天印","震天箭","日照香炉","玄武盾","东皇钟","昆仑镜",
	"乾坤鼎","蜈蜂袋","五云离合圭","上古龙珠","混元金斗","补天石","孔雀翎","神农鼎","避水珠","蓝灵珠","日月珠","金光锉",
	"伏龙鼎","紫金葫","太极符印","九炎枪","绿玉环","昊天塔","金木鱼","降魔杵",
	"天机镜","玉虚杏黄旗","混天绫","玉如意","六魂幡","紫符天录","生死簿","魔灵印","九天息壤","夔牛鼓","无量尺","南明离火",
}

ItemTips.fabao_t = {
	["断玉钩"]="麻痹几率+2%<br>低于目标四级无法麻痹只对人麻痹",
	["混元凤凰珠"]="体力元素+10%",
	["雷公锤"]="暴击几率+6%",
	["琉璃佩"]="攻击吸血+6%",
	["妖魄之瞳"]="攻击速度+3<br>施法速度+3",
	["镇魂钟"]="20%几率忽视目标双防",
	["崆峒印"]="PK减伤+10%",
	["炼妖壶"]="对怪暴击+12%",

	["玉净瓶"]="药品疗效+20%",
	["闪电五连鞭"]="固定伤害+25",
	["番天印"]="暴击几率抵抗+6%",
	["震天箭"]="PK增伤+5%",
	["日照香炉"]="HP：+60<br>MP：+50<br>打怪爆率+10% ",
	["玄武盾"]="人物双防+20%",
	["东皇钟"]="暴击伤害减免30%",
	["昆仑镜"]="攻击：5-13<br>魔法：5-13<br>道术：5-13",

	["乾坤鼎"]="攻击：1-4<br>魔法：1-4<br>道术：1-4<br>吸血抵抗+5%",
	["蜈蜂袋"]="防御：2-4<br>魔域：2-4<br>暴击几率抵抗+3%",
	["五云离合圭"]="攻击：3-5<br>魔法：3-5<br>道术：3-5<br>暴击伤害减免+10%",
	["上古龙珠"]="攻击：0-6<br>魔法：0-6<br>道术：0-6<br>每秒额外恢复5点HP",
	["混元金斗"]="攻击：1-6<br>魔法：1-6<br>道术：1-6<br>破防抵抗+5%",
	["补天石"]="攻击：1-4<br>魔法：1-4<br>道术：1-4<br>忽视目标双防+5%",
	["孔雀翎"]="攻击：2-7<br>魔法：2-7<br>道术：2-7<br>增加目标爆率+5%",
	["神农鼎"]="防御：5-5<br>魔御：5-5<br>PK减伤+3%",
	["避水珠"]="攻击：3-8<br>魔法：3-8<br>道术：3-8<br>受道减伤3%",
	["蓝灵珠"]="攻击：3-8<br>魔法：3-8<br>道术：3-8<br>受战减伤3%",
	["日月珠"]="攻击：3-8<br>魔法：3-8<br>道术：3-8<br>受法减伤3%",
	["金光锉"]="攻击：2-6<br>魔法：2-6<br>道术：2-6<br>PK增伤+2%",

	["伏龙鼎"]="攻击：1-3<br>魔法：1-3<br>道术：1-3<br>忽视双防:5-5",
	["紫金葫"]="攻击：1-3<br>魔法：1-3<br>道术：1-3<br>吸血+2%",
	["太极符印"]="攻击：1-3<br>魔法：1-3<br>道术：1-3<br>药品疗效+5%",
	["九炎枪"]="准确+3<br>敏捷+3<br>暴击几率+2%",
	["绿玉环"]="攻击：1-4<br>魔法：1-4<br>道术：1-4<br>HP：+30",
	["昊天塔"]="防御：+8%<br>魔御：+8%",

	["金木鱼"]="防御：0-2<br>魔御：0-2",
	["降魔杵"]="攻击：1-1<br>魔法：1-1<br>道术：1-1",
	["天机镜"]="防御：1-2<br>魔御：1-2<br>准确：+1",
	["玉虚杏黄旗"]="防御：1-2<br>魔御：1-2<br>敏捷：+1",
	["混天绫"]="攻击：0-1<br>魔法：0-1<br>道术：0-1<br>HP：+5%",
	["玉如意"]="攻击：1-2<br>魔法：1-2<br>道术：1-2<br>爆率+1%",
	["六魂幡"]="攻击：1-1<br>魔法：1-1<br>道术：1-1<br>攻魔道伤+1%",
	["紫符天录"]="防御：3-3<br>魔御：3-3<br>打怪爆率+2%",
	["生死簿"]="攻击：1-1<br>魔法：1-1<br>道士：1-1<br>对怪增伤+3%",
	["魔灵印"]="攻击：1-2<br>魔法：1-2<br>道术：1-2<br>暴击几率+1%",
	["九天息壤"]="攻击：1-4<br>魔法：1-4<br>道术：1-4<br>受怪减伤+5%",
	["夔牛鼓"]="HP：+30<br>MP：+30<br>打怪爆率+5%",
	["无量尺"]="攻击：1-2<br>魔法：1-2<br>道术：1-2<br>魔法躲避+10%",
	["南明离火"]="防御：2-4<br>魔御：2-4<br>固定伤害+5",

}

ItemTips.teshu_t = {
	["天威ぁ龙源戒"]="魔御：0-2<br><font color='#FFB90F'>锻造成功后随机获得攻击力上限</font><br>",
	["天威ぁ龙源镯"]="防御：0-2<br><font color='#FFB90F'>锻造成功后随机获得攻击力上限</font><br>",
	["天威ぁ龙源靴"]="防御：4-8<br><font color='#FFB90F'>锻造成功后随机获得攻击力上限</font><br>",
	["天威ぁ龙源带"]="魔御：5-7<br><font color='#FFB90F'>锻造成功后随机获得攻击力上限</font><br>",
	["天威ぁ龙源盔"]="防御：6-10<br>魔御：6-10<br><font color='#FFB90F'>锻造成功后随机获得攻击力上限</font><br>",
	["天威ぁ龙源链"]="<font color='#FFB90F'>锻造成功后随机获得攻击力上限</font><br>",
	
	["天命ぁ赤霄戒"]="魔御：0-2<br><font color='#FFB90F'>锻造成功后随机获得魔法上限</font><br>",
	["天命ぁ赤霄镯"]="防御：0-2<br><font color='#FFB90F'>锻造成功后随机获得魔法上限</font><br>",
	["天命ぁ赤霄靴"]="防御：4-8<br><font color='#FFB90F'>锻造成功后随机获得魔法上限</font><br>",
	["天命ぁ赤霄带"]="魔御：5-7<br><font color='#FFB90F'>锻造成功后随机获得魔法上限</font><br>",
	["天命ぁ赤霄盔"]="防御：6-10<br>魔御：6-10<br><font color='#FFB90F'>锻造成功后随机获得魔法上限</font><br>",
	["天命ぁ赤霄链"]="<font color='#FFB90F'>锻造成功后随机获得魔法上限</font><br>",
	
	["天机ぁ无尘戒"]="魔御：0-2<br><font color='#FFB90F'>锻造成功后随机获得道术力上限</font><br>",
	["天机ぁ无尘镯"]="防御：0-2<br><font color='#FFB90F'>锻造成功后随机获得道术力上限</font><br>",
	["天机ぁ无尘靴"]="防御：4-8<br><font color='#FFB90F'>锻造成功后随机获得道术力上限</font><br>",
	["天机ぁ无尘带"]="魔御：5-7<br><font color='#FFB90F'>锻造成功后随机获得道术力上限</font><br>",
	["天机ぁ无尘盔"]="防御：6-10<br>魔御：6-10<br><font color='#FFB90F'>锻造成功后随机获得道术力上限</font><br>",
	["天机ぁ无尘链"]="<font color='#FFB90F'>锻造成功后随机获得道术力上限</font><br>",
	
	["涅槃菩提戒"]="魔御：0-2<br><font color='#FFB90F'>随机获得攻魔道上限值</font><br>",
	["涅槃菩提镯"]="防御：0-2<br><font color='#FFB90F'>随机获得攻魔道上限值</font><br>",
	["涅槃菩提靴"]="防御：4-8<br><font color='#FFB90F'>随机获得攻魔道上限值</font><br>",
	["涅槃菩提带"]="魔御：5-7<br><font color='#FFB90F'>随机获得攻魔道上限值</font><br>",
	["涅槃菩提盔"]="防御：6-10<br>魔御：6-10<br><font color='#FFB90F'>随机获得攻魔道上限值</font><br>",
	["涅槃菩提链"]="<font color='#FFB90F'>随机获得攻魔道上限值</font><br>",
	["聚魔觉醒戒"]="魔御：0-2<br><font color='#FFB90F'>随机获得魔法道术上限值</font><br>",
	["聚魔觉醒镯"]="防御：0-2<br><font color='#FFB90F'>随机获得魔法道术上限值</font><br>",
	["聚魔觉醒靴"]="防御：4-8<br><font color='#FFB90F'>随机获得魔法道术上限值</font><br>",
	["聚魔觉醒带"]="魔御：5-7<br><font color='#FFB90F'>随机获得魔法道术上限值</font><br>",
	["聚魔觉醒盔"]="防御：6-10<br>魔御：6-10<br><font color='#FFB90F'>随机获得魔法道术上限值</font><br>",
	["聚魔觉醒链"]="<font color='#FFB90F'>随机获得魔法道术上限值</font><br>",
}
function getjipin(itemData,id) --获取极品属性
	local t = itemData.Values
	if t == nil then return 0 end
	for i = 1,#t do
		if t[i].Id == id and t[i].Value ~= 0 then
			return t[i].Value
		end
	end
	return 0
end

function getteshu(itemData,id)
	if itemData.ExAbil and next(itemData.ExAbil) then
		local t = itemData.ExAbil.abil[5].v
		for i = 1,#t do
			if t[i][2] == id then
				return t[i][3]
			end
		end
	end
	return 0
end

function getcuilian(itemData) --获取淬炼值
	if itemData.ExAbil and next(itemData.ExAbil) then
		local t = itemData.ExAbil.abil[6].v
		for i = 1,#t do
			if t[i][2] == 209 then
				return t[i][3]
			end
		end
	end
	return 0
end

local function ParseBaseAtt(att, job)
    local attList = {}
    if not att or att == "" or att == "0" or att == 0 then
        return attList
    end
    local attArray = string.split(att, "|")

    local myJob = job or SL:GetMetaValue("JOB")
    for k,v in pairs(attArray) do
        local attData = string.split(v, "#")
    
        local needJob = tonumber(attData[1])
        local attId = tonumber(attData[2])
        local attValue = tonumber(attData[3])
        if (myJob == 3 or needJob == 3 or needJob == myJob) then
            if attList[attId] then
                attList[attId] = attList[attId] + attValue
            else
                attList[attId] = attValue
            end
        end
    end
    return attList
end

local screenW = SL:GetMetaValue("SCREEN_WIDTH")
local screenH = SL:GetMetaValue("SCREEN_HEIGHT")

local ItemFrom = SL:GetMetaValue("ITEMFROMUI_ENUM")
local FormHero = {
    [ItemFrom.HERO_EQUIP] = true,
    [ItemFrom.HERO_BAG] = true,
    [ItemFrom.HERO_BEST_RINGS] = true
}

local FromEquip = {
    [ItemFrom.PALYER_EQUIP] = true,
    [ItemFrom.BEST_RINGS] = true,
    [ItemFrom.HERO_EQUIP] = true,
    [ItemFrom.HERO_BEST_RINGS] = true
}

local EquipMapByStdMode = SL:GetMetaValue("EQUIPMAP_BY_STDMODE")
local showLasting = SL:GetMetaValue("EX_SHOWLAST_MAP")

----------------- Params
local _PathRes       = "res/private/item_tips/"
local _PathResWin    = "res/private/item_tips_win32/"
local _TotalWidth    = 800
local _TextSize      = 18
local _DefaultFSize  = SL:GetMetaValue("WINPLAYMODE") and 12 or 16     -- 官方默认字号
local _TipsMaxH      = screenH - 100
local _PanelNum      = 0
local _DefaultSpace  = 10
local _lookPlayer    = false    
local _isSelf        = false

local _IsHero        = false

local rightSpace     = 15
local vspace         = SL:GetMetaValue("GAME_DATA", "DEFAULT_VSPACE")    -- 富文本行距
local fontPath       = SL:GetMetaValue("CHATANDTIPS_USE_FONT") or GUI.PATH_FONT2

-- 配置大小
local _setFontSize = nil
local _setVspace = SL:GetMetaValue("GAME_DATA", "DEFAULT_VSPACE")    -- 行距

-- 描述相关
local topDesY = {}
local rich_att_num = 0
local desc_img_num = 0

local function ResetDescParam() 
    topDesY = {}
    rich_att_num = 0
    desc_img_num = 0
end

local function IsEquip(itemData)
    return SL:GetMetaValue("ITEMTYPE", itemData) == SL:GetMetaValue("ITEMTYPE_ENUM").Equip
end

-- 按钮显示开关配置（cfg_game_data 表 BackpackGuide 字段）
-- switchType (1: 佩戴    2: 拆分   3: 不显示按钮)
local function IsOpenSwitch(switchType, StdMode)
    if not switchType then
        return false
    end

    if not ItemTips._Switch then
        ItemTips._Switch = {}
        local BackpackGuide = SL:GetMetaValue("GAME_DATA", "BackpackGuide")
        if BackpackGuide then
            local guide = string.split(BackpackGuide, "#") --拆分/佩戴开关
            for i, v in ipairs(guide) do
                if i == 3 then
                    ItemTips._Switch[3] = ItemTips._Switch[3] or {}

                    local stdModes = string.split(v or "", "|")
                    for _, stdMode in ipairs(stdModes) do
                        if stdMode and string.len(stdMode) > 0 then
                            ItemTips._Switch[3][tonumber(stdMode)] = tonumber(stdMode)
                        end
                    end
                else
                    if v and string.len(v) > 0 then
                        ItemTips._Switch[i] = v and tonumber(v) or 0
                    end
                end
            end
        end
    end

    if switchType ~= 3 then
        return ItemTips._Switch[switchType] == 1
    end

    if not StdMode then
        return false
    end

    if not ItemTips._Switch[3] then
        return true
    end

    return ItemTips._Switch[3][StdMode] == nil
end

function ItemTips.main(data)
    local parent = GUI:Attach_Parent()
    ItemTips._data = data
    ItemTips._panelListSubItems = {}
    ItemTips.itemCount = 0
    ItemTips._PList = nil
    ItemTips._diff = false
    ItemTips._equipAttList = {} -- 身上的装备属性
    ItemTips._showTitleList = {}

    -- 是否是英雄装备
    _IsHero     = data.from and FormHero[data.from] or false
    _lookPlayer = data.lookPlayer
    _isSelf     = data.from ~= nil and FromEquip[data.from]
    topDesY     = {}
    rich_att_num = 0
    desc_img_num = 0

    local itemData = data.itemData or (data.typeId and SL:GetMetaValue("ITEM_DATA", data.typeId))

    if SL:GetMetaValue("WINPLAYMODE") then
        _TextSize = 13
    end

    local setData = SL:GetMetaValue("GAME_DATA", "setTipsFontSizeVspace")
    if setData and string.len(setData) > 0 then
        if tonumber(setData) and tonumber(setData) == 0 then
        else
            local setList = string.split(setData, "|")
            if setList[1] or setList[2] then
                local data = SL:GetMetaValue("WINPLAYMODE") and setList[2] or setList[1]
                if data and string.len(data) > 0 then
                    local valueList = string.split(data, "#")
                    if valueList[1] and tonumber(valueList[1]) then
                        _TextSize = tonumber(valueList[1])
                        _setFontSize = _TextSize
                    end
                    if valueList[2] and tonumber(valueList[2]) then
                        vspace = tonumber(valueList[2])
                        _setVspace = vspace
                    end
                end
            end
        end
    end

    -- 属性标题配置
    local showData = SL:GetMetaValue("GAME_DATA", "setTipsAttrTitle")
    if showData and string.len(showData) > 0 then
        local showList = string.split(showData, "|")
        for i, data in ipairs(showList) do
            if data and string.len(data) > 0 then
                ItemTips._showTitleList[i] = {}
                local param = string.split(data, "#")
                if param[1] and string.len(param[1]) > 0 then
                    ItemTips._showTitleList[i].name = param[1]
                end
                ItemTips._showTitleList[i].color = param[2] and tonumber(param[2])
            end
        end
    end

    if not data.pos then
        data.pos = {x = screenW / 2, y = screenH / 2}
        data.anchorPoint = {x = 0.5, y = 0.5}
    end

    if data.node then
        local PMainUI = GUI:Layout_Create(data.node, "PMainUI", 0, 0, screenW, screenH)
        ItemTips._PMainUI = PMainUI
    else
        local PMainUI = GUI:Layout_Create(parent, "PMainUI", 0, 0, screenW, screenH)
        ItemTips._PMainUI = PMainUI
        GUI:setTouchEnabled(PMainUI, true)
        GUI:setSwallowTouches(PMainUI, false)
        GUI:addOnClickEvent(PMainUI, function() 
            SL:CloseItemTips() 
        end)
    end

    -- 道具类型
    if IsEquip(itemData) then
        ItemTips.GetEquipTips(data)
        ItemTips.SetTradeCapturePanel(ItemTips._PList)
    else
        ItemTips.GetItemTips(data, itemData)
    end

    -- 注册监听Tips鼠标滚动
    SL:RegisterLUAEvent(LUA_EVENT_ITEMTIPS_MOUSE_SCROLL, "ItemTips", ItemTips.OnMouseScroll)
end

function ItemTips.GetEquipTips(data)
    local from = ItemTips._data.from

    -- 装备1
    local itemData = data.itemData or (data.typeId and SL:GetMetaValue("ITEM_DATA", data.typeId))
    -- 装备2
    local itemData2 = data.itemData2
    -- 装备3
    local itemData3 = data.itemData3

    local v = SL:GetMetaValue("GAME_DATA", "tipsButtonOut")
    local isTipsOutSideBtn = tonumber(v) and tonumber(v) == 1
    local panelIndex = 0
    local setValue = SL:GetMetaValue("SETTING_VALUE", 36)
    local checkSet = (setValue and setValue[1]) == 1
    if checkSet and (from == ItemFrom.BAG or from == ItemFrom.AUTO_TRADE or from == ItemFrom.HERO_BAG) then
        local diffEquips = SL:GetDiffEquip(itemData, from == ItemFrom.HERO_BAG)
        local diffFrom = from == ItemFrom.HERO_BAG and ItemFrom.HERO_EQUIP or ItemFrom.PALYER_EQUIP
        if diffEquips and #diffEquips > 0 then
            ItemTips._diff = true
            panelIndex = panelIndex + 1
            local dData = SL:CopyData(data)
            dData.diff = true
            dData.diffFrom = diffFrom

            -- 对比身上的装备
            if diffEquips[1] then
                ItemTips.CreateEquipPanel(dData, diffEquips[1], false, panelIndex)
            end
            if diffEquips[2] then
                ItemTips.CreateEquipPanel(dData, diffEquips[2], false, panelIndex)
            end
        end
    end

    ItemTips.CreateEquipPanel(data, itemData, nil, isTipsOutSideBtn and (panelIndex + 1) or 0)

    if itemData2 then
        if IsEquip(itemData2) then
            ItemTips.CreateEquipPanel(data, itemData2)
        end
    end
    if itemData3 then
        if IsEquip(itemData3) then
            ItemTips.CreateEquipPanel(data, itemData3)
        end
    end
end

local function removeLastLine()
    if not ItemTips.contentPanel then
        return
    end
    local panelSize = GUI:getContentSize(ItemTips.contentPanel)
    local lastItem = GUI:getChildByTag(ItemTips.contentPanel, ItemTips.itemCount)
    if lastItem and string.find(GUI:getName(lastItem), "PLINE") then
        local lastItemSz = GUI:getContentSize(lastItem)
        GUI:removeFromParent(lastItem)
        GUI:setContentSize(
            ItemTips.contentPanel,
            panelSize.width,
            panelSize.height - lastItemSz.height - (_setVspace or 0)
        )
        ItemTips.itemCount = ItemTips.itemCount - 1
    end
end

function ItemTips.PushItem(parent, childItem)
    local rootPanel = parent
    if not rootPanel then
        return
    end

    local itemCount = ItemTips.itemCount or 0
    itemCount = itemCount + 1

    local oldChildren = GUI:getChildByTag(rootPanel, itemCount)
    if string.find(GUI:getName(childItem), "PLINE") then
        if oldChildren then
            GUI:removeFromParent(childItem)
            return
        end
    end

    ItemTips.itemCount = itemCount
    local childrenSz                    = GUI:getContentSize(childItem)
    local anchorPoint                   = GUI:getAnchorPoint(childItem)
    local childrenPosX, childrenPosY    = GUI:getPositionX(childItem), GUI:getPositionY(childItem)
    local offX, offY                    = anchorPoint.x * childrenSz.width + childrenPosX, (anchorPoint.y - 1) * childrenSz.height + childrenPosY
    GUI:setTag(childItem, itemCount)

    local rootPanelSz                   = GUI:getContentSize(rootPanel) 
    local posx, posy                    = 0 + offX, -rootPanelSz.height + offY - (_setVspace or 0)
    local newMaxW                       = math.max(childrenPosX + (1 - anchorPoint.x) * childrenSz.width, rootPanelSz.width)      --panel最后的宽度
    local newMaxH                       = math.max(math.abs(posy), rootPanelSz.height + childrenSz.height + (_setVspace or 0))    --panel最后的高度
    if posy > 0 then --在顶部
        local rootPosY = GUI:getPositionY(rootPanel)
        local newRootPosY = posy + anchorPoint.y * childrenSz.height
        if newRootPosY > rootPosY then
            GUI:setPositionY(rootPanel, math.floor(newRootPosY))
            newMaxH = newMaxH + newRootPosY
        end
        newMaxH = newRootPosY + rootPanelSz.height
    elseif posy < 0 and posy - childrenSz.height > -rootPanelSz.height then --位置在底部之上
        newMaxH = rootPanelSz.height
    end

    GUI:setContentSize(rootPanel, newMaxW, newMaxH)
    GUI:setPosition(childItem, math.floor(posx), math.floor(posy))
    GUI:setLocalZOrder(childItem, itemCount)
end

-- 分割线
function ItemTips.CreateIntervalPanel(parent, height, line)
    local childList = GUI:getChildren(parent)
    local pLine = GUI:Layout_Create(parent, string.format("PLINE_%s", #childList + 1), 0, 0, 1, height)
    if line then
        local line = GUI:Image_Create(pLine, "line", 0, height / 2, _PathRes .. "line_tips_01.png")
        GUI:setAnchorPoint(line, 0, 0.5)
    end
    return pLine
end

-- 获取备注图片/特效 param: table  {res= 图片资源/特效id   x= 位置x  y = 位置y}
function ItemTips.GetNodeImage(parent, param, index)
    if not parent then
        return
    end
    if not param or not next(param) then
        return nil
    end
    local name = string.format("Desc_Img_%s", index or 0)
    local img = nil
    local imgSz = {
        width = 0,
        height = 0
    }
    if param.isSFX and param.res then
        img = GUI:Effect_Create(parent, name, 0, 0, 0, param.res)
        imgSz = GUI:getBoundingBox(img)
        if param.width > 0 and param.height > 0 then
            imgSz.width = param.width
            imgSz.height = param.height
        end
        GUI:setContentSize(img, imgSz.width, imgSz.height)
    else
        if param.res and SL:IsFileExist(param.res) then
            img = GUI:Image_Create(parent, name, 0, 0, param.res)
        end
    end

    if img then
        local newPosx, newPosy = param.x or 0, param.y or 0
        local imgPos = GUI:getPosition(img)
        GUI:setPosition(img, imgPos.x + newPosx, imgPos.y + newPosy)
        if param.scale and param.scale > 0 then
            GUI:setScale(img, param.scale)
        end
    end
    return img
end

-- 道具类型
ItemTips._item_type_name = nil
function ItemTips.GetTypeStr(itemData, isItem)
    if isItem and itemData and itemData.StdMode then
        if not ItemTips._item_type_name then
            ItemTips._item_type_name = {}
            local arrays = string.split(SL:GetMetaValue("GAME_DATA", "itemTypeName") or "", "|")
            for i, v in ipairs(arrays) do
                if v and v ~= "" then
                    local array = string.split(v, "#")
                    if tonumber(array[1]) and array[2] then
                        ItemTips._item_type_name[tonumber(array[1])] = array[2]
                    end
                end
            end
        end
        local name = ItemTips._item_type_name[itemData.StdMode] or "道具"
        return string.format("类型：%s", name)
    end
    return nil
end

function ItemTips.GetTouBaoGold(data)
    local insureGoldList = data.InsureGoldList
    if insureGoldList and string.len(insureGoldList) > 0 then
        local goldList = {}
        local list = string.split(insureGoldList, "|")
        for _, v in ipairs(list) do
            local value = string.split(v, "#")
            goldList[_] = {goldType = tonumber(value[1]), goldNum = tonumber(value[2]), notshow = tonumber(value[3]) == 1}

        end
        local maxIndex = #list
        if data.touBaoTimes and goldList[data.touBaoTimes] then
            return goldList[data.touBaoTimes]
        elseif data.touBaoTimes and data.touBaoTimes > maxIndex then
            return goldList[maxIndex]
        else
            return goldList[1]
        end
    end
    return
end

-- 投保
function ItemTips.GetTouBaoDesc(data)
    local toubaoStr = nil
    local value = ItemTips.GetTouBaoGold(data)
    local gold = value and value.goldNum or 0

    if gold > 0 and value and value.goldType then
        local moneyName = SL:GetMetaValue("ITEM_NAME", value.goldType) or ""
        if data.touBaoTimes then
            if value.notshow then
                toubaoStr = string.format("<font color='%s' size='%s'>已投保%s次</font>", "#28ef01", _DefaultFSize, data.touBaoTimes)
            else
                toubaoStr =
                    string.format(
                    "<font color='%s' size='%s'>已投保%s次，单次保额%s%s</font>",
                    "#28ef01",
                    _DefaultFSize,
                    data.touBaoTimes,
                    gold,
                    moneyName
                )
            end
        else
            if value.notshow then
                toubaoStr = string.format("<font color='%s' size='%s'>可投保</font>", "#ff0500", _DefaultFSize)
            else
                toubaoStr = string.format("<font color='%s' size='%s'>可投保，单次保额%s%s</font>", "#ff0500", _DefaultFSize, gold, moneyName)
            end
        end
    end

    return toubaoStr
end

--
function ItemTips.GetModeStr(itemData)
    local str = nil
    local shape = itemData.Shape
    local checkDura = nil
    if itemData.StdMode == 7 and (shape == 1 or shape == 2 or shape == 3) then
        --魔血石
        local typeStr = ""
        if shape == 1 then
            typeStr = "HP"
        elseif shape == 2 then
            typeStr = "MP"
        elseif shape == 3 then
            typeStr = "HPMP"
        end
        str = string.format("%s %d/%d万", typeStr, itemData.Dura / 1000, itemData.DuraMax / 1000)
        checkDura = itemData.Dura / 1000
    elseif itemData.StdMode == 25 then --护身符及毒药
        local num = string.format("%s/%s", math.round(itemData.Dura / 100), math.round(itemData.DuraMax / 100))
        str = string.format("数量:%s", num)
    elseif EquipMapByStdMode[itemData.StdMode] or showLasting[itemData.StdMode] then
        str = string.format("持久：%s", GUIFunction:GetDuraStr(itemData.Dura, itemData.DuraMax))
        checkDura = itemData.Dura / 1000
    elseif itemData.StdMode == 40 then --肉
        str = string.format("品质：%s", GUIFunction:GetDuraStr(itemData.Dura, itemData.DuraMax))
    elseif itemData.StdMode == 43 then --矿石
        str = string.format("纯度：%s", math.round(itemData.Dura / 1000))
    end

    if checkDura and checkDura < 1 then
        str = string.format("<font color='%s'>%s</font>", "#ff0000", str) -- 设置颜色(红色)
    end
    return str
end

--刀魂
function ItemTips.GetSwordOfSoul(parent, soulData, swordSoulIndex)
    if not parent then
        return
    end
    local switch = soulData[1] --进度条是否开启
    if switch ~= 1 then
        return nil
    end
    local nameStr       = soulData[2] or "" --名称
    local color         = soulData[3] --颜色
    local imgIndex      = soulData[4] --图片张数
    local jinduSwitch   = soulData[5] --进度开关
    local jinduValue    = soulData[6] --进度值
    local jinduMaxValue = soulData[7] --进度最大值
    local level         = soulData[8] --等级

    local newColor = nil
    if color then
        newColor = SL:GetColorByStyleId(color)
    end

    nameStr = jinduValue and string.gsub(nameStr, "%%p", jinduValue) or nameStr
    nameStr = jinduMaxValue and string.gsub(nameStr, "%%m", jinduMaxValue) or nameStr
    nameStr = level and string.gsub(nameStr, "%%l", level) or nameStr

    local percent = 0
    local isShowJinDuStr = false
    if jinduValue and jinduMaxValue and jinduMaxValue > 0 then
        percent = jinduValue / jinduMaxValue * 100
        isShowJinDuStr = true
    end
    local percentStr = string.format("%d%%", percent)
    nameStr = isShowJinDuStr and string.gsub(nameStr, "%%r", percentStr .. "%") or nameStr

    local tipsPanel = GUI:Layout_Create(parent, "s_Panel_" .. swordSoulIndex, 0, 0, 0, 0)
    local swordSoulName = GUI:Text_Create(tipsPanel, "swordSoulName", 0, 0, (SL:GetMetaValue("WINPLAYMODE") and 12 or 16), newColor or SL:ConvertColorFromHexString("#FFFFFF"), nameStr) 
    GUI:Text_enableOutline(swordSoulName, "#000000", 1)
    GUI:setAnchorPoint(swordSoulName, 0, 0)
	
    local swordSoulNameSz = GUI:getContentSize(swordSoulName)
    local nameW = swordSoulNameSz.width

    local tipW = nameW
    local tipH = swordSoulNameSz.height

    jinduValue = jinduValue or 0
    jinduMaxValue = jinduMaxValue or 100

    if (jinduSwitch == 1 or jinduSwitch == 2) and jinduMaxValue > 0 then
        local offX = 10
        local basePath = (SL:GetMetaValue("WINPLAYMODE") and _PathResWin or _PathRes) .. "sword_soul/"
        local barImgPath = string.format(basePath .. "jdtbg_%d.png", 1)

        local bgImg = GUI:Image_Create(tipsPanel, "bg_img", nameW + offX, 0, barImgPath)
        GUI:setAnchorPoint(bgImg, 0, 0)

        local bgImgSz = GUI:getContentSize(bgImg)
        local index = 1
        local progressImgPath = string.format(basePath .. "jdt%d_%d.png", 3, 1)
        local slider = GUI:Slider_Create(tipsPanel, "slider", nameW + offX + 5, 1, "", progressImgPath, "")
        GUI:setAnchorPoint(slider, 0, 0)
        GUI:setContentSize(slider, bgImgSz.width - 10, bgImgSz.height - 2)

--[[        SL:schedule(
            slider,
            function()
                index = index + 1
                if index > 3 then
                    index = 1
                end
                progressImgPath = string.format(basePath .. "jdt%d_%d.png", index, imgIndex)
                GUI:Slider_loadProgressBarTexture(slider, progressImgPath)
            end,
            0.3
        )--]]

        percent = jinduValue / jinduMaxValue * 100
        if percent > 100 then
            percent = 100
        end
        GUI:Slider_setPercent(slider, jinduValue / jinduMaxValue * 100)
        local sliderSz = GUI:getContentSize(slider)

        local progressStr = ""
        if jinduSwitch == 1 then
            progressStr = string.format("%d%%", percent)
        elseif jinduSwitch == 2 then
            progressStr = string.format("%d/%d", jinduValue, jinduMaxValue)
        end

        local progress = GUI:Text_Create(tipsPanel, "progress_txt", nameW + offX + bgImgSz.width / 2, 0, (SL:GetMetaValue("WINPLAYMODE") and 12 or 16), newColor or "#FFFFFF", progressStr)
        GUI:Text_enableOutline(progress, "#000000", 1)
        GUI:setAnchorPoint(progress, 0.5, 0)

        tipW = tipW + bgImgSz.width + offX
        tipH = math.max(tipH, bgImgSz.height)
    end
    GUI:setContentSize(tipsPanel, tipW, tipH)
    return tipsPanel
end

--

--获取属性原始id
local function getAttOriginId(id)
    return id >= 10000 and math.floor(id / 10000) or id
end

--显示 +
local function getAddShow(id, value)
    if tonumber(value) and tonumber(value) < 0 then
        return ""
    end
    if id == 1 or id == 2 or id == 13 or id == 14 or id == 15 or id == 16 or id == 17 or id == 18 or id == 19 or id == 20 or id == 38 or id == 39 then
        return "+"
    end
    return ""
end

function ItemTips.GetAttStr(itemData, diff)
    local pos = SL:GetMetaValue("EQUIP_POS_BY_STDMODE", itemData.StdMode)
    if not pos then
        return nil
    end
    local str = {} -- 添加属性提升标记

    -- 基础属性
    local attList           = GUIFunction:ParseItemBaseAtt(itemData.attribute)
    local attrAlignment     = SL:GetMetaValue("WINPLAYMODE") and tonumber(SL:GetMetaValue("GAME_DATA", "pc_tips_attr_alignment")) or 0
    local attrCoefficient   = SL:GetMetaValue("WINPLAYMODE") and -1 or 1
    attrAlignment           = math.ceil(attrAlignment / 3)
    --20以后的属性是元素属性
    local yuansuValues = {}
    local jipinValues = {}
    if itemData.Values and next(itemData.Values) ~= nil then
        for _, v in pairs(itemData.Values) do
            if v.Id < 20 then
                table.insert(jipinValues, v)
            else
                table.insert(yuansuValues, v)
            end
        end
    end

    --附加的元素属性
    local yuansuAtt = GUIFunction:GetExAttList(yuansuValues)
    if yuansuAtt and next(yuansuAtt) then
        attList = GUIFunction:CombineAttList(attList, yuansuAtt)
    end

    -- 极品属性
    local exAtt = GUIFunction:GetExAttList(jipinValues)
    local exAttShow = GUIFunction:GetAttDataShow(exAtt, true, true)
    -- 合并极品属性
    if exAtt and next(exAtt) then
        attList = GUIFunction:CombineAttList(attList, exAtt)
    end

    --属性提升
    local maxWidth = 0 --属性提升标识的位置
    local attUpList = {}
    if diff then
        table.insert(ItemTips._equipAttList, GUIFunction:GetAttDataShow(attList, nil, true))
    elseif next(ItemTips._equipAttList) then
        local curAttList = GUIFunction:GetAttDataShow(attList, nil, true)
        for _, attrList in pairs(ItemTips._equipAttList) do
            for id, curAtt in pairs(curAttList or {}) do
                if not attrList[id] then
                    attUpList[id] = true
                else
                    local att = attrList[id]
                    local value1 = curAtt.value
                    local value2 = att.value
                    if string.find(value1, "-") then
                        value1 = string.split(value1, "-")[2]
                        value2 = string.split(value2, "-")[2]
                    end

                    if string.find(value1, "%%") then
                        value1 = string.split(value1, "%")[1]
                        value2 = string.split(value2, "%")[1]
                    end

                    value1 = tonumber(value1)
                    value2 = tonumber(value2)
                    if value1 and value2 and value1 > value2 then
                        attUpList[id] = true
                    end
                end
            end
        end
    end

    -- 属性显示队列
    local stringAtt = GUIFunction:GetAttDataShow(attList, nil, true)
    --把基础属性和元素属性分开
    local basicAttrShow = {}
    local yuansuAttrShow = {}
    for id, v in pairs(stringAtt) do
        v.id = id
        local originId = getAttOriginId(id)
        local attConfig = SL:GetMetaValue("ATTR_CONFIG", originId)
        v.sort = attConfig and attConfig.sort or originId + 1000

        if attConfig and attConfig.ys == 1 then
            table.insert(yuansuAttrShow, v)
        else
            table.insert(basicAttrShow, v)
        end
    end

    table.sort(
        basicAttrShow,
        function(a, b)
            return a.sort < b.sort
        end
    )
    table.sort(
        yuansuAttrShow,
        function(a, b)
            return a.sort < b.sort
        end
    )

    if basicAttrShow and next(basicAttrShow) then
        local titleName = ItemTips._showTitleList[1] and ItemTips._showTitleList[1].name or "[基础属性]："
        local titleColor = ItemTips._showTitleList[1] and ItemTips._showTitleList[1].color or 154
        local titleStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(titleColor), titleName)
        table.insert(
            str,
            {
                str = titleStr
            }
        )
    end

    for _, v in pairs(basicAttrShow) do
        local name = string.gsub(v.name, " ", "")
        name = string.gsub(name, "　", "")
        local value  = getAddShow(v.id, v.value) .. v.value
        local nameLen, chineseLen = SL:GetUTF8ByteLen(name)  
        local newLen = math.max(attrAlignment - nameLen - chineseLen * attrCoefficient + SL:GetUTF8ByteLen(value), 0)
        local lenStr = string.format("%%%ds", newLen)
        value        = string.format(lenStr, value)

        local oneStr = name .. value
        local color = v.color
        if exAttShow and exAttShow[v.id] then
            oneStr = oneStr .. string.format("(%s)", exAttShow[v.id].value)
            color = 1039
        end

        if color and color > 0 then
            oneStr = string.format("<font color='%s'>%s</font>", color == 1039 and "#28EF01" or SL:GetHexColorByStyleId(color), oneStr)
        end

        table.insert(
            str,
            {
                id = v.id,
                str = oneStr
            }
        )
    end

    --强度
    if itemData.StdMode ~= 16 and itemData.Source and itemData.Source > 0 then
        local oneStr = string.format("强度：+%s", itemData.Source)
        oneStr = string.format("<font color='%s'>%s</font>", "#28EF01", oneStr)
        table.insert(
            str,
            {
                str = oneStr
            }
        )
    end

    --负重
    if (itemData.StdMode == 52 or itemData.StdMode == 62 or itemData.StdMode == 54 or itemData.StdMode == 64 
        or itemData.StdMode == 84 or itemData.StdMode == 85 or itemData.StdMode == 86 or itemData.StdMode == 87) 
        and itemData.AniCount and itemData.AniCount > 0 then
        local oneStr = string.format("负重：+%s", itemData.AniCount)
        oneStr = string.format("<font color='%s'>%s</font>", "#28EF01", oneStr)
        table.insert(
            str,
            {
                str = oneStr
            }
        )
    end

    local str2 = {}
    if yuansuAttrShow and next(yuansuAttrShow) then
        local titleName = ItemTips._showTitleList[2] and ItemTips._showTitleList[2].name or "[元素属性]："
        local titleColor = ItemTips._showTitleList[2] and ItemTips._showTitleList[2].color or 154
        local yuansuTitle = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(titleColor), titleName)
        table.insert(
            str2,
            {
                str = yuansuTitle
            }
        )
        for _, v in pairs(yuansuAttrShow) do
            local name = string.gsub(v.name, " ", "")
            name = string.gsub(name, "　", "")
            local value = getAddShow(v.id, v.value) .. v.value
            local nameLen, chineseLen = SL:GetUTF8ByteLen(name)
            local newLen = math.max(attrAlignment - nameLen - chineseLen * attrCoefficient + SL:GetUTF8ByteLen(value), 0)
            local lenStr = string.format("%%%ds", newLen)
            value        = string.format(lenStr, value)

            local oneStr = name .. value
            local color = v.color
            if exAttShow and exAttShow[v.id] then
                oneStr = oneStr .. string.format("(%s)", exAttShow[v.id].value)
            end

            if color and color > 0 then
                oneStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(color), oneStr)
            end

            table.insert(
                str2,
                {
                    id = v.id,
                    str = oneStr
                }
            )
        end
    end

    return str, str2, attUpList
end

function ItemTips.ParseExAddAttr(attr)
    if not attr or string.len(attr) == "" then
        return
    end

    local attrAlignment     = SL:GetMetaValue("WINPLAYMODE") and tonumber(SL:GetMetaValue("GAME_DATA", "pc_tips_attr_alignment")) or 0
    local attrCoefficient   = SL:GetMetaValue("WINPLAYMODE") and -1 or 1
    attrAlignment           = math.ceil(attrAlignment / 3)

    local attList = {}
    local exList = {}
    local strList = string.split(attr, ",")
    for i, v in pairs(strList) do
        local data = string.split(v, "=")
        if tonumber(data[1]) and data[2] and tonumber(data[2]) then
            table.insert(attList, {id = tonumber(data[1]), value = tonumber(data[2])})
        end
    end

    local stringAtt = GUIFunction:GetAttDataShow(attList, nil, true)
    local attrShow = {}
    for id, v in pairs(stringAtt) do
        v.id = id
        local originId = getAttOriginId(id)
        local attConfig = SL:GetMetaValue("ATTR_CONFIG", originId)
        v.sort = attConfig and attConfig.sort or originId + 1000
        v.excolor = attConfig.excolor
        table.insert(attrShow, v)
    end
    
    table.sort(attrShow, function(a, b)
        return a.sort < b.sort
    end)

    local strList = {}
    if attrShow and next(attrShow) then
        local titleName = ItemTips._showTitleList[3] and ItemTips._showTitleList[3].name or "[附加属性]："
        local titleColor = ItemTips._showTitleList[3] and ItemTips._showTitleList[3].color or 154
        local titleStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(titleColor), titleName)
        table.insert(strList, {
            str = titleStr
        })
    end

    for _,v in pairs(attrShow) do
        local name = string.gsub(v.name, " ", "")
        name = string.gsub(name, "　", "")
        local value  = getAddShow(v.id, v.value) .. v.value
        local nameLen, chineseLen = SL:GetUTF8ByteLen(name)  
        local newLen = math.max(attrAlignment - nameLen - chineseLen * attrCoefficient + SL:GetUTF8ByteLen(value), 0)
        local lenStr = string.format("%%%ds", newLen)
        value        = string.format(lenStr, value)
        local color  = tonumber(v.excolor) or 250
        local oneStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(color), name .. value)

        table.insert(strList, {
            id = v.id,
            str = oneStr
        })
    end

    return strList
end

function ItemTips.GetNeedStr(itemData, isItem)
    local strList = nil
    if _IsHero then
        strList = SL:CheckItemUseNeed_Hero(itemData).conditionStr
    else
        strList = SL:CheckItemUseNeed(itemData).conditionStr
    end
    if strList and next(strList) then
        local str = ""
        for i, v in ipairs(strList) do
            local color = v.can and "#ffffff" or "#ff0000"
            local conditionStr = string.format("<font color = '%s'>%s</font>", color, v.str)
            str = str .. conditionStr .. (i ~= #strList and "<br>" or "")
        end
        return str
    end
    return isItem and "需求：无限制" or nil
end

-- 宝石属性显示
function ItemTips.GetGemShow(parent, itemData)
    if not itemData or not itemData.ExtendInfo or not itemData.ExtendInfo.Sockets or not parent then
        return
    end

    local function getIconResPath(looks)
        local fileName = string.format("%06d", looks % 10000)
        local pathIndex = math.floor(tonumber(looks) / 10000)
        local filePath = "item_ground_" .. pathIndex .. "/" .. fileName
        local path = string.format("%s%s.png", "res/item_ground/", filePath)
        return path
    end

    local maxWidth = 0

    local titleName = ItemTips._showTitleList[5] and ItemTips._showTitleList[5].name or "[镶嵌宝石]："
    local titleColor = ItemTips._showTitleList[5] and ItemTips._showTitleList[5].color or 154
    local title = GUI:RichText_Create(parent, "rich_gem", 0, 0, titleName, _TotalWidth - 20, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(titleColor), vspace) 
    ItemTips.PushItem(parent, title)
    maxWidth = GUI:getContentSize(title).width

    local richPosX = 0
    for i, id in pairs(itemData.ExtendInfo.Sockets) do
        if id > 0 then
            local goodLayout = GUI:Layout_Create(parent, "layout_gem_" .. i, 0, 0, 20, 20)
            GUI:setTouchEnabled(goodLayout, false)
            local size = GUI:getContentSize(goodLayout)

            local gemBg = GUI:Image_Create(goodLayout, "bg_gem_" .. i, 0, 0, _PathRes .. "000000.png")
            GUI:setAnchorPoint(gemBg, 0.5, 0.5)
            local gemBgSize = GUI:getContentSize(gemBg)

            richPosX = 0
            richPosX = richPosX + gemBgSize.width + 6
            local maxH = gemBgSize.height
            if id == 1 then
                local rich = GUI:RichText_Create(goodLayout, "rich_" .. i, 0, 0, "未镶嵌宝石", _TotalWidth - 20, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(60), vspace) 
                GUI:setAnchorPoint(rich, 0, 0.5)
                maxWidth = math.max(maxWidth, size.width + GUI:getContentSize(rich).width)

                if GUI:getContentSize(rich).height > size.height then
                    size = {
                        width = size.width,
                        height = GUI:getContentSize(rich).height
                    }
                    GUI:setContentSize(goodLayout, size)
                end
                GUI:setPosition(rich, math.floor(size.width), math.floor(size.height / 2))
                richPosX = richPosX + GUI:getContentSize(rich).width
            elseif id > 1 then
                local gemData = SL:GetMetaValue("ITEM_DATA", id)
                if gemData then
                    if gemData.Shape and gemData.Shape <= 4 then
                        local icon = GUI:Image_Create(gemBg, "icon_" .. i, gemBgSize.width / 2, gemBgSize.height / 2, _PathRes .. string.format("00000%s.png", gemData.Shape + 1))
                        GUI:setAnchorPoint(icon, 0.5, 0.5)
                        maxWidth = math.max(maxWidth, gemBgSize.width)
                    elseif gemData.Shape == 255 and gemData.Looks then
                        GUI:setVisible(gemBg, false)
                        local icon = GUI:Image_Create(goodLayout, "icon_" .. i, richPosX - gemBgSize.width - 6, 0, getIconResPath(gemData.Looks))
                        GUI:setAnchorPoint(icon, 0, 0.5)
                        local iconSz = GUI:getContentSize(icon)
                        GUI:setPositionY(icon, iconSz.height / 2)
                        maxWidth = math.max(maxWidth, iconSz.width + gemBgSize.width)
                        richPosX = richPosX + iconSz.width
                        richPosX = richPosX - gemBgSize.width - 6
                        maxH = math.max(maxH, iconSz.height)
                    end

                    local attList = GUIFunction:ParseItemBaseAtt(gemData.attribute)
                    local attShow = GUIFunction:GetAttShowOrder(attList, nil, true)
                    local attStr = ""
                    for _, v in pairs(attShow) do
                        local name = string.gsub(v.name, " ", "")
                        name = string.gsub(name, "　", "")

                        local value = v.value
                        if gemData.Reserved == 1 and not string.find(value, "%%") then
                            if tonumber(value) then
                                value = tonumber(value) .. "%"
                            elseif string.find(value, "-") then
                                local sliceStr = string.split(value, "-")
                                if tonumber(sliceStr[1]) and tonumber(sliceStr[2]) then
                                    value = tonumber(sliceStr[1]) .. "%" .. "-" .. tonumber(sliceStr[2]) .. "%"
                                end
                            end
                        end

                        local oneStr = name .. getAddShow(v.id, value) .. value
                        local color = v.color

                        if color and color > 0 then
                            oneStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(color), oneStr)
                        end

                        attStr = attStr .. oneStr .. "&nbsp;&nbsp;"
                    end

                    local rich_name = GUI:RichText_Create(goodLayout, "rich_name", 0, 0, attStr, _TotalWidth - 20 - size.width, _setFontSize or _DefaultFSize, "#FFFFFF", vspace)
                    GUI:setAnchorPoint(rich_name, 0, 0.5)
                    local richSize = GUI:getContentSize(rich_name)
                    maxWidth = math.max(maxWidth, richSize.width + size.width)

                    if richSize.height > size.height then
                        maxH = math.max(maxH, richSize.height)
                    end
                    maxH = math.max(maxH, 20)
                    size = {width = size.width, height = maxH}
                    GUI:setContentSize(goodLayout, size)
                    GUI:setPosition(rich_name, math.floor(richPosX), math.floor(size.height / 2))
                end
            end

            GUI:setPosition(gemBg, size.width / 2, size.height / 2)
            ItemTips.PushItem(parent, goodLayout)
        end
    end

    return maxWidth
end

-- 回收/出售
function ItemTips.GetRecycleStr(itemData)
    if itemData.huishou or itemData.honour then
        local str = ""
        if itemData.huishou and itemData.huishou ~= "" then
            local sliceStr = string.split(itemData.huishou, "#")
            local id = tonumber(sliceStr[1])
            local count = tonumber(sliceStr[2])
            local config = SL:GetMetaValue("ITEM_DATA", id)
            str = string.format("装备回收：%s*%s", config and config.Name or "", count) .. "<br>"
        end

        if itemData.honour and itemData.honour ~= "" then
            local sliceStr = string.split(itemData.honour, "#")
            local id = tonumber(sliceStr[1])
            local count = tonumber(sliceStr[2])
            local config = SL:GetMetaValue("ITEM_DATA", id)
            str = str .. string.format("行会出售：%s*%s", config and config.Name or "", count)
        end

        return str
    end
    return nil
end

function ItemTips.GetCustomTitleShow(index, parent, content, color)
    if not content or string.len(content) < 1 then
        return nil
    end
    if not parent then
        return
    end
    local layout = GUI:Layout_Create(parent, "custom_title_" .. index, 0, 0, 0, 0)

    local function parseStr(content)
        if not content or string.len(content) < 1 then
            return nil
        end

        local firstStr = ""
        local nextStr = ""

        local find_info_img = {string.find(content, "<IMG:(.-)>")}
        local begin_pos_img = find_info_img[1]
        local end_pos_img   = find_info_img[2]

        local find_info_sfx = {string.find(content, "<TEXIAO:(.-)>")}
        local begin_pos_sfx = find_info_sfx[1]
        local end_pos_sfx   = find_info_sfx[2]

        local begin_pos_line, end_pos_line = string.find(content, "\\")
        if begin_pos_line and end_pos_line then
            if begin_pos_line == 1 then
                firstStr = string.sub(content, 0, end_pos_line)
                nextStr = string.sub(content, end_pos_line + 1, string.len(content))
            else
                firstStr = string.sub(content, 0, begin_pos_line - 1)
                nextStr = string.sub(content, begin_pos_line, string.len(content))
            end
        elseif (begin_pos_img and end_pos_img) or (begin_pos_sfx and end_pos_sfx) then
            local begin_pos = begin_pos_img ~= nil and (begin_pos_sfx ~= nil and math.min(begin_pos_img, begin_pos_sfx) or begin_pos_img) or begin_pos_sfx
            local end_pos = end_pos_img ~= nil and (end_pos_sfx ~= nil and math.min(end_pos_img, end_pos_sfx) or end_pos_img) or end_pos_sfx
            if begin_pos == 1 then
                firstStr = string.sub(content, 0, end_pos)
                nextStr = string.sub(content, end_pos + 1, string.len(content))
            else
                firstStr = string.sub(content, 0, begin_pos - 1)
                nextStr = string.sub(content, begin_pos, string.len(content))
            end
        else
            firstStr = content
            nextStr = ""
        end

        return firstStr, nextStr
    end

    local lineLayout = GUI:TipLineWidget_Create(layout, "line_layout_" .. index, 0, 0)

    local cell_num = 0

    local function createCell(str)
        local cell = nil
        local offset = {x = 0, y = 0}
        local isSetAnchorPoint = true
        cell_num = cell_num + 1
        if string.find(str, "<IMG:") then
            local find_info_img = {string.find(content, "<IMG:(.-)>")}
            local sliceStr = string.split(find_info_img[3] or "", ":")
            local res = sliceStr[1]
            if tonumber(res) then
                res = string.format("res/custom/tiptitle/%s.png", res)
            end
            if res then
                cell = GUI:Image_Create(lineLayout, "image_" .. cell_num, 0, 0, string.gsub(res, "\\", "/"))
                offset.x = tonumber(sliceStr[2]) or 0
                offset.y = tonumber(sliceStr[3]) or 0
            end
        elseif string.find(str, "<TEXIAO:") then
            local find_info_sfx = {string.find(content, "<TEXIAO:(.-)>")}
            local sliceStr = string.split(find_info_sfx[3] or "", ":")
            local sfxId = tonumber(sliceStr[1])
            if sfxId then
                isSetAnchorPoint = false
                cell = GUI:Effect_Create(lineLayout, "effect_" .. cell_num, 0, 0, 0, sfxId)
                GUI:setContentSize(cell, tonumber(sliceStr[2]) or 50, tonumber(sliceStr[3]) or 50)
                offset.x = tonumber(sliceStr[4]) or 0
                offset.y = tonumber(sliceStr[5]) or 0
            end
        else
            if str == "\\" then
                lineLayout = GUI:TipLineWidget_Create(layout, "line_layout_cell_" .. cell_num, 0, 0)
            elseif string.len(str) > 0 then
                local lineWidth = GUI:TipLineWidget_getSize(lineLayout).width
                local hexColor = color and SL:GetHexColorByStyleId(color) or "#28EF01"
                cell = GUI:RichTextFCOLOR_Create(lineLayout, "rich_" .. cell_num, 0, 0, str, _TotalWidth - 20 - lineWidth, _setFontSize or _DefaultFSize, hexColor, vspace)
            end
        end

        if cell then
            if isSetAnchorPoint then
                GUI:setAnchorPoint(cell, 0.5, 0.5)
            end
            GUI:TipLineWidget_pushCell(lineLayout, cell, offset)
        end
    end

    while content and string.len(content) > 0 do
        local firstStr, nextStr = parseStr(content)
        createCell(firstStr)
        content = nextStr
    end

    local layoutSize = {width = 0, height = 0}
    for _, v in pairs(GUI:getChildren(layout)) do
        GUI:TipLineWidget_updateSize(v)
        local size = GUI:TipLineWidget_getSize(v)
        layoutSize.width = math.max(layoutSize.width, size.width)
        layoutSize.height = layoutSize.height + size.height
    end

    GUI:setContentSize(layout, layoutSize)

    local curH = layoutSize.height
    for _, v in pairs(layout:getChildren()) do
        local size = GUI:TipLineWidget_getSize(v)
        curH = curH - size.height
        GUI:setPosition(v, 0, math.floor(curH))
    end

    return layout
end

--自定义属性
function ItemTips.GetCustomShow(parent, data, isPetItem)
    if not data or next(data) == nil then
        return nil
    end
    if not parent then
        return
    end

    local str = ""
    local list = GUI:ListView_Create(parent, "Custom_list", 0, 0, 0, 0, 1)
    GUI:setTouchEnabled(list, false)
    GUI:ListView_setItemsMargin(list, _setVspace or 0)
    local listSize = {width = 0, height = 0}
    for p, d in pairs(data.abil or {}) do
        local isShowAttr = true
        if (not d.t or d.t == "") and not isPetItem then
            isShowAttr = false
        end

        if isShowAttr then
            local title = ItemTips.GetCustomTitleShow(p, list, d.t, d.c)
            if title then
                local titleSize = GUI:getContentSize(title)
                listSize.height = listSize.height + titleSize.height + (_setVspace or 0)
                listSize.width = math.max(listSize.width, titleSize.width)
            end
        end

        local group = d.i or 0
        local attList = {}
        for _, v in pairs(isShowAttr and d.v or {}) do
            local color     = v[1] or 0
            local attId     = v[2] or 0
            local value     = v[3] or 0
            local percent   = v[4] or 0
            local customId  = v[5]
            local pos       = v[6]
            if value and value > 0 then
                attList[pos] = attList[pos] or {}
                table.insert(
                    attList[pos],
                    {color = color, attId = attId, value = value, percent = percent, pos = pos, customId = customId}
                )
            end
        end
        attList =
            SL:HashToSortArray(
            attList,
            function(a, b)
                return a[1].pos < b[1].pos
            end
        )

        for k, v in pairs(isShowAttr and attList or {}) do
            local customId = v[1] and v[1].customId or 1
            local customDesc = SL:GetMetaValue("CUSTOM_DESC", customId)
            local customIcon = SL:GetMetaValue("CUSTOM_ICON", customId)
            local color = 0
            local attr = ""
            for i, a in pairs(v) do
                local attConfig = SL:GetMetaValue("ATTR_CONFIG", a.attId)
                if not attConfig then
                    attConfig = {}
                end
                local value = a.value
                if attConfig and attConfig.type == 2 then --万分比除100
                    value = string.format("%.1f", value / 100) * 10 / 10
                end
                if customDesc then
                    local desc = value .. (a.percent > 0 and "%%" or "")
                    customDesc = string.gsub(customDesc, "%%s", desc, 1)
                    if a.color > 0 then
                        color = a.color
                    end
                else
                    local name = attConfig.name
                    if attConfig.AbilEx and string.len(attConfig.AbilEx) > 0 then
                        local sliceStr = string.split(attConfig.AbilEx, "|")
                        if sliceStr[p] then
                            name = sliceStr[p]
                        end
                    end

                    if isPetItem then
                        attr = attr .. string.format("<%s： %s%s/FCOLOR=%s>", name, value, a.percent > 0 and "%" or "", a.color)
                    else
                        attr = attr .. string.format("<%s：+%s%s/FCOLOR=%s>", name, value, a.percent > 0 and "%" or "", a.color)
                    end
                end
            end

            local node = GUI:Layout_Create(list, string.format("node_%s_%s", p, k), 0, 0, 0, 0)
            GUI:setAnchorPoint(node, 0, 0.5)
            local sizeW, sizeH = 0, 0
            local img = nil
            local tx = nil
            local rich_custom = nil
            if customIcon and next(customIcon) then
                if customIcon[1] then --图片
                    local path = string.gsub(customIcon[1].res, "\\", "/")
                    img = GUI:Image_Create(node, "icon_" .. k, customIcon[1].x, customIcon[1].y, path)
                    GUI:setAnchorPoint(img, 0, 0.5)
                    local imgSize = GUI:getContentSize(img)
                    sizeH = imgSize.height
                    sizeW = sizeW + imgSize.width
                elseif customIcon[2] then --特效
                    tx = GUI:Effect_Create(node, "effect_" .. k, 0, 0, 0, tonumber(customIcon[2].res))
                    local txSize = GUI:getBoundingBox(tx)
                    local anchorPoint = GUI:getAnchorPoint(tx)
                    GUI:setPosition(tx, txSize.width * anchorPoint.x + customIcon[2].x, customIcon[2].y)
                    sizeH = math.max(sizeH, txSize.height)
                    sizeW = sizeW + txSize.width
                end
            end

            if customDesc then
                if color > 0 then
                    if string.find(customDesc, "FCOLOR") then
                        customDesc = string.gsub(customDesc, "FCOLOR=%d+>", string.format("FCOLOR=%s>", color))
                    elseif string.find(customDesc, "<.+>") then
                        customDesc = string.gsub(customDesc, ">", string.format("/FCOLOR=%s>", color))
                    else
                        customDesc = string.format("<%s/FCOLOR=%s>", customDesc, color)
                    end
                end
                attr = customDesc
            else
                attr = attr
            end

            if attr and attr ~= "" then
                rich_custom = GUI:RichTextFCOLOR_Create(node, "rich_" .. k, math.floor(sizeW), 0, attr or "", _TotalWidth - 20, _setFontSize or _DefaultFSize, "#28EF01", vspace, nil, fontPath)
                GUI:setAnchorPoint(rich_custom, 0, 0.5)
                local richSz = GUI:getContentSize(rich_custom)
                GUI:setPositionY(rich_custom, math.floor(richSz.height))
                sizeH = math.max(sizeH, richSz.height)
                sizeW = sizeW + richSz.width
            end

            if sizeW > 0 and sizeH > 0 then
                GUI:setContentSize(node, sizeW, sizeH)
                if img then
                    GUI:setPositionY(img, math.floor(sizeH / 2))
                end
                if tx then
                    GUI:setPositionY(tx, math.floor(sizeH / 2))
                end
                if rich_custom then
                    GUI:setPositionY(rich_custom, math.floor(sizeH / 2))
                end

                listSize.height = listSize.height + sizeH + (_setVspace or 0)
                listSize.width = math.max(listSize.width, sizeW)
            end
        end
    end

    if listSize.width > 0 and listSize.height > 0 then
        GUI:setContentSize(list, listSize)
    else
        GUI:removeFromParent(list)
        list = nil
    end

    return list
end

--道具时限 身上的是时间戳 其他地方是剩余时间
function ItemTips.GetTimeStr(type, addValues, onEquip, data)
    local time = nil
    if addValues then
        for _, v in pairs(addValues) do
            if v.Id == 0 then
                time = v.Value
                break
            end
        end
    end
    if not time then
        return nil
    end

    local itemData = data and data.itemData
    local MakeIndex = itemData and itemData.MakeIndex
    if MakeIndex and itemData then
        local from = data and data.from
        if itemData.Need == 101 then --只穿戴身上时计时
            if
                (not from or from == ItemFrom.PALYER_EQUIP or from == ItemFrom.HERO_EQUIP) and
                    SL:GetMetaValue("EQUIP_DATA_BY_MAKEINDEX", MakeIndex, from == ItemFrom.HERO_EQUIP)
            then
                time = time - SL:GetMetaValue("SERVER_TIME")
            else
                time = time - (itemData.getServerTime or 0)
            end
        elseif itemData.Need == 102 then --穿戴/背包/仓库都计时
            local checkNext = true
            if checkNext then
                if
                    (not from or from == ItemFrom.PALYER_EQUIP or from == ItemFrom.HERO_EQUIP) and
                        SL:GetMetaValue("EQUIP_DATA_BY_MAKEINDEX", MakeIndex, from == ItemFrom.HERO_EQUIP)
                then
                    time = time - SL:GetMetaValue("SERVER_TIME")
                    checkNext = false
                end
            end

            if checkNext then
                if
                    (not from or from == ItemFrom.BAG or from == ItemFrom.HERO_BAG) and
                        SL:GetMetaValue("ITEM_DATA_BY_MAKEINDEX", MakeIndex, from == ItemFrom.HERO_BAG)
                then
                    time = time - SL:GetMetaValue("SERVER_TIME")
                    checkNext = false
                end
            end

            if checkNext then
                --仓库
                if (not from or from == ItemFrom.STORAGE) and SL:GetMetaValue("STORAGE_DATA_BY_MAKEINDEX", MakeIndex) then
                    time = time - SL:GetMetaValue("SERVER_TIME")
                    checkNext = false
                end
            end

            if checkNext then --最后还是还检测  说明是不变的倒计时
                time = time - (itemData.getServerTime or 0)
            end
        elseif itemData.Need == 103 or itemData.Need == 104 then
            if from ~= ItemFrom.STORAGE then --仓库不刷新
                time = time - SL:GetMetaValue("SERVER_TIME")
            else
                time = time - (itemData.getServerTime or 0)
            end
        end
    else
        if onEquip then
            time = time - SL:GetMetaValue("SERVER_TIME")
        end
    end

    local str = string.format("%s：%s", type == 1 and "限时装备" or "限时道具", SL:TimeFormatToStr(time))

    return str
end

--来源
function ItemTips.GetSrcStr(src)
    if not src or not next(src) then
        return nil
    end
    local titleName = ItemTips._showTitleList[4] and ItemTips._showTitleList[4].name or "[物品来源]："
    local titleColor = ItemTips._showTitleList[4] and ItemTips._showTitleList[4].color or 154
    local str = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(titleColor), titleName) .. "<br>"

    local map = src[1]
    local srcName = src[2]
    local userName = src[3]
    local time = src[4]

    if map and string.len(map) > 0 then
        str = str .. string.format("<font color='%s'>%s：%s</font><br>", SL:GetHexColorByStyleId(251), "地图", map)
    end
    if srcName and string.len(srcName) > 0 then
        str = str .. string.format("<font color='%s'>%s：%s</font><br>", SL:GetHexColorByStyleId(251), "出处", srcName)
    end
    if userName and string.len(userName) > 0 then
        str = str .. string.format("<font color='%s'>%s：%s</font><br>", SL:GetHexColorByStyleId(251), "角色", userName)
    end
    if time and string.len(time) > 0 then
        local date = os.date("*t", time)
        local timeStr = string.format("%d-%02d-%02d %02d:%02d:%02d", date.year, date.month, date.day, date.hour, date.min, date.sec)
        str = str .. string.format("<font color='%s'>%s：%s</font><br>", SL:GetHexColorByStyleId(251), "时间", timeStr)
    end

    return str
end

--职业等级限制
function ItemTips.GetLimitStr(itemData, from)
    local str = nil
    if itemData.StdMode == 4 then
        local bagUse = true
        local job = SL:GetMetaValue("JOB")
        local needJob = itemData.Shape or 0
        -- 内功等级 （1 怒之 2 静之）
        local needNGLV = itemData.Source == 1 or itemData.Source == 2
        local conditionStr = "需要职业：%s"
        local jobName = "通用"
        local level = _IsHero and SL:GetMetaValue("H.LEVEL") or SL:GetMetaValue("LEVEL")
        if needNGLV then
            level = _IsHero and SL:GetMetaValue("H.INTERNAL_LEVEL") or SL:GetMetaValue("INTERNAL_LEVEL")
        end
        local newMeetJob = nil
        local jobNameList = {
            [1] = "战士",
            [2] = "法师",
            [3] = "道士"
        }
        if (needJob >= 0 and needJob <= 2) then --人物
            conditionStr = "人物职业：%s"
            jobName = jobNameList[1 + needJob]
        elseif needJob >= 3 and needJob <= 5 then --英雄
            job = SL:GetMetaValue("H.JOB")
            needJob = needJob - 3
            conditionStr = "英雄职业：%s"
            jobName = jobNameList[1 + needJob]
            level = needNGLV and SL:GetMetaValue("H.INTERNAL_LEVEL") or SL:GetMetaValue("H.LEVEL")
            bagUse = false
        elseif needJob == 6 then --合击技能
            --0=战士,1=法师,2=道士,99=全职业
            local needJobCondition = {
                [60] = {0, 0},
                [61] = {0, 2},
                [62] = {0, 1},
                [63] = {2, 2},
                [64] = {2, 1},
                [65] = {1, 1}
            }
            newMeetJob = false
            local heroJob = SL:GetMetaValue("H.JOB")
            local newCondition = needJobCondition[itemData.AniCount]
            if newCondition then
                if newCondition[1] == job and newCondition[2] == heroJob then
                    newMeetJob = true
                end
                local jobColor = newCondition[1] == job and "#FFFFFF" or "#FF0500"
                local heroJobColor = newCondition[2] == heroJob and "#FFFFFF" or "#FF0500"
                local str = "<font color='%s' size='%s'>%s</font>+<font color='%s' size='%s'>%s</font>"
                local fontSize = _setFontSize or _DefaultFSize
                jobName =
                    string.format(
                    str,
                    jobColor,
                    fontSize,
                    jobNameList[1 + newCondition[1]],
                    heroJobColor,
                    fontSize,
                    jobNameList[1 + newCondition[2]]
                )
            end
            level = math.min(SL:GetMetaValue("H.LEVEL"), SL:GetMetaValue("LEVEL"))
        end
        jobName = string.format(conditionStr, jobName)
        local meetJob = needJob == 99 or needJob == job
        if newMeetJob ~= nil then
            meetJob = newMeetJob
        end
        if from == ItemFrom.HERO_BAG then
            bagUse = true
        end

        local jobStr =
            string.format(
            "<font color='%s'>%s</font>",
            bagUse and meetJob and "#FFFFFF" or "#FF0500",
            jobName
        )
        local needLevel = itemData.DuraMax
        local meetLevel = level >= needLevel
        local levelStr =
            string.format(
            "<font color='%s'>%s%s</font>",
            meetLevel and "#FFFFFF" or "#FF0500",
            needNGLV and "需要内功等级：" or "需要等级：",
            needLevel
        )

        str = jobStr .. "<br>" .. levelStr
    end

    return str
end

--聚灵珠消耗
function ItemTips.GetJulingCostStr(itemData)
    local str = nil
    if itemData.StdMode == 49 and itemData.AniCount and itemData.AniCount > 0 then
        local moneyId = itemData.AniCount
        local need = itemData.Need
        str = string.format("释放需要花费%s%s", need, SL:GetMetaValue("ITEM_NAME", moneyId))
    end

    return str
end

-- 星级
function ItemTips.GetStarPanel(parent, star)
    if not parent then
        return
    end

    local startNorm = 10 --一行星星数
    local resSpace = 0
    local offY = 0
    local starWid = 20 --星星宽
    local starHei = 20 --星星高
    local startRes = {
        [1] = {img = "res/zh/73.png"},
        [2] = {img = "res/zh/72.png"}
    }

    local starCfg = SL:GetMetaValue("GAME_DATA", "tips_star_custom")
    local modelStrArray = string.split(starCfg or "", "|")
    local modelStr = SL:GetMetaValue("WINPLAYMODE") and (modelStrArray[2] or "") or modelStrArray[1]
    if modelStr and string.len(modelStr) > 0 then
        local cfgArray = string.split(modelStr or "", "#")
        local resType = tonumber(cfgArray[1])
        if resType == 1 or resType == 2 then
            local resPath = string.split(cfgArray[2] or "", "&")
            local resKey = resType == 1 and "img" or "tx"
            for i, v in ipairs(resPath) do
                if v and string.len(v) > 0 then
                    local resP = v
                    if resType == 1 then
                        resP = string.format("%s%s.png", _PathRes, resP)
                    elseif resType == 2 then
                        resP = tonumber(resP) or 0
                    end
                    startRes[i] = {
                        [resKey] = resP
                    }
                end
            end
        end

        if tonumber(cfgArray[3]) then
            resSpace = tonumber(cfgArray[3])
        end
        if tonumber(cfgArray[4]) then
            offY = tonumber(cfgArray[4])
        end
        if tonumber(cfgArray[5]) then
            starWid = tonumber(cfgArray[5])
        end
        if tonumber(cfgArray[6]) then
            starHei = tonumber(cfgArray[6])
        end
    end

    local startNorms = {1, 10, 100, 1000}
    local startCounts = {}

    local starCount = 0 --取星星总数
    for i = #startNorms, 1, -1 do
        local v = startNorms[i]
        if star >= v then
            local count = math.floor(star / v)
            star = star - count * v
            startCounts[#startCounts + 1] = {
                count = count,
                res = startRes[i] or (i > 1 and startRes[2] or startRes[1])
            }
            starCount = starCount + count
        end
    end

    local colCount = math.min(starCount, startNorm)
    local rowCount = math.ceil(starCount / startNorm)
    local panelSize = {
        width = colCount * starWid + (colCount - 1) * resSpace,
        height = rowCount * starHei + (rowCount - 1) * resSpace
    }
    local panel = GUI:Layout_Create(parent, "star_panel", 0, 0, panelSize.width, panelSize.height)

    local posI = 0
    local row = 1
    for _i, _v in ipairs(startCounts) do
        if _v and _v.res and _v.count > 0 then
            for i = 1, _v.count do
                local resNode = nil
                if _v.res.img then --图片
                    resNode = GUI:Image_Create(panel, string.format("star_img_%s_%s", _i, i), 0, 0, string.gsub(_v.res.img, "\\", "/"))
                    GUI:setAnchorPoint(resNode, 0.5, 0)
                elseif _v.res.tx then --特效
                    resNode = GUI:Effect_Create(panel, string.format("star_sfx_%s_%s", _i, i), 0, 0, 0, _v.res.tx)
                end

                if posI == startNorm then
                    posI = 0
                    row = row + 1
                end

                if resNode then
                    posI = posI + 1
                    local x = posI * starWid * 0.5 + (posI - 1) * starWid * 0.5 + (posI - 1) * resSpace
                    local y = panelSize.height - (row * starHei + (row - 1) * resSpace) + offY
                    GUI:setPosition(resNode, x, y)
                end
            end
        end
    end

    return panel
end

--
function ItemTips.GetHP_MP_Str(itemData)
    if itemData.StdMode == 0 and (itemData.Shape == 0 or itemData.Shape == 1) and string.len(itemData.effectParam) > 0 then
        local str = ""
        local sliceStr = string.split(itemData.effectParam, "#")
        for i = 1, #sliceStr do
            local count = tonumber(sliceStr[i])
            if count and count > 0 then
                if i == 1 then
                    str = str .. string.format("HP +%s<br>", count)
                elseif i == 2 then
                    str = str .. string.format("MP +%s<br>", count)
                end
            end
        end
        return str
    end
    return false
end

-- 获取新套装tips
function ItemTips.GetNewSuitPanel(suit, itemData)
    if not suit or suit == "" then
        return nil
    end

    local suitWidth = screenW / 2 --270

    -- 解析新的颜色规则  未获得颜色#获得颜色   无则使用第一个未获得颜色
    local function GetNewColor(txtStr, colorIdx)
		SL:Print("套装备注 "..txtStr)
        --txtStr = string.gsub(txtStr or "", "<br>", "\n")
        local colorStr = ""
        local showStr = ""
        local txtArray = string.split(txtStr or "", "|")
        if #txtArray > 1 then
            colorStr = txtArray[1] or ""
            for i = 2, #txtArray do
                showStr = showStr .. (txtArray[i] or "")
            end
        else
            showStr = txtStr
        end
        colorIdx = colorIdx or 1
        local colorArry = string.split(colorStr or "", "/")
        if #colorArry <= 1 then
            table.insert(colorArry, 1, 249)
        end
		local color = tonumber(colorArry[colorIdx]) and colorArry[colorIdx] or colorArry[1]

		local colorHex = SL:GetHexColorByStyleId(tonumber(color))

		showStr = string.gsub( showStr, "<br>", "</font><br><font color='".. colorHex .."'>" )

        return tonumber(colorArry[colorIdx]) or tonumber(colorArry[1]), showStr
    end

    -- 检测部位是否存在相应的装备
    local function checkEquipMeet(suitConfig, pos)
        local meet = false
        local equip = nil
        local equipName = nil
        if not _lookPlayer then
            equip = _IsHero and SL:GetMetaValue("H.EQUIP_DATA", pos) or SL:GetMetaValue("EQUIP_DATA", pos)
        else
            equip = SL:GetMetaValue("L.M.EQUIP_DATA", pos)
        end
        local equipsuit = nil
        if equip and equip.suitid and string.len(equip.suitid) > 0 then
            equipsuit = equip.suitid
        end
        if equipsuit then
            local equipSuitArray = string.split(equipsuit, "#")
            for i, v in ipairs(equipSuitArray) do
                if v and string.len(v) > 0 then
                    local posSuitConfig = SL:GetMetaValue("SUITEX_CONFIG", tonumber(v))
                    if
                        posSuitConfig and posSuitConfig[1] and posSuitConfig[1].suittype == suitConfig.suittype and
                            posSuitConfig[1].level >= suitConfig.level
                     then
                        meet = true
                        equipName = equip.originName or equip.Name
                        break
                    end
                end
            end
        end
        return meet, equipName
    end

    -- 获取职业匹配的属性描述
    local job = nil
    if not _lookPlayer then
        job = _IsHero and SL:GetMetaValue("H.JOB") or SL:GetMetaValue("JOB")
    else
        job = SL:GetMetaValue("L.M.JOB")
    end
    local function GetJobDesc(desc)
        if not desc or desc == "" then
            return
        end
        local returnStr = ""
        local descs = string.split(desc or "", "&")
        for i, _str in ipairs(descs) do
            local strs = string.split(_str, "#")
            if strs[2] then
                local jobNum = tonumber(strs[1])
                if jobNum == 3 or (job and jobNum == job) then
                    returnStr = returnStr .. (strs[2] or "")
                end
            else
                returnStr = returnStr .. (strs[1] or "")
            end
        end
        return returnStr
    end

    local posCheckSwitch = tonumber(SL:GetMetaValue("GAME_DATA", "suitCheckPos")) == 1 --做个开关， 是由装备位还是装备名作为检测key（默认是装备名）
    local suitConfigs = SL:GetMetaValue("SUITEX_CONFIG", tonumber(suit))
    local suitStr = ""
    if suitConfigs and next(suitConfigs) then
        for cfgIdx, suitConfig in ipairs(suitConfigs) do
            if suitConfig and next(suitConfig) then
                local suitCount = suitConfig.num
                local meetCount = 0
                local equopshowArray = string.split(suitConfig.equopshow or "", "|")
                local equipShowColorStr = ""
                local equipShowStr = equopshowArray[1] or ""
                if #equopshowArray > 1 then
                    equipShowColorStr = equopshowArray[1] or ""
                    if equipShowColorStr and equipShowColorStr ~= "" then
                        equipShowColorStr = equipShowColorStr .. "|"
                    end
                    equipShowStr = equopshowArray[2] or ""
                end
                local equipShow = string.split(equipShowStr or "", "#")
                local equipPos = string.split(suitConfig.equipid or "", "#")
                local showEquipIdx = 1
                local checkIndex = 1
                local meetEquipShow = {}
                local tempMeetEquipShowCount = {}
                local isDistinct = suitConfig.distinct == 1 --(部位5 6、 7 8检测去除一个检测)
                local cullingCheckPos = {} --去除检测的部位做个标记

                for i, pos in ipairs(equipPos) do
                    pos = tonumber(pos)
                    if pos and not cullingCheckPos[pos] then
                        local nextCheckPos = nil
                        if isDistinct then
                            if pos == 5 then
                                nextCheckPos = 6
                            elseif pos == 6 then
                                nextCheckPos = 5
                            elseif pos == 7 then
                                nextCheckPos = 8
                            elseif pos == 8 then
                                nextCheckPos = 7
                            end
                        end

                        if nextCheckPos then
                            cullingCheckPos[nextCheckPos] = true
                        end

                        local meet, equipName = checkEquipMeet(suitConfig, pos)

                        if not meet and nextCheckPos then
                            meet, equipName = checkEquipMeet(suitConfig, nextCheckPos)
                        end

                        if meet then
                            meetCount = meetCount + 1
                        end
                        if not suitConfig.num then
                            suitCount = suitCount + 1
                        end

                        if equipName then
                            local meetKey = posCheckSwitch and i or equipName --是用下标做key,或者道具名
                            meetEquipShow[meetKey] = meet
                            if meet then
                                tempMeetEquipShowCount[meetKey] = (tempMeetEquipShowCount[meetKey] or 0) + 1
                            end
                        end
                    end
                end

                for i, showStr in ipairs(equipShow) do
                    if showStr and showStr ~= "" then
                        local meetKey = posCheckSwitch and i or showStr --是用下标做key,或者道具名
                        local meet = meetEquipShow[meetKey]

                        if tempMeetEquipShowCount[meetKey] then
                            if meet and tempMeetEquipShowCount[meetKey] <= 0 then
                                meet = false
                            end
                            tempMeetEquipShowCount[meetKey] = tempMeetEquipShowCount[meetKey] - 1
                        end

                        showStr = equipShowColorStr .. showStr
                        local color, showShowStr = GetNewColor(showStr, meet and 2 or 1)
                        local size = SL:GetSizeByStyleId(color)
                        local colorHex = SL:GetHexColorByStyleId(color)
                        local showStrFormat = string.format("<font color='%s' size='%s'>%s</font><br>", colorHex, size, showShowStr)
                        suitStr = suitStr .. showStrFormat
                    end
                end

                local titleStr = suitConfig.name or ""
                if titleStr and string.len(titleStr) > 0 then
                    local color, showTitle = GetNewColor(titleStr, meetCount >= suitCount and 2 or 1)
                    local size = SL:GetSizeByStyleId(color)
                    local colorHex = SL:GetHexColorByStyleId(color)
                    local mCount = meetCount > suitCount and suitCount or meetCount
                    local showTitleFormat =
                        string.format(
                        "<font color='%s' size='%s'>%s (%s/%s)</font><br>",
                        colorHex,
                        size,
                        showTitle,
                        mCount,
                        suitCount
                    )
                    suitStr = showTitleFormat .. suitStr
                end
			
				local descStr = GetJobDesc(suitConfig.desc)
                if descStr and string.len( descStr ) > 0 then
                    local color,showDescStr = GetNewColor(descStr,meetCount >= suitCount and 2 or 1)
					local colorHex = SL:GetHexColorByStyleId(color)

					local showDescStrFormat = string.format("<font color='%s'>%s</font>","#FFFF00","  <br>[激活属性]<br>") .. string.format("<font color='%s'>%s</font><br>",colorHex,showDescStr)
					if tonumber(suit) == 80 then --套装id
						showDescStrFormat = string.format("<font color='%s'>%s</font>","#FFFF00","  <br>[触发神技]：十步一杀<br>") .. string.format("<font color='%s'>%s</font><br>",colorHex,showDescStr)
					elseif  tonumber(suit) == 81 then --套装id
						showDescStrFormat = string.format("<font color='%s'>%s</font>","#FFFF00","  <br>[触发神技]：冰霜群雨<br>") .. string.format("<font color='%s'>%s</font><br>",colorHex,showDescStr)
					elseif  tonumber(suit) == 82 then --套装id
						showDescStrFormat = string.format("<font color='%s'>%s</font>","#FFFF00","  <br>[触发神技]：死亡之眼<br>") .. string.format("<font color='%s'>%s</font><br>",colorHex,showDescStr)				
					elseif  tonumber(suit) == 83 then --套装id
						showDescStrFormat = string.format("<font color='%s'>%s</font>","#FFFF00","  <br>[激活复活属性]<br>") .. string.format("<font color='%s'>%s</font><br>",colorHex,showDescStr)			
					elseif  tonumber(suit) == 84 then --套装id
						showDescStrFormat = string.format("<font color='%s'>%s</font>","#FFFF00","  <br>[激活护身属性]<br>") .. string.format("<font color='%s'>%s</font><br>",colorHex,showDescStr)				
					end
                    suitStr = suitStr .. showDescStrFormat
					
                end
            end
        end
    else
        return
    end

    if string.len(suitStr or "") == 0 then
        return
    end

    local tipsPanel, listView = ItemTips.GetNewTipsPanel("new_suit" .. (itemData.MakeIndex or "_") .. suit)

    if SL:GetMetaValue("WINPLAYMODE") then
        local topSpace = ItemTips.CreateIntervalPanel(listView, 1)
    end
    local rich_suit = GUI:RichText_Create(listView, "rich_suit", 0, 0, suitStr or "", suitWidth - 20, _setFontSize or _DefaultFSize, "#28EF01", vspace, nil, fontPath)
    GUI:setAnchorPoint(rich_suit, 0, 0)

    local size = GUI:getContentSize(rich_suit)
    local richWidth = size.width

    GUI:ListView_doLayout(listView)
    local innH = GUI:ListView_getInnerContainerSize(listView).height
    local listH = math.min(innH, _TipsMaxH)
    GUI:setContentSize(listView, richWidth, listH)
    GUI:setPosition(listView, 10, 10)
    GUI:setContentSize(tipsPanel, richWidth + 20, listH + 20)

    if innH > listH then
        GUI:setTouchEnabled(listView, true)
        ItemTips.SetTipsScrollArrow(tipsPanel, listView, innH, listH)
    end

    if ssrGlobal_ItemTipsSuitPanelEx then
        local widget = ssrGlobal_ItemTipsSuitPanelEx(itemData, tipsPanel)
        if widget and not tolua.isnull(widget) then
            GUI:addChild(tipsPanel, widget)
        end
    end
end

-- 获取老套装tips
function ItemTips.GetSuitPanel(suitConfig, itemData, idx)
    if ItemTips._diff then
        return
    end

    local tipsPanel, listView = ItemTips.GetNewTipsPanel("suit" .. (itemData.MakeIndex or "_") .. (idx or 0))

    local panel = GUI:Layout_Create(listView, "panel_suit", 0, 0, 0, 0)
    local suitWidth = screenW / 2

    local richWidth = 0
    local index = 0
    local heights = {}
    local interval = _setVspace or 0

    -- 解析新的颜色规则  未获得颜色#获得颜色   没有使用第一个未获得颜色
    local function GetNewColor(colorStr, colorIdx)
        colorIdx = colorIdx or 1
        local colorArry = string.split(colorStr or "", "#")
        if #colorArry <= 1 then
            table.insert(colorArry, 1, 249)
        end
        return tonumber(colorArry[colorIdx]) or tonumber(colorArry[1])
    end

    -- 解析新的/FCOLOR颜色规则  未获得颜色#获得颜色   fColorIdx: 颜色的下标
    local function GetNewFColor(textStr, fColorIdx)
        textStr = textStr or ""
        fColorIdx = fColorIdx or 1
        local newTextStr = ""
        while true do
            local startIndex, endIndex = string.find(textStr, "%b<>")
            if startIndex and endIndex then
                if startIndex > 1 then
                    newTextStr = newTextStr .. string.sub(textStr, 1, startIndex - 1)
                end

                local newFColorStr = string.sub(textStr, startIndex, endIndex)
                local cStart, cEnd = string.find(newFColorStr, "/FCOLOR=")
                if cStart and cEnd then
                    local colorStr = string.sub(newFColorStr, cEnd + 1, -2)
                    local colorArry = string.split(colorStr or "", "#")
                    newFColorStr = string.sub(newFColorStr, 1, cEnd)
                    if #colorArry <= 1 then
                        table.insert(colorArry, 1, 215)
                    end
                    newFColorStr = newFColorStr .. (tonumber(colorArry[fColorIdx]) and colorArry[fColorIdx] or colorArry[1]) .. ">"
                end

                newTextStr = newTextStr .. newFColorStr

                textStr = string.sub(textStr, endIndex + 1, -1)
            else
                newTextStr = newTextStr .. textStr
                break
            end
        end
        return newTextStr
    end

    local sliceStr = string.split(suitConfig.equipNameStr, "|")
    local sliceName = string.split(sliceStr[1], "/")
    local nameColor = nil
    local name = ""
    local suitCount = tonumber(sliceStr[2]) or 1

    if #sliceName >= 2 then
        if sliceName[1] ~= nil and string.len(sliceName[1]) > 0 then
            nameColor = sliceName[1]
        end
        if sliceName[2] ~= nil and string.len(sliceName[2]) > 0 then
            name = sliceName[2]
        end
    else
        name = sliceName[1]
    end

    --套装部位
    local equipNameStr = ""
    local meetCount = 0
    local sameName = {}
    for i = 3, #sliceStr do
        local equipSlice = string.split(sliceStr[i], "/")
        local equipColor = 150
        local name = ""

        if #equipSlice >= 2 then
            if equipSlice[1] ~= nil and string.len(equipSlice[1]) > 0 then
                equipColor = equipSlice[1]
            end
            if equipSlice[2] ~= nil and string.len(equipSlice[2]) > 0 then
                name = equipSlice[2]
            end
        else
            name = equipSlice[1]
        end

        local meet = false
        local equip = nil
        local equipCount = 0
        sameName[name] = sameName[name] ~= nil and sameName[name] + 1 or 1
        if not _lookPlayer then
            equip = _IsHero and SL:GetMetaValue("H.EQUIP_DATA", name) or SL:GetMetaValue("EQUIP_DATA", name)
        else
            equip = SL:GetMetaValue("L.M.EQUIP_DATA", name)
        end
        if equip then
            equipCount = #equip
            if equipCount >= sameName[name] then
                meet = true
                meetCount = meetCount + 1
            end
        end

        local color = GetNewColor(equipColor, meet and 2 or 1)
        local size = SL:GetSizeByStyleId(color)
        local colorHex = SL:GetHexColorByStyleId(color)
        equipNameStr = string.format("%s<font color='%s' size='%s'>%s</font>", equipNameStr, colorHex, size, name)
        equipNameStr = equipNameStr .. (i ~= #sliceStr and "<br>" or "")
    end

    if nameColor then
        nameColor = GetNewColor(nameColor, meetCount >= suitCount and 2 or 1)
    end

    nameColor = nameColor or 250
    local nSize = SL:GetSizeByStyleId(nameColor)
    local nColorHex = SL:GetHexColorByStyleId(nameColor)
    local suitNameStr =
        string.format(
        "<font color='%s' size='%s'>%s(%s/%s)</font><br>",
        nColorHex,
        nSize,
        name,
        math.min(meetCount, suitCount),
        suitCount
    )
    local descs = GUIFunction:GetParseItemDesc(suitNameStr .. equipNameStr)
    if descs and descs.desc and next(descs.desc) then --这里不支持top  bottom
        for i, v in pairs(descs.desc) do
            if v.text then
                index = index + 1
                local label_posName = GUI:RichText_Create(panel, "name_text_" .. index, 0, 0, v.text or "", suitWidth - 20, _setFontSize or SL:GetSizeByStyleId(255), SL:GetHexColorByStyleId(255), vspace, nil, fontPath)
                GUI:setAnchorPoint(label_posName, 0, 0)
                GUI:setTag(label_posName, index)
                local size = GUI:getContentSize(label_posName)
                heights[index] = size.height + interval
                richWidth = math.max(richWidth, size.width)
            elseif v.res then
                index = index + 1
                local img = ItemTips.GetNodeImage(panel, v, index)
                if img then
                    GUI:setTag(img, index)
                    local size = GUI:getContentSize(img)
                    heights[index] = size.height + interval
                    richWidth = math.max(richWidth, size.width)
                end
            end
        end
    end

    local attrDescs = GUIFunction:GetParseItemDesc(suitConfig.equipAttStr)
    if attrDescs and attrDescs.desc and next(attrDescs.desc) then --这里不支持top  bottom
        for i, v in pairs(attrDescs.desc) do
            if v.text then
                index = index + 1
                local label_posName = GUI:RichTextFCOLOR_Create(panel, "desc_text_" .. index, 0, 0, v.text or "", suitWidth - 20, _setFontSize or _DefaultFSize, SL:GetColorByStyleId(255), vspace, nil, fontPath)
                GUI:setAnchorPoint(label_posName, 0, 0) 
                GUI:setTag(label_posName, index)
                local size = GUI:getContentSize(label_posName)
                heights[index] = size.height + interval
                richWidth = math.max(richWidth, size.width)
            elseif v.res then
                index = index + 1
                local img = ItemTips.GetNodeImage(panel, v, index)
                if img then
                    GUI:setTag(img, index)
                    local size = GUI:getContentSize(img)
                    heights[index] = size.height + interval
                    richWidth = math.max(richWidth, size.width)
                end
            end
        end
    end

    local height = 0
    for _, v in pairs(heights) do
        height = height + v
    end

    local curH = height
    for i = 1, index do
        local label = GUI:getChildByTag(panel, i)
        if label then
            curH = curH - heights[i]
            GUI:setPositionY(label, math.floor(curH))
        end
    end

    GUI:setContentSize(panel, richWidth, height)
    GUI:ListView_doLayout(listView)

    local innH = GUI:ListView_getInnerContainerSize(listView).height
    local listH = math.min(innH, _TipsMaxH)
    GUI:setContentSize(listView, richWidth, listH)
    GUI:setPosition(listView, 10, 10)
    GUI:setContentSize(tipsPanel, richWidth + 20, listH + 20)

    if innH > listH then
        GUI:setTouchEnabled(listView, true)
        ItemTips.SetTipsScrollArrow(tipsPanel, listView, innH, listH)
    end

    if ssrGlobal_ItemTipsSuitPanelEx then
        local widget = ssrGlobal_ItemTipsSuitPanelEx(itemData, tipsPanel)
        if widget and not tolua.isnull(widget) then
            GUI:addChild(tipsPanel, widget)
        end
    end
end

function ItemTips.AddTipLayout(parent, name)
    local node = GUI:Widget_Create(parent, "widget_" .. name, 0, 0)
    GUI:LoadExport(node, "item/item_tips")
    local ui = GUI:ui_delegate(node)
    local tipsPanel = ui.tipsLayout
    GUI:removeFromParent(tipsPanel)
    GUI:setName(tipsPanel, name)
    GUI:addChild(parent, tipsPanel)
    GUI:removeFromParent(node)
    return tipsPanel
end

-- 获取新tips模块
function ItemTips.GetNewTipsPanel(tag)
    _PanelNum = _PanelNum + 1
    local childs = ItemTips._panelListSubItems
    local lastWidget = childs[#childs]
    local x = GUI:getPositionX(lastWidget)
    local y = GUI:getPositionY(lastWidget)
    local wid = GUI:getContentSize(lastWidget).width

    local tipsPanel = ItemTips.AddTipLayout(ItemTips._PList, "tips_" .. tag)
    GUI:setPosition(tipsPanel, wid + x, 0)
    GUI:setTouchEnabled(tipsPanel, false)
    GUI:setAnchorPoint(tipsPanel, 0, 1)
    table.insert(ItemTips._panelListSubItems, tipsPanel)

    local listView = GUI:ListView_Create(tipsPanel, "listView_" .. tag, 0, 0, 0, 0, 1)
    GUI:ListView_setClippingEnabled(listView, true)
    GUI:ListView_setItemsMargin(listView, _setVspace or 0)
    GUI:setTouchEnabled(listView, false)

    return tipsPanel, listView
end

--设置箭头
function ItemTips.SetTipsScrollArrow(tipsPanel, listView, innH, listH)
    local maxWidth = GUI:getContentSize(tipsPanel).width
    -- 底部箭头
    local bottomArrowImg = GUI:Image_Create(tipsPanel, "bottom_arrow", maxWidth / 2, 15, "res/public/btn_szjm_01_1.png")
    GUI:setTouchEnabled(bottomArrowImg, true)
    GUI:setAnchorPoint(bottomArrowImg, 0.5, 0.5)
    GUI:setRotation(bottomArrowImg, -90)
    local action =
        GUI:ActionRepeatForever(
        GUI:ActionSequence(GUI:ActionFadeTo(0.2, 125), GUI:ActionFadeTo(0.2, 255), GUI:DelayTime(0.3))
    )
    GUI:runAction(bottomArrowImg, action)

    -- 顶部箭头
    local topArrowImg = GUI:Image_Create(tipsPanel, "top_arrow", maxWidth / 2, listH - 15, "res/public/btn_szjm_01_1.png")
    GUI:setTouchEnabled(topArrowImg, true)
    GUI:setAnchorPoint(topArrowImg, 0.5, 0.5)
    GUI:setRotation(topArrowImg, 90)
    GUI:runAction(topArrowImg, action)

    local function refreshArrow()
        local innerPos = GUI:ListView_getInnerContainerPosition(listView)
        bottomArrowImg:setVisible(innerPos.y < innH and innerPos.y < 0)
        topArrowImg:setVisible(innerPos.y > listH - innH or innerPos.y >= 0)
    end

    refreshArrow()

    local bottomEvent = function()
        if innH > listH and not tolua.isnull(listView) then
            local innerPos      = GUI:ListView_getInnerContainerPosition(listView)
            local vHeight       = innH - listH
            local percent       = (vHeight + innerPos.y + 50) / vHeight * 100
            percent             = math.min(math.max(0, percent), 100)
            GUI:ListView_scrollToPercentVertical(listView, percent, 0.03, false)
            refreshArrow()
        end
    end

    local topEvent = function()
        if innH > listH and not tolua.isnull(listView) then
            local innerPos      = GUI:ListView_getInnerContainerPosition(listView)
            local vHeight       = innH - listH
            local percent       = (vHeight + innerPos.y - 50) / vHeight * 100
            percent             = math.min(math.max(0, percent), 100)
            GUI:ListView_scrollToPercentVertical(listView, percent, 0.03, false)
            refreshArrow()
        end
    end

    GUI:addOnClickEvent(bottomArrowImg, function()
        bottomEvent()
    end)

    GUI:addOnClickEvent(topArrowImg, function()
        topEvent()
    end)

    if SL:GetMetaValue("WINPLAYMODE") then
        ItemTips._topScrollEvent      = topEvent
        ItemTips._bottomScrollEvent   = bottomEvent
    end
    SL:schedule(bottomArrowImg, refreshArrow, 0.1)
end

-- 衣服、武器内观预览
function ItemTips.GetModelPanel(itemData)
    local isShow = tonumber(SL:GetMetaValue("GAME_DATA", "itemShowModel"))
    if not isShow or isShow ~= 1 then
        return
    end

    if ItemTips._diff or _isSelf or not itemData or not itemData.StdMode then
        return nil
    end
    local StdMode = itemData.StdMode
    local pos = SL:GetMetaValue("EQUIP_POS_BY_STDMODE", StdMode)
    if not pos then
        return nil
    end

    local preViewPos = {
        [0] = 0,
        [1] = 1,
        [17] = 17,
        [18] = 18
    }

    if not preViewPos[pos] then
        return nil
    end

    local sex = SL:GetMetaValue("SEX")
    local job = SL:GetMetaValue("JOB")
    local feature = {}

    local data = SL:GetMetaValue("FEATURE")
    local hairID = data and data.hairID
    local normalDress = sex == 0 and 60 or 80

    if pos == 0 or pos == 17 then --衣服
        --衣服
        sex = 0 and StdMode == 10 and 0 or 1
        feature.clothID = itemData.Looks
        feature.clothEffectID = itemData.sEffect
        feature.noHead = itemData.show == 1
    elseif pos == 1 or pos == 18 then --武器
        feature.weaponID = itemData.Looks
        feature.weaponEffectID = itemData.sEffect
        feature.clothID = normalDress
    end

    if not next(feature) then
        return nil
    end

    feature.hairID = hairID
    _PanelNum = _PanelNum + 1

    local size = {width = 200, height = 260}
    local tipsPanel = ItemTips.GetNewTipsPanel("model")
    GUI:setContentSize(tipsPanel, size.width, size.height)

    local model = GUI:UIModel_Create(tipsPanel, "model", size.width / 2, size.height / 2, sex, feature, nil, {})
end

function ItemTips.RefreshItemPosition(tips, listView, size)
    size = size or {}
    local listHeight = GUI:ListView_getInnerContainerSize(listView).height
    if listHeight > _TipsMaxH then
        listHeight = _TipsMaxH - 20
    end
    local listWidth = size.width or 0
    local maxWidth = size.width or 0
    local itemsW = {}
    local isAdjustWidth = false
    for i = 1, ItemTips.itemCount do
        local item = GUI:getChildByTag(ItemTips.contentPanel, i)
        if item then
            itemsW[i] = GUI:getContentSize(item)
            maxWidth = math.max(maxWidth, GUI:getContentSize(item).width)
            if not isAdjustWidth then
                if item._itemWid then
                    isAdjustWidth = maxWidth == item._itemWid
                else
                    isAdjustWidth = maxWidth == GUI:getContentSize(item).width
                end
            end
        end
    end

    local value = SL:GetMetaValue("GAME_DATA", "tipsButtonOut")
    local isTipsOutSideBtn = tonumber(value) and tonumber(value) == 1

    if not isTipsOutSideBtn then
        local index = 1
        local movePosX, movePosY = 0, 0
        if SL:GetMetaValue("WINPLAYMODE") then
            movePosX, movePosY = 17, 7
        end
        for i = 1, 3 do
            local btn = GUI:getChildByName(tips, "BTN_" .. i)
            if btn then
                local btnSz = GUI:getContentSize(btn)
                if isAdjustWidth then
                    isAdjustWidth = false
                    maxWidth = maxWidth + btnSz.width
                end
                local posX = maxWidth - btnSz.width / 2 - 18 - 5
                local posY = listHeight - (index - 1) * 50 - btnSz.height / 2 + movePosY
                local itemSzW = 0
                if index > 1 then
                    local itemSzW1 = itemsW[(index - 1) * 2] and itemsW[(index - 1) * 2].width or 0
                    local itemSzW2 = itemsW[(index - 1) * 2 + 1] and itemsW[(index - 1) * 2 + 1].width or 0
                    itemSzW = math.max(itemSzW1, itemSzW2)
                else
                    itemSzW = itemsW[index] and itemsW[index].width or 0
                end
                if itemSzW > posX then
                    local newListsWidth = itemSzW + btnSz.width + 10
                    if newListsWidth > listWidth then
                        listWidth = newListsWidth
                        posX = listWidth - btnSz.width / 2 - 18 - 5
                        if listWidth > maxWidth then
                            maxWidth = listWidth
                        end
                        for idx = index - 1, 1, -1 do
                            local btn1 = GUI:getChildByName(tips, "BTN_" .. idx)
                            GUI:setPositionX(btn1, posX + movePosX)
                        end
                    end
                end
                GUI:setPosition(btn, posX + movePosX + rightSpace, posY)
                index = index + 1
            end
        end
    end

    local tipExtraWidth = isTipsOutSideBtn and 0 or 20

    listWidth = math.max(listWidth, maxWidth)

    GUI:setContentSize(listView, listWidth, listHeight)
    GUI:setContentSize(tips, listWidth + tipExtraWidth + rightSpace, listHeight + 20)

    if isTipsOutSideBtn then
        local heightOffY = 0
        for i = 1, 3 do
            local btn = GUI:getChildByName(tips, "BTN_" .. i)
            if btn then
                local btnSz = GUI:getContentSize(btn)
                GUI:setPosition(btn, listWidth + rightSpace, heightOffY)
                heightOffY = heightOffY + btnSz.height
            end
        end
    end
end

function ItemTips.GetTipsAnchorPoint(widget, pos, ancPoint)
    ancPoint = ancPoint or GUI:getAnchorPoint(widget)
    local size = GUI:getContentSize(widget)
    local visibleSize = {width = screenW, height = screenH}
    local outScreenX = false
    local outScreenY = false
    if pos.y + size.height * ancPoint.y > visibleSize.height then
        ancPoint.y = 1
        outScreenY = true
    end
    if pos.y - size.height * ancPoint.y < 0 then
        if outScreenY then
            ancPoint.y = 0.5
            pos.y = visibleSize.height / 2
        else
            ancPoint.y = 0
        end
    end

    if pos.x + size.width * (1 - ancPoint.x) > visibleSize.width then
        ancPoint.x = 1
        outScreenX = true
    end
    if pos.x - size.width * ancPoint.x < 0 then
        if outScreenX then
            ancPoint.x = 0.5
            pos.x = visibleSize.width / 2
        else
            ancPoint.x = 0
        end
    end
    return ancPoint, pos
end

function ItemTips.ResetEquipPosition()
    if not ItemTips._PList then
        return
    end

    local space = 0
    local width = 0
    local maxHeight = 0
    for _, v in pairs(GUI:getChildren(ItemTips._PList)) do
        local size = GUI:getContentSize(v)
        width = width + size.width + space
        maxHeight = math.max(maxHeight, size.height)
    end

    GUI:setContentSize(ItemTips._PList, width, maxHeight)
    width = 0
    for _, v in pairs(ItemTips._panelListSubItems) do
        GUI:setPositionX(v, width)
        local size = GUI:getContentSize(v)
        width = width + size.width + space
        GUI:setPositionY(v, maxHeight)
    end
    local pos = {
        x = GUI:getPositionX(ItemTips._PList),
        y = GUI:getPositionY(ItemTips._PList)
    }
    local anchorPoint, pos = ItemTips.GetTipsAnchorPoint(ItemTips._PList, pos, ItemTips._data.anchorPoint or {x=0, y=1})
    GUI:setAnchorPoint(ItemTips._PList, anchorPoint.x, anchorPoint.y)
    GUI:setPosition(ItemTips._PList, pos.x, pos.y)
end

local function pushDescItem(desc, descTag)
    if not desc or not ItemTips.contentPanel then
        return
    end
    local movePosY = 0
    if desc and next(desc) then
        local contentSz = GUI:getContentSize(ItemTips.contentPanel)
        for i, v in ipairs(desc) do
            local isadd = true
            if descTag == 1 then
                if v.y and v.y ~= 0 then
                    isadd = false
                    v.y = contentSz.height - v.y
                    v.isTop = true
                    table.insert(topDesY, v)
                end
            end

            if isadd then
                if v.isTop then
                    v.y = contentSz.height - v.y
                    GUI:setContentSize(ItemTips.contentPanel, contentSz)
                end

                if v.newLine then
                    local lineH = v.height or 0
                    lineH = lineH > 0 and lineH or _DefaultSpace
                    local linePanel = ItemTips.CreateIntervalPanel(ItemTips.contentPanel, lineH, true)
                    linePanel:setPosition(v.x or 0, v.y or 0)
                    ItemTips.PushItem(ItemTips.contentPanel, linePanel)
                elseif v.text then
                    rich_att_num = rich_att_num + 1
                    local textSize = _setFontSize or _DefaultFSize
                    if v.fontsize and v.fontsize > 0 then
                        textSize = v.fontsize
                    end
                    local rich_att = GUI:RichTextFCOLOR_Create(ItemTips.contentPanel, string.format("rich_att_%s", rich_att_num), math.floor(v.x or 0), math.floor(v.y or 0), v.text, ItemTips._isItem and 420 or (_TotalWidth - 20), textSize, "#FFFFFF", vspace, nil, fontPath)
                    ItemTips.PushItem(ItemTips.contentPanel, rich_att)
                    if SL:GetMetaValue("WINPLAYMODE") then
                        movePosY = movePosY - 1
                    end
                elseif v.res then
                    desc_img_num = desc_img_num + 1
                    local img = ItemTips.GetNodeImage(ItemTips.contentPanel, v, desc_img_num)
                    if img then
                        ItemTips.PushItem(ItemTips.contentPanel, img)
                        if v.isSFX and SL:GetMetaValue("WINPLAYMODE") then --pc与移动的宽高差导致的位置进行调整
                            local imgSz = GUI:getContentSize(img)
                            local posX = GUI:getPositionX(img)
                            local posY = GUI:getPositionY(img)
                            GUI:setPosition(img, math.floor(posX), math.floor(posY - imgSz.height / 2 + movePosY))
                        end
                    end
                end
            end
        end
    end
end

function ItemTips.AddFrameEffect(parent, itemDescs)
    -- 特效根据配置宽高进行缩放
    local function animScale(anim)
        if anim and anim.isSFX then --isSFX判断是否是特效
            local scaleX, scaleY = 1, 1
            if anim.configW and anim.configW > 0 then
                scaleX = anim.configW
            end
            if anim.configH and anim.configH > 0 then
                scaleY = anim.configH
            end
            --外边框的宽、高缩放
            GUI:setScaleX(anim, scaleX)
            GUI:setScaleY(anim, scaleY)

            if anim.order and anim.order == 0 then
                GUI:setLocalZOrder(anim, -1)
            end
        end
    end

    local function addFrameDesc(desc, frameChilds)
        if desc and next(desc) then
            for i, v in ipairs(desc) do
                if v.newLine then
                    local lineH = v.height or 0
                    lineH = lineH > 0 and lineH or _DefaultSpace
                    local linePanel = ItemTips.CreateIntervalPanel(parent, lineH, true)
                    linePanel:setPosition(v.x or 0, v.y or 0)

                    if frameChilds then
                        table.insert(frameChilds, linePanel)
                    end
                elseif v.text then
                    rich_att_num = rich_att_num + 1
                    local textSize = _setFontSize or _DefaultFSize
                    if v.fontsize and v.fontsize > 0 then
                        textSize = v.fontsize
                    end
                    local rich_att = GUI:RichTextFCOLOR_Create(parent, string.format("rich_att_%s", rich_att_num), math.floor(v.x or 0), math.floor(v.y or 0), v.text, ItemTips._isItem and 420 or (_TotalWidth - 20), textSize, "#FFFFFF", vspace, nil, fontPath)
                    if frameChilds then
                        table.insert(frameChilds, rich_att)
                    end
                elseif v.res then
                    desc_img_num = desc_img_num + 1
                    local img = ItemTips.GetNodeImage(parent, v, desc_img_num)
                    if img and frameChilds then
                        img.isSFX   = v.isSFX
                        img.configW = v.width
                        img.configH = v.height
                        img.order   = v.frameOrder
                        table.insert(frameChilds, img)
                    end
                end
            end
        end
    end

    -- 框体特效
    local frameTopDesc = itemDescs.frame_top_desc
    if frameTopDesc and next(frameTopDesc) then
        local frameChilds = {}
        addFrameDesc(frameTopDesc, frameChilds)
        local tipsPanelSz = GUI:getContentSize(parent)
        for i, children in ipairs(frameChilds) do
            if children then
                local x = GUI:getPositionX(children)
                local y = GUI:getPositionY(children) + tipsPanelSz.height
                GUI:setPosition(children, x, y)
                animScale(children)
            end
        end
    end

    local frameBottomDesc = itemDescs.frame_bottom_desc
    if frameBottomDesc then
        local frameChilds = {}
        addFrameDesc(frameBottomDesc, frameChilds)
        for i, children in ipairs(frameChilds) do
            if children then
                animScale(children)
            end
        end
    end
end

-- 滚轮滚动     data: {x,y} 滚轮的方向
function ItemTips.OnMouseScroll(data)
    if data and data.y then
        if ItemTips._topScrollEvent and data.y == -1 then
            ItemTips._topScrollEvent()
        elseif ItemTips._bottomScrollEvent and data.y == 1 then
            ItemTips._bottomScrollEvent()
        end
    end
end

-- 关闭界面
function ItemTips.OnClose()
    SL:UnRegisterLUAEvent(LUA_EVENT_ITEMTIPS_MOUSE_SCROLL, "ItemTips")
end

------------  装备tips  ------------------------------------------------
function ItemTips.CreateEquipPanel(data, itemData, isWear, panelInsertIndex)
    if not data or not itemData then
        return
    end

    if SL:GetMetaValue("WINPLAYMODE") then
        isWear = false
    end

    ResetDescParam()

    if not ItemTips._PList then
        ItemTips._PList = GUI:Layout_Create(ItemTips._PMainUI, "PList", data.pos.x, data.pos.y, 0, 0)
        GUI:setTouchEnabled(ItemTips._PList, false)
        GUI:setAnchorPoint(ItemTips._PList, 0, 1)
    end

    _PanelNum = _PanelNum + 1
    local richWidth = _TotalWidth - 20
    local maxWidth = 0
    local hh = 0

    local ListBg = ItemTips.AddTipLayout(ItemTips._PList, "ListBg" .. _PanelNum)
    GUI:setPosition(ListBg, 0, 0)
    GUI:setAnchorPoint(ListBg, 0, 1)
    GUI:setTouchEnabled(ListBg, false)

    local index = tonumber(panelInsertIndex) and (tonumber(panelInsertIndex) + 1) or 1
    table.insert(ItemTips._panelListSubItems, index, ListBg)

    local scrollView = GUI:ScrollView_Create(ListBg, "scrollView", 0, 0, 0, 0, 1)
    GUI:ScrollView_setClippingEnabled(scrollView, true)
    GUI:setTouchEnabled(scrollView, false)

    if not SL:GetMetaValue("WINPLAYMODE") then
        GUI:setTouchEnabled(ListBg, true)
        GUI:setTouchEnabled(scrollView, true)
    end

    local contentPanel = GUI:Layout_Create(scrollView, "contentPanel", 0, 0, maxWidth, 1)
    GUI:setAnchorPoint(contentPanel, 0, 0)
    ItemTips.contentPanel = contentPanel

    local color = (itemData.Color and itemData.Color > 0) and itemData.Color or 255
    local name = itemData.Name or ""
    -- 沙巴克标识
    local sbk = nil
    if itemData.AddValues then
        for _,v in pairs(itemData.AddValues) do
            if v.Id == 11 then
                sbk = v.Value
                break
            end
        end
    end
    if sbk and sbk > 0 then
        name = "(*)" .. name
    end

    -- 装备穿戴状态
    if data.diff then
        local rich_equip = GUI:RichText_Create(contentPanel, "r_diff", 0, 0, "[当前身上装备]", richWidth, _TextSize, SL:GetHexColorByStyleId(250), vspace, nil, fontPath)
        ItemTips.PushItem(contentPanel, rich_equip)
        ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
    end

    -- 装备名称
    local nameStr = string.format("<font color='%s' size='%s'>%s</font>", SL:GetHexColorByStyleId(color), 20, name) 
	if SL:GetMetaValue("WINPLAYMODE") then
        local hexColor = SL:GetHexColorByStyleId(color)
        --nameStr = string.format("<shadow color='%s' offsetWidth='0.0' offsetHeight='0.0' blurRadius='0'><font color='%s' size='%s'>%s</font></shadow>", hexColor , hexColor, 14, name) 
		nameStr = string.format("<font color='%s' size='%s'>%s</font>", SL:GetHexColorByStyleId(color), 14, name) 
    end
	
	
    local r_name = GUI:RichText_Create(contentPanel, "r_name", 0, 0, nameStr, richWidth, _TextSize, SL:GetHexColorByStyleId(color), vspace, nil, fontPath)
    ItemTips.PushItem(contentPanel, r_name)
    ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))

    local itemDescs = GUIFunction:GetParseItemDesc(itemData.Desc)
    -- 顶部描述
    local topDescs = itemDescs.top_desc
    if topDescs then
        removeLastLine()
        ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace / 2))
        pushDescItem(topDescs, 1)
        ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
    end

    -- 绑定
    if itemData.BindInfo and string.len(itemData.BindInfo) > 0 then
        local rich_bind = GUI:RichText_Create(contentPanel, "rich_bind", 0, 0, string.format("已绑定[%s]", itemData.BindInfo), richWidth, SL:GetSizeByStyleId(color), SL:GetHexColorByStyleId(color), vspace, nil, fontPath)
        ItemTips.PushItem(contentPanel, rich_bind)
    end

    maxWidth = math.max(maxWidth, GUI:getContentSize(r_name).width)

    -- icon
    local res = SL:GetMetaValue("WINPLAYMODE") and _PathRes .. "1900025000.png" or _PathRes .. "1900025001.png"
    local icon_bg = GUI:Image_Create(contentPanel, "icon_bg", 0, 0, res)
    local size = GUI:getContentSize(icon_bg)
    icon_bg._itemWid = size.width
    local item = GUI:ItemShow_Create(icon_bg, "item_", size.width / 2, size.height / 2, {itemData=itemData, index=itemData.Index, disShowCount=true, notShowEquipRedMask=true})
    GUI:setAnchorPoint(item, 0.5, 0.5)
    ItemTips.PushItem(contentPanel, icon_bg)
    ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))

    -- 投保
    if SL:GetMetaValue("SERVER_OPTIONS", SW_KEY_ITEMTIPS_TOUBAO_SHOW) == 1 then
        local touBaoStr = ItemTips.GetTouBaoDesc(itemData)
        if touBaoStr then
            local rich_tb = GUI:RichText_Create(contentPanel, "rich_tb", 0, 0, touBaoStr, richWidth, _setFontSize or _DefaultFSize , "#FF0500", vspace, nil, fontPath)
            ItemTips.PushItem(contentPanel, rich_tb)
            maxWidth = math.max(maxWidth, GUI:getContentSize(rich_tb).width)
        end
    end

    -- 星级
    if itemData.Star and itemData.Star > 0 then
        local starPanel = ItemTips.GetStarPanel(contentPanel, itemData.Star)
        ItemTips.PushItem(contentPanel, starPanel)
        if starPanel then
            maxWidth = math.max(maxWidth, GUI:getContentSize(starPanel).width)
        end
    end

    local iconMoveY = SL:GetMetaValue("WINPLAYMODE") and -6 or 0
    -- 绑定
    if itemData.Bind and string.len(itemData.Bind) > 0 and SL:GetMetaValue("ITEM_IS_BIND", itemData) then
        local rich_bind = GUI:RichText_Create(GUI:ItemShow_GetLayoutExtra(item), "rich_bind", size.width + 10, size.height + iconMoveY, "已绑定", richWidth, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(color), vspace, nil, fontPath)
        GUI:setAnchorPoint(rich_bind, 0, 1)
        local bindSize = GUI:getContentSize(rich_bind)
        maxWidth = math.max(maxWidth, bindSize.width + size.width + 20)
        icon_bg._itemWid = bindSize.width + size.width + 20
    end

    -- 重量
    if itemData.Weight and itemData.Weight > 0 then
        local str = string.format("重量：%s", itemData.Weight)
        local rich_weight = GUI:RichText_Create(GUI:ItemShow_GetLayoutExtra(item), "rich_weight", size.width + 10, size.height / 2 + iconMoveY, str, richWidth, _setFontSize or _DefaultFSize, "#FFFFFF", vspace, nil, fontPath)
        GUI:setAnchorPoint(rich_weight, 0, 0.5)
        local weightSize = GUI:getContentSize(rich_weight)
        maxWidth = math.max(maxWidth, weightSize.width + size.width + 20)
        icon_bg._itemWid = math.max(icon_bg._itemWid, weightSize.width + size.width + 20)
    end

    -- Mode
    local modeStr = ItemTips.GetModeStr(itemData)
    if modeStr then
        local rich_mode = GUI:RichText_Create(GUI:ItemShow_GetLayoutExtra(item), "rich_mode", size.width + 10, iconMoveY, modeStr, richWidth, _setFontSize or _DefaultFSize, "#FFFFFF", vspace, nil, fontPath)
        GUI:setAnchorPoint(rich_mode, 0, 0)
        local modeSize = GUI:getContentSize(rich_mode)
        maxWidth = math.max(maxWidth, modeSize.width + size.width + 20)
        icon_bg._itemWid = math.max(icon_bg._itemWid, modeSize.width + size.width + 20)
    end

    -- 刀魂
    local extend = itemData.ExtendInfo
    if extend then
        local swordSoulIndex = 0
        while true do
            local swordSoulData = extend["LH" .. swordSoulIndex]
            if not swordSoulData then
                break
            end
            local swordSoulTips = ItemTips.GetSwordOfSoul(contentPanel, swordSoulData, swordSoulIndex)
            if swordSoulTips then
                ItemTips.PushItem(contentPanel, swordSoulTips)
                maxWidth = math.max(maxWidth, GUI:getContentSize(swordSoulTips).width)
				ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace))
            end
            swordSoulIndex = swordSoulIndex + 1
        end
    end

   -- 基础属性
	-- 基础属性
    -- 基础属性
	local baseAttList = ParseBaseAtt(itemData.attribute) ----分解基础属性 3#17#4|3#18#5|3#21#2|3#22#3|3#6#1 根据职业存成{[17]=4,[18]=5}
	--SL:PrintTable(baseAttList)
	--ItemTips.teshu_t
	local jichuStr = "" --基础属性
	local yc_Str = "" --隐藏属性
	local ts_Str = ""
	if ItemTips.teshu_t[itemData.Name] and not itemData.MakeIndex then
		local teshuStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(154), "[基础属性]：").."<br>"
		teshuStr = teshuStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), ItemTips.teshu_t[itemData.Name]) .."<br>"
		local rich_teshu = GUI:RichText_Create(contentPanel, "rich_teshu", 0, 0, teshuStr, richWidth, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(255), vspace, nil,  fontPath) 
		ItemTips.PushItem(contentPanel, rich_teshu)
		ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
    elseif itemData.Name == "仙剑·酒葫芦" then
		local huluStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(154), "[基础属性]：").."<br>"
		local str = "防御：10-10<br>魔御：10-10<br>酒葫芦会随着酒气值的<br>增长而变幻成<font color='#00FF00'>醉酒状态</font><br>"
		huluStr = huluStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), str) .."<br>"
		local rich_hulu = GUI:RichText_Create(contentPanel, "rich_hulu1", 0, 0, huluStr, richWidth, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(255), vspace, nil,  fontPath) 
		ItemTips.PushItem(contentPanel, rich_hulu)
		ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
		if itemData.MakeIndex then --实体
			if getjipin(itemData,40) >= 10000 then
				local huluStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(154), "[醉酒属性]：已激活").."<br>"
				local str = "伤害增加：5%<br>PK时可将目标的回城石<br>和随机石打入读秒状态<br>"
				huluStr = huluStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), str) .."<br>"
				local rich_hulu = GUI:RichText_Create(contentPanel, "rich_hulu3", 0, 0, huluStr, richWidth, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(255), vspace, nil,  fontPath) 
				ItemTips.PushItem(contentPanel, rich_hulu)
				ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
			elseif getjipin(itemData,40) > 0 then
				local huluStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(154), "[饮酒属性]：已激活").."<br>"
				local str = "伤害增加：2%<br>回收比例：10%<br>"
				huluStr = huluStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), str) .."<br>"
				local rich_hulu = GUI:RichText_Create(contentPanel, "rich_hulu2", 0, 0, huluStr, richWidth, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(255), vspace, nil,  fontPath) 
				ItemTips.PushItem(contentPanel, rich_hulu)
				ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
			end
		end
		local huluStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(154), "[隐藏属性]：").."<br>"
		local str = "自身血量低于<font color='#00FF00'>60%</font>时，触<br>发酒气护体，所受攻击伤<br>害的<font color='#00FF00'>20%</font>被酒气值所抵挡<br>"
		huluStr = huluStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), str) .."<br>"
		local rich_hulu = GUI:RichText_Create(contentPanel, "rich_hulu4", 0, 0, huluStr, richWidth, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(255), vspace, nil,  fontPath) 
		ItemTips.PushItem(contentPanel, rich_hulu)
		ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
			
		local str = "御剑乘风来，除魔天地间<br>有酒乐逍遥，无酒我亦颠<br>一饮尽江河，再饮吞日月<br>千杯醉不倒，唯我酒剑仙<br>"
		local huluStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(251), str) .."<br>"
		local rich_hulu = GUI:RichText_Create(contentPanel, "rich_hulu5", 0, 0, huluStr, richWidth, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(255), vspace, nil,  fontPath) 
		ItemTips.PushItem(contentPanel, rich_hulu)
		ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
	elseif itemData.StdMode ~= 65 then
			------防御下限  --防御上限
			local minzhi,maxzhi = 0,0
			if baseAttList[9] then minzhi = baseAttList[9] end
			if baseAttList[10] then maxzhi = baseAttList[10] end
			local jpatt = getjipin(itemData,0) --极品属性
			local teshumin = getteshu(itemData,9)
			local teshumax = getteshu(itemData,10)
			minzhi = minzhi + teshumin
			maxzhi = maxzhi + jpatt + teshumax
			if minzhi > 0 or maxzhi > 0 then
				if jpatt > 0 then
					jichuStr = jichuStr .. string.format("<font color='%s'>%s</font><font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "防御：".. minzhi .. "-" .. maxzhi,SL:GetHexColorByStyleId(250),"(+".. jpatt ..")").."<br>"
				else
					jichuStr = jichuStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "防御：".. minzhi .. "-" .. maxzhi).."<br>"
				end
			end
			--魔御下限--魔御上限
			minzhi,maxzhi = 0,0
			if baseAttList[11] then minzhi = baseAttList[11] end 	
			if baseAttList[12] then maxzhi = baseAttList[12] end
			jpatt = getjipin(itemData,1) --极品属性
			teshumin = getteshu(itemData,11)
			teshumax = getteshu(itemData,12)
			minzhi = minzhi + teshumin
			maxzhi = maxzhi + jpatt + teshumax	
			if minzhi > 0 or maxzhi > 0 then
				if jpatt > 0 then
					jichuStr = jichuStr .. string.format("<font color='%s'>%s</font><font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "魔御：".. minzhi .. "-" .. maxzhi,SL:GetHexColorByStyleId(250),"(+".. jpatt ..")").."<br>"
				else
					jichuStr = jichuStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "魔御：".. minzhi .. "-" .. maxzhi).."<br>"
				end
			end
			--攻击下限	--攻击上限
			minzhi,maxzhi = 0,0
			if baseAttList[3] then minzhi = baseAttList[3] end 	
			if baseAttList[4] then maxzhi = baseAttList[4] end 
			jpatt = getjipin(itemData,2) --极品属性
			teshumin = getteshu(itemData,3)
			teshumax = getteshu(itemData,4)
			minzhi = minzhi + teshumin
			maxzhi = maxzhi + jpatt + teshumax

			if minzhi > 0 or maxzhi > 0 then
				if jpatt > 0 then
					jichuStr = jichuStr .. string.format("<font color='%s'>%s</font><font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "攻击：".. minzhi .. "-" .. maxzhi,SL:GetHexColorByStyleId(250),"(+".. jpatt ..")").."<br>"
				else
					jichuStr = jichuStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "攻击：".. minzhi .. "-" .. maxzhi).."<br>"
				end
			end
			--魔法下限	--魔法上限
			minzhi,maxzhi = 0,0
			if baseAttList[5] then minzhi = baseAttList[5] end 	
			if baseAttList[6] then maxzhi = baseAttList[6] end 
			jpatt = getjipin(itemData,3) --极品属性
			teshumin = getteshu(itemData,5)
			teshumax = getteshu(itemData,6)
			minzhi = minzhi + teshumin
			maxzhi = maxzhi + jpatt + teshumax	
			if minzhi > 0 or maxzhi > 0 then
				if jpatt > 0 then
					jichuStr = jichuStr .. string.format("<font color='%s'>%s</font><font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "魔法：".. minzhi .. "-" .. maxzhi,SL:GetHexColorByStyleId(250),"(+".. jpatt ..")").."<br>"
				else
					jichuStr = jichuStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "魔法：".. minzhi .. "-" .. maxzhi).."<br>"
				end
			end
			--道术下限--道术上限
			minzhi,maxzhi = 0,0
			if baseAttList[7] then minzhi = baseAttList[7] end 	
			if baseAttList[8] then maxzhi = baseAttList[8] end 	
			jpatt = getjipin(itemData,4) --极品属性
			teshumin = getteshu(itemData,7)
			teshumax = getteshu(itemData,8)
			minzhi = minzhi + teshumin
			maxzhi = maxzhi + jpatt + teshumax	
			if minzhi > 0 or maxzhi > 0 then
				if jpatt > 0 then
					jichuStr = jichuStr .. string.format("<font color='%s'>%s</font><font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "道术：".. minzhi .. "-" .. maxzhi,SL:GetHexColorByStyleId(250),"(+".. jpatt ..")").."<br>"
				else
					jichuStr = jichuStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "道术：".. minzhi .. "-" .. maxzhi).."<br>"
				end
			end
			
			----准确
			minzhi = 0
			if baseAttList[13] then minzhi = baseAttList[13] end
			teshu =	getteshu(itemData,13)
			minzhi = minzhi + teshu
			if minzhi > 0 then
				jichuStr = jichuStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "准确：+".. minzhi.. "<br>")
			end
			
			----敏捷
			minzhi = 0
			if baseAttList[14] then minzhi = baseAttList[14] end
			teshu =	getteshu(itemData,14)
			minzhi = minzhi + teshu
			if minzhi > 0 then
				jichuStr = jichuStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "敏捷：+".. minzhi.. "<br>")
			end
			
			----神圣
			minzhi = 0
			if baseAttList[38] then minzhi = baseAttList[38] end
			teshu =	getteshu(itemData,38)
			minzhi = minzhi + teshu
			if minzhi > 0 then
				jichuStr = jichuStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "神圣：+".. minzhi.. "<br>")
			end
			
			----魔法躲避
			minzhi = 0
			if baseAttList[15] then minzhi = baseAttList[15] end 
			jpatt = getjipin(itemData,9) + getteshu(itemData,15)
			minzhi = minzhi + jpatt
			if minzhi > 0 then
				if jpatt > 0 then
					jichuStr = jichuStr .. string.format("<font color='%s'>%s</font><font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "魔法躲避：+".. minzhi*10 .."%",SL:GetHexColorByStyleId(250),"(+".. jpatt*10 .."%)").."<br>"
				else
					jichuStr = jichuStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "魔法躲避：+".. minzhi*10 .. "%<br>")
				end
			end
					
			----幸运
			minzhi = 0
			if baseAttList[39] then minzhi = baseAttList[39] end
			teshumin = getteshu(itemData,39)
			jpatt = getjipin(itemData,5)
			minzhi = minzhi + teshumin + jpatt
			if minzhi > 0 then
				if jpatt > 0 then
					jichuStr = jichuStr .. string.format("<font color='%s'>%s</font><font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "幸运：+".. minzhi,SL:GetHexColorByStyleId(250),"(+".. jpatt ..")").."<br>"
				else
					jichuStr = jichuStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "幸运：+".. minzhi .. "<br>")
				end
			end
			
			-------------特殊属性
			
			
			----生命值
			minzhi = 0
			if baseAttList[1] then minzhi = baseAttList[1] end
			if minzhi > 0 then
				if itemData.StdMode == 10 or itemData.StdMode == 11 then 
					jichuStr = jichuStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "生命值：+".. minzhi.. "<br>")
				else
					ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "生命值：+".. minzhi.. "<br>")
				end
			end
			
			----攻击速度
			minzhi = 0
			if baseAttList[20] then minzhi = baseAttList[20] end
			teshumin = getteshu(itemData,20)
			minzhi = minzhi + teshumin
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "攻击速度：+".. minzhi .. "<br>")
			end
			
			----施法速度
			minzhi = 0
			if baseAttList[207] then minzhi = baseAttList[207] end
			teshumin = getteshu(itemData,207)
			minzhi = minzhi + teshumin
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "施法速度：+".. minzhi .. "<br>")
			end
			
			
			----暴击
			minzhi = 0
			if baseAttList[21] then minzhi = baseAttList[21] end
			jpatt = getjipin(itemData,30)
			minzhi = minzhi + jpatt
			if minzhi > 0 then
				if itemData.StdMode == 19 or itemData.StdMode == 20 or itemData.StdMode == 21 then
					if jpatt > 0 then
						ts_Str = ts_Str .. string.format("<font color='%s'>%s</font><font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "暴击：+".. minzhi,SL:GetHexColorByStyleId(250),"(+".. jpatt ..")").."<br>"
					else
						ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "暴击：+".. minzhi .. "<br>")
					end
					
					local cuilianzhi = getcuilian(itemData)
					if cuilianzhi > 0 then
						ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(254), "淬炼值：+".. cuilianzhi .. "<br>")
					end
				else
					if jpatt > 0 then
						ts_Str = ts_Str .. string.format("<font color='%s'>%s</font><font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "暴击几率：+".. minzhi.."%",SL:GetHexColorByStyleId(250),"(+".. jpatt .."%)").."<br>"
					else
						ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "暴击几率：+".. minzhi .. "%<br>")
					end
				end
			end
			
			
			
			----吸血
			minzhi = 0
			if baseAttList[34] then minzhi = baseAttList[34] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "吸血：+".. minzhi/100 .. "%<br>")
			end
			
			
			
			----防御加成
			minzhi = 0
			if baseAttList[36] then minzhi = baseAttList[36] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "防御加成：+".. minzhi/100 .. "%<br>")
			end
			
			----魔御加成
			minzhi = 0
			if baseAttList[37] then minzhi = baseAttList[37] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "魔御加成：+".. minzhi/100 .. "%<br>")
			end
			
			----穿透
			minzhi = 0
			if baseAttList[78] then minzhi = baseAttList[78] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "忽视目标双防：+".. minzhi .. "<br>")
			end
			
			----对怪增伤
			minzhi = 0
			if baseAttList[75] then minzhi = baseAttList[75] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "对怪增伤：+".. minzhi/100 .. "%<br>")
			end
			
			----暴击几率抵抗
			minzhi = 0
			if baseAttList[23] then minzhi = baseAttList[23] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "暴击几率抵抗：+".. minzhi .. "%<br>")
			end
			
			----暴击伤害减免
			minzhi = 0
			if baseAttList[24] then minzhi = baseAttList[24] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "暴击伤害减免：+".. minzhi .. "%<br>")
			end
			
			----重击伤害减免
			minzhi = 0
			if baseAttList[208] then minzhi = baseAttList[208] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "所受重击总伤害减免：+".. minzhi/100 .. "%<br>")
			end
			
			----吸血抵抗
			minzhi = 0
			if baseAttList[84] then minzhi = baseAttList[84] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "吸血抵抗：+".. minzhi/100 .. "%<br>")
			end
			
			----破防抵抗
			minzhi = 0
			if baseAttList[85] then minzhi = baseAttList[85] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "破防抵抗：+".. minzhi/100 .. "%<br>")
			end
			
			----宝宝攻击速度
			minzhi = 0
			if baseAttList[206] then minzhi = baseAttList[206] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "宝宝攻击速度：+".. minzhi*10 .. "%<br>")
			end
			
			----经验倍率
			minzhi = 0
			if baseAttList[66] then minzhi = baseAttList[66] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "经验倍率：+".. minzhi/100 .. "%<br>")
			end
			
			----药品疗效
			minzhi = 0
			if baseAttList[83] then minzhi = baseAttList[83] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "药品疗效：+".. minzhi/100 .. "%<br>")
			end
			
			----对战增伤
			minzhi = 0
			if baseAttList[54] then minzhi = baseAttList[54] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "对战增伤：+".. minzhi/100 .. "%<br>")
			end
			
			----受战减伤
			minzhi = 0
			teshumin = 0
			if baseAttList[55] then minzhi = baseAttList[55] end
			if baseAttList[210] then teshumin = baseAttList[210] end	
			minzhi = minzhi + teshumin
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "受战减伤：+".. minzhi/100 .. "%<br>")
			end
			
			----对法增伤
			minzhi = 0
			if baseAttList[56] then minzhi = baseAttList[56] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "对法增伤：+".. minzhi/100 .. "%<br>")
			end
			
			----受法减伤
			minzhi = 0
			teshumin = 0
			if baseAttList[57] then minzhi = baseAttList[57] end
			if baseAttList[211] then teshumin = baseAttList[211] end	
			minzhi = minzhi + teshumin
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "受法减伤：+".. minzhi/100 .. "%<br>")
			end
			
			----对道增伤
			minzhi = 0
			if baseAttList[58] then minzhi = baseAttList[58] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "对道增伤：+".. minzhi/100 .. "%<br>")
			end
			
			----受道减伤
			minzhi = 0
			teshumin = 0
			if baseAttList[59] then minzhi = baseAttList[59] end
			if baseAttList[212] then teshumin = baseAttList[212] end	
			minzhi = minzhi + teshumin
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "受道减伤：+".. minzhi/100 .. "%<br>")
			end
			
			----PK增伤
			minzhi = 0
			if baseAttList[76] then minzhi = baseAttList[76] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "PK增伤：+".. minzhi/100 .. "%<br>")
			end
			
			----PK减伤
			minzhi = 0
			if baseAttList[77] then minzhi = baseAttList[77] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "PK减伤：+".. minzhi/100 .. "%<br>")
			end
			
			----受怪减伤
			minzhi = 0
			if baseAttList[82] then minzhi = baseAttList[82] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "受怪减伤：+".. minzhi/100 .. "%<br>")
			end
			
			----增加目标爆率
			minzhi = 0
			if baseAttList[32] then minzhi = baseAttList[32] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "PK目标爆率：+".. minzhi .. "%<br>")
			end
			
			----死亡爆率降低
			minzhi = 0
			if baseAttList[33] then minzhi = baseAttList[33] end
			if minzhi > 0 then
				ts_Str = ts_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(253), "死亡爆率降低：+".. minzhi .. "%<br>")
			end
			
			-----------隐藏属性
			----宝宝伤害
			minzhi = 0
			if baseAttList[204] then minzhi = baseAttList[204] end
			if minzhi > 0 then
				yc_Str = yc_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "宝宝攻击伤害：+".. minzhi/100 .. "%<br>")
			end
			
			----重击几率
			minzhi = 0
			if baseAttList[201] then minzhi = baseAttList[201] end
			if minzhi > 0 then
				yc_Str = yc_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "重击几率：+".. minzhi/100 .. "%<br>")
			end
			
			----重击伤害
			minzhi = 0
			if baseAttList[202] then minzhi = baseAttList[202] end
			if minzhi > 0 then
				yc_Str = yc_Str .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "重击伤害：+".. minzhi/100 .. "%<br>")
			end
			
    end
	
	
	if itemData.StdMode == 65 then --法宝
		--SL:Print("tips红色法宝  "..tostring(GUIUtil.hongsefabao))
		--SL:Print("tips绿色法宝  "..tostring(GUIUtil.lvsefabao))
		local fabaoStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(154), "[基础属性]：").."<br>"
		fabaoStr = fabaoStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), ItemTips.fabao_t[name]) .."<br>"
		local rich_fabao = GUI:RichText_Create(contentPanel, "rich_fabao", 0, 0, fabaoStr, richWidth, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(255), vspace, nil,  fontPath) 
		ItemTips.PushItem(contentPanel, rich_fabao)
		ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
		if not itemData.MakeIndex and GUIUtil.hongsefabao and GUIUtil.lvsefabao and GUIUtil.hongsefabao ~= 0 and GUIUtil.lvsefabao ~= 0 then
			local rongheStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(251), "[融合属性]：").."<br>"
			rongheStr = rongheStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(254), ItemTips.fabao_t[GUIUtil.lvsefabao]) .."<br>"
			local rich_fabaoronghe = GUI:RichText_Create(contentPanel, "rich_fabaoronghe", 0, 0, rongheStr, richWidth, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(255), vspace, nil,  fontPath) 
			ItemTips.PushItem(contentPanel, rich_fabaoronghe)
			ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
		elseif itemData.MakeIndex and itemData.Values then
			local zhi = 0
			for i = 1,#itemData.Values do
				if itemData.Values[i].Id == 38 then
					zhi = itemData.Values[i].Value
					break
				end
			end
			if zhi > 0 then
				local ronghename = ItemTips.fabao_bh[zhi]
				local rongheStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(251), "[融合属性]：").."<br>"
				rongheStr = rongheStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(254), ItemTips.fabao_t[ronghename]) .."<br>"
				rongheStr = rongheStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(249), "人物爆出后不可拾取") .."<br>"
				local rich_fabaoronghe = GUI:RichText_Create(contentPanel, "rich_fabaoronghe", 0, 0, rongheStr, richWidth, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(255), vspace, nil,  fontPath) 
				ItemTips.PushItem(contentPanel, rich_fabaoronghe)
				ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
			end
		end
	end
	
	if #jichuStr > 0 then
		--SL:Print("进入 "..jichuStr)
		jichuStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(154), "[基础属性]：").."<br>" .. jichuStr
		rich_att_base = GUI:RichText_Create(contentPanel, "rich_att_base", 0, 0, jichuStr, richWidth, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(255), vspace, nil,  fontPath) 
		ItemTips.PushItem(contentPanel, rich_att_base)
		maxWidth = math.max(maxWidth, GUI:getContentSize(rich_att_base).width)
		ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true)) 
	end 

    -- 条件限制
    local needStr = ItemTips.GetNeedStr(itemData)
    if needStr then
        local rich_need = GUI:RichText_Create(contentPanel, "rich_need", 0, 0, needStr, richWidth, _setFontSize or _DefaultFSize, "#FFFFFF", vspace, nil, fontPath) 
        ItemTips.PushItem(contentPanel, rich_need)
        maxWidth = math.max(maxWidth, GUI:getContentSize(rich_need).width)
        ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
    end
	if #ts_Str > 0 then
		ts_Str = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(154), "[特殊属性]：").."<br>" .. ts_Str
		rich_att_base = GUI:RichText_Create(contentPanel, "rich_att_ts", 0, 0, ts_Str, richWidth, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(255), vspace, nil,  fontPath) 
		ItemTips.PushItem(contentPanel, rich_att_base)
		maxWidth = math.max(maxWidth, GUI:getContentSize(rich_att_base).width)
		ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true)) 
	end
	if #yc_Str > 0 then
		yc_Str = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(154), "[隐藏属性]：").."<br>" .. yc_Str
		rich_att_base = GUI:RichText_Create(contentPanel, "rich_att_yc", 0, 0, yc_Str, richWidth, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(255), vspace, nil,  fontPath) 
		ItemTips.PushItem(contentPanel, rich_att_base)
		maxWidth = math.max(maxWidth, GUI:getContentSize(rich_att_base).width)
		ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true)) 
	end
	
	--升星属性
	--ssr.PrintTable(itemData)
	if itemData.Values then --有记录的属性 34主属性，35防御，36魔防
		local sx1,sx2,sx3 = 0,0,0
		for i = 1,#itemData.Values do
			if itemData.Values[i].Id == 34 then
				sx1 = itemData.Values[i].Value
			end
			if itemData.Values[i].Id == 35 then
				sx2 = itemData.Values[i].Value
			end
			if itemData.Values[i].Id == 36 then
				sx3 = itemData.Values[i].Value
			end
		end

		if sx1 > 0 or sx2 > 0 or sx3 > 0 then --有升星属性
			local sxsxStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(154), "[升星属性]：") .."<br>"
			if sx1 > 0 then
				sxsxStr = sxsxStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "主属性：+"..sx1) .."<br>"
			end
			if sx2 > 0 then
				sxsxStr = sxsxStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "防　御：+"..sx2) .."<br>"
			end
			if sx3 > 0 then
				sxsxStr = sxsxStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), "魔　御：+"..sx3) .."<br>"
			end
			local rich_sxsx = GUI:RichText_Create(contentPanel, "rich_sxsx", 0, 0, sxsxStr, richWidth, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(255), vspace, nil, fontPath) 
			ItemTips.PushItem(contentPanel, rich_sxsx)
			maxWidth = math.max(maxWidth, GUI:getContentSize(rich_sxsx).width)
			ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
		end
	end


--[[    -- 元素属性
    if attStr2 and #attStr2 > 0 then
        for i, v in ipairs(attStr2) do
            local rich_att_ys = nil
            if v.str then
                rich_att_ys = GUI:RichText_Create(contentPanel, "rich_att_ys_"..i, 0, 0, v.str, richWidth, _setFontSize or _DefaultFSize, "#FFFFFF", vspace, nil, fontPath) 
                ItemTips.PushItem(contentPanel, rich_att_ys)
                maxWidth = math.max(maxWidth, GUI:getContentSize(rich_att_ys).width)
                upAttrMaxWidth = math.max(upAttrMaxWidth, GUI:getContentSize(rich_att_ys).width)
            end

            if rich_att_ys and v.id and upAttrs[v.id] then
                table.insert(upAttrRichs, rich_att_ys)
            end
        end
        ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
    end--]]

    -- 附加属性
    local abilexStr = itemData.ExAbil and itemData.ExAbil.abilex
    local exAttrStr = ItemTips.ParseExAddAttr(abilexStr)
    if exAttrStr and next(exAttrStr) then
        for i, v in ipairs(exAttrStr) do
            local rich_att_ex = nil
            if v.str then
                rich_att_ex = GUI:RichText_Create(contentPanel, "rich_att_ex_" .. i, 0, 0, v.str, richWidth, _setFontSize or _DefaultFSize, "#FFFFFF", vspace, nil, fontPath) 
                ItemTips.PushItem(contentPanel, rich_att_ex)
                maxWidth = math.max(maxWidth, GUI:getContentSize(rich_att_ex).width)
                --upAttrMaxWidth = math.max(upAttrMaxWidth, GUI:getContentSize(rich_att_ex).width)
            end

            --[[if rich_att_ex and v.id and upAttrs[v.id] then
                table.insert(upAttrRichs, rich_att_ex)
            end--]]
        end
        ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
    end
	
	ItemTips.wmysjieshao = {
	"雷电术伤害增加",
	"灭天火伤害增加",	
	"流星火雨伤害增加",
	"魔法盾抗性增加",
	"火墙伤害增加",	
	"冰咆哮伤害增加",
	"基本剑术伤害增加",		
	"攻杀剑术伤害增加",	
	"半月弯刀伤害增加",	
	"刺杀剑术伤害增加",	
	"疾光电影伤害增加",	
	"烈火剑法伤害增加",
	"开天斩伤害增加",
	"逐日剑法伤害增加",	
	"宝宝伤害增加",			
	"灵魂火符伤害增加",			
	"噬血术伤害增加",		
	"施毒术伤害增加",
	"目标受到火墙的暴击几率提升10%",		
	"释放疾光电影额外造成目标人物2%最大血量伤害",			
	"使用灭天火攻击降低对方魔御10-15,持续10秒(不可叠加)",		
	"魔法盾时长额外增加20%	",		
	"法师在无魔法盾情况下所受伤害减免30%",			
	"使用诱惑之光可将人物宝宝诱惑30s无法动弹(不判断等级)",			
	"血量高于90%使用灭天火有3%概率触发末日审判,将斩杀敌对目标人物总血量6%",			
	"使用灭天火或者流星火雨时6%概率召唤雷电,造成自身魔法上限60%的固定伤害",			
	"每120秒获得一次聚魔效果.使用冰咆哮造成自身魔法上限100%的固定伤害",			
	"使用野蛮冲撞可以冲撞同等级的玩家.并且三秒内自己不可被野蛮",			
	"目标被野蛮后有100%几率被麻痹3秒",			
	"释放烈火剑法每次命中将额外斩杀目标人物5%总血量",			
	"使用半月弯刀攻击每次附带攻击上限10%的额外固定伤害",			
	"刺杀剑术将忽视目标一切刺杀抵抗效果",			
	"释放攻杀剑术每次攻击附带50点固定伤害",			
	"使用烈火剑法后有25%几率清除CD形成双烈火",			
	"野蛮冲撞使被撞目标损失10%总血量",			
	"释放开天斩时有18%几率使目标人物冰冻2秒",			
	"使用治愈术将使目标获得每秒额外恢复2%血量持续30秒（不可叠加CD60秒）",			
	"使用隐身术使自己可以获得对人对怪隐身4秒（CD120秒）",		
	"使用神圣战甲术使区域内伙伴额外提升20%防御魔御持续60秒（不可叠加）",			
	"使用幽灵盾使目标区域内伙伴额外提升10%战斗力持续30秒（不可叠加CD60秒）",			
	"宝宝额外伤害增加30%",	
	"使用4级召唤神兽可以同时获得两只宝宝",			
	"使用无极真气期间自身可获得当前道术15%双防.宠物50%概率无视防御状态.并可额外继承主人15%道术最高伤害.",		
	"道士宝宝死亡将获得爆炸伤害,2格范围敌人损失自身当前道术上限的2倍血量",		
	"道士宝宝攻击速度增加20% 移动速度增加20%",
	}
	ItemTips.wmysname = {"雷电术","灭天火","流星火雨","魔法盾","火墙伤害","冰咆哮","基本剑术","攻杀剑术","半月弯刀","刺杀剑术","疾光电影","烈火剑法","开天斩","逐日剑法","宝宝伤害",     
	"灵魂火符","噬血术","施毒术","火焰风暴","闪电穿行","怒火中烧","神奇魔盾","无懈可击","目眩神迷","末日审判","疾风迅雷","蛟龙震海","不动冥王","横冲直撞","烈焰焚天","圆月回旋",
	"刺杀之魂","乘风破浪","剑意追击","共工之怒","冰之奥义","碧海潮生","暗隐刺客","道法自然","战力增幅","泰坦附魂","千变万化","百蛊灭魂","两败俱伤","道心通灵",}
	
	
	ItemTips.wmysjieshao1 = {
	"对怪物伤害提升5%,受怪减伤+5%",
	"对怪物伤害提升10%,受怪减伤+10%",
	"HP提升5%,自身血量低于80%忽视目标双防:5-5",
	"HP提升10%,自身血量低于80%忽视目标双防:10-10",
	"减少被蛛网麻痹概率50%.自身HP提升5%",
	"攻击血量低于50%的目标时.额外增加3%的伤害",
	"攻击血量低于50%的目标时.额外增加6%的伤害",
	"人物所受到的宝宝伤害将直接反弹给宝宝主人30%",
	"人物所受到的宝宝伤害将直接反弹给宝宝主人60%",
	"攻击时有2%的概率使对方移动速度降低50%持续5秒",
	"每次所受到的固伤伤害减免60点(只减少额外附带的固定伤害)",
	"攻击时降低目标10%的药品疗效,持续30秒",
	"攻击时降低目标20%的药品疗效,持续30秒",
	"攻击时5%的概率使对方幸运降低1点 持续12秒",
	"受到单次最大伤害不超过自身总血量20%，15秒可抵挡一次",
	"被自己杀死的玩家当日降低攻魔道10-10次日恢复（不可被叠加）",
	"被自己杀死的玩家防御魔御降低10-10次日恢复（不可被叠加）",
	"被攻击者MP低于50% 将受到自己15%的额外伤害",
	"自身血量低于40%将获得每秒2%的自身恢复.持续10秒 CD60秒",
	"使被攻击者降低10%体力上限,持续20秒(不可叠加)",
	"攻击比自己等级高的玩家时，每相差1级，造成1%的额外伤害",
	"被攻击时,将有2%的概率格挡本次所受伤害",
	"被攻击时,将有5%的概率格挡本次所受伤害",
	"目标人物低于8%的血量直接斩杀",
	"受刺杀剑术伤害减免15%,自身HP+5%",
	"受到暴击时 自身暴击伤害提升20% 持续10秒",
	"获得传送权限以后当日可传送次数+50",
	"获得传送权限以后当日可传送次数+25",
	"玄武之力持续时间额外增加5秒",
	"对血量高于75%的目标造成1.1倍伤害",
	"痛击人物灵魂对目标人物造成本职业主属性上限10%的额外固定伤害",
	"痛击人物灵魂对目标人物造成本职业主属性上限15%的额外固定伤害",
	"无视进入战斗状态BUFF,随时可脱离战场",
	"无视目标火系技能伤害的暴击和重击效果 火墙抗性+20%（三职业均有火系技能）",
	"吸血抵抗+20%<br>减少被蛛网和麻痹概率100%<br>使用特殊药品不受buff限制",
	"攻击时有2%的概率使敌人变色.降低攻击速度5点,主属性降低15%,持续15秒",
	"被攻击者MP低于50%,将受到自己30%的额外伤害",
	"血量低于30%,将获得对人对怪持续隐身3秒(CD120秒)",
	"目标人物的血量低于16%直接斩杀",
	"受刺杀剑术伤害减少35%,自身hp+10%",
	"受到暴击时 自身暴击伤害提升50% 持续12秒",
	"目标受到自己攻击时.降低目标幸运两点.持续12秒",
	"当人物处于饮酒或者醉酒状态时,攻击以及施法速度+3,固伤减免+60点",
	"每120秒获得一次护盾,2秒内所受伤害可直接被无视",
	"玄武之力持续时间额外增加15秒",
	"人物每3秒净化一次自身受到的红绿毒效果.吸血抵抗+10%",
	"降低目标魔法躲避50%,无视对方吸蓝以及降蓝BUFF效果",
	"对血量低于10%的怪物(10W以上)将直接斩杀，并且攻击怪物时有几率直接秒杀2%血量",
	}
	ItemTips.wmysname1 = {
		"除魔卫道","除魔卫道","坚如磐石","坚如磐石","随心所欲","百折不挠","百折不挠","移花接木","移花接木","寸步难移",
		"哀而不伤","生命压制","生命压制","诅咒之王","釜底抽薪","束手就擒","插翅难飞","趁火打劫","枯木逢春","摩诃心经",
		"童子功法","固若金汤","固若金汤","龙战于野","刺杀减免","暴击增幅","日行千里","日行千里","气贯长虹","称王称霸",
		"灵魂重击","灵魂重击","来去自如","隔岸观火","畅通无阻","嗜血魔功","趁火打劫","暗影刺客","龙战于野",
		"刺杀减免","暴击增幅","诅咒之王","醉饮江湖","乾坤法咒","气贯长虹","百毒不侵","形同虚设","怪物克星"}
	
	
	if itemData.Name =="武穆遗书" then
		--武穆遗书第二条属性
		local wmys_bh = getjipin(itemData,43)
		local wmys_zhi = getjipin(itemData,44)

		if wmys_bh > 0 then
			local wmysname = ItemTips.wmysname[wmys_bh]
			--ssr.print("名字"..wmysname)
			local wmysStr = ""
			if wmys_bh <= 18 then
				wmysStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(154), "[神秘属性]：技能伤害").."<br>"
				wmysStr = wmysStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(254), ItemTips.wmysjieshao[wmys_bh]..wmys_zhi.."%") .."<br>"
			else
				wmysStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(154), "[神秘属性]：".. wmysname ).."<br>"
				wmysStr = wmysStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(249), ItemTips.wmysjieshao[wmys_bh]) .."<br>"
			end
			local kuan = 240
			if SL:GetMetaValue("WINPLAYMODE") then
				kuan = 180
			end
			local rich_wmysStr = GUI:RichText_Create(contentPanel, "rich_wmysStr", 0, 0, wmysStr, kuan, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(255), vspace, nil, fontPath) 
			ItemTips.PushItem(contentPanel, rich_wmysStr)
			ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
		end
		
		
		
		--武穆遗书第3条属性
		local wmys_bh3 = getjipin(itemData,46)
		if wmys_bh3 > 0 then
			local wmysname = ItemTips.wmysname1[wmys_bh3]
			--ssr.print("名字"..wmysname)
			local ys = 254
			if wmys_bh3 >= 34 then
				ys = 249
			end
			local kuan = 240
			if SL:GetMetaValue("WINPLAYMODE") then
				kuan = 180
			end
			local wmysStr = ""
			wmysStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(154), "[神秘属性]：".. wmysname ).."<br>"
			wmysStr = wmysStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(ys), ItemTips.wmysjieshao1[wmys_bh3]) .."<br>"
			local rich_wmysStr3 = GUI:RichText_Create(contentPanel, "rich_wmysStr3", 0, 0, wmysStr, kuan, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(255), vspace, nil, fontPath) 
			ItemTips.PushItem(contentPanel, rich_wmysStr3)
			ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
		end
	end
	
	if itemData.Name == "疾风项链(封印)" or itemData.Name == "疾风戒指(封印)" then
		local str = "听闻<font color='#00FF00'>苍月岛</font>的天虹法师<br>可以解开此装备的封印"
		local fengyinStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(251), str) .."<br>"
		local rich_fengyinStr = GUI:RichText_Create(contentPanel, "rich_fengyinStr", 0, 0, fengyinStr, richWidth, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(255), vspace, nil, fontPath) 
        ItemTips.PushItem(contentPanel, rich_fengyinStr)
		ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
	end
	
	if itemData.Name == "恶魔之带(封印)" or itemData.Name == "恶魔之靴(封印)" then
		local str = "最近，<font color='#00FF00'>魔龙城</font>的驱魔使者<br>偶得一卷上古秘法，也许<br>能解开此装备的封印..."
		local fengyinStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(251), str) .."<br>"
		local rich_fengyinStr = GUI:RichText_Create(contentPanel, "rich_fengyinStr", 0, 0, fengyinStr, richWidth, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(255), vspace, nil, fontPath) 
        ItemTips.PushItem(contentPanel, rich_fengyinStr)
		ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
	end
	
	if itemData.Name == "祝福项链(封印)" then
		local str = "听闻，<font color='#00FF00'>白日门</font>的祝福仙子<br>正在等待有缘人，拿着被<br>封印的项链去找她..."
		local fengyinStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(251), str) .."<br>"
		local rich_fengyinStr = GUI:RichText_Create(contentPanel, "rich_fengyinStr", 0, 0, fengyinStr, richWidth, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(255), vspace, nil, fontPath) 
        ItemTips.PushItem(contentPanel, rich_fengyinStr)
		ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
	end

    -- 添加属性提升标识
    if upAttrRichs and #upAttrRichs > 0 then
        for i, rich_att in ipairs(upAttrRichs) do
            local image = GUI:Image_Create(rich_att, "up_attr_tag_" .. i, upAttrMaxWidth + 10, 2, "res/public/btn_szjm_01_3.png")
            GUI:setAnchorPoint(image, 0, 0)
            GUI:setScale(image, 0.8)
        end
    end

    -- 特殊属性 无

    -- 宝石
    if itemData and itemData.ExtendInfo and itemData.ExtendInfo.Sockets then
        local width = ItemTips.GetGemShow(contentPanel, itemData)
        if width then
            maxWidth = math.max(maxWidth, width)
        end
    end

    -- 回收
    if itemData.huishou or itemData.honour then
        local recycleStr = ItemTips.GetRecycleStr(itemData)
        local rich_recycle = GUI:RichText_Create(contentPanel, "rich_recycle", 0, 0, recycleStr, richWidth, _setFontSize or _DefaultFSize, "#28EF01", vspace, nil, fontPath)
        ItemTips.PushItem(contentPanel, rich_recycle)
        maxWidth = math.max(maxWidth, GUI:getContentSize(rich_recycle).width)
        ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
    end

    -- 描述
    local desc = itemDescs.desc
    if desc then
        removeLastLine()
        pushDescItem(desc)
        ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
    end

    if itemDescs and next(itemDescs) then
        pushDescItem(itemDescs)
    end

    -- 自定义属性
    if itemData.ExAbil and type(itemData.ExAbil) == "table" and next(itemData.ExAbil) then
        local rich_custom = ItemTips.GetCustomShow(contentPanel, itemData.ExAbil)
        if rich_custom then
            ItemTips.PushItem(contentPanel, rich_custom)
            maxWidth = math.max(maxWidth, GUI:getContentSize(rich_custom).width)
            ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
        end
    end

    --倒计时
    if itemData.AddValues then
        local timeStr = ItemTips.GetTimeStr(1, itemData.AddValues, data.diff or _lookPlayer or _isSelf, {from = data.from, itemData = itemData})
        if timeStr then
            local rich_time = GUI:RichText_Create(contentPanel, "rich_time", 0, 0, timeStr, richWidth, _setFontSize or _DefaultFSize, "#28EF01", vspace, nil, fontPath)
            ItemTips.PushItem(contentPanel, rich_time)
            maxWidth = math.max(maxWidth, GUI:getContentSize(rich_time).width)
        end
    end

    if ssrGlobal_ItemTipsEx then
        local widget = ssrGlobal_ItemTipsEx(itemData)
        if widget and not tolua.isnull(widget) then
            GUI:addChild(contentPanel, widget)
            ItemTips.PushItem(contentPanel, widget)
        end
    end

    -- 来源
    local extend = itemData.ExtendInfo
    if extend and extend.ItmSrc then
        local srcStr = ItemTips.GetSrcStr(extend.ItmSrc)
        if srcStr then
            removeLastLine()
            ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
            local rich_src = GUI:RichText_Create(contentPanel, "rich_src", 0, 0, srcStr, richWidth, _setFontSize or _DefaultFSize, "#28EF01", vspace, nil, fontPath)
            ItemTips.PushItem(contentPanel, rich_src)
            maxWidth = math.max(maxWidth, GUI:getContentSize(rich_src).width)
            ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
        end
    end

    -- 顶部描述desc(移动的)
    pushDescItem(topDesY)
    -- 底部描述
    local bottomDescs = itemDescs.bottom_desc
    if bottomDescs then
        pushDescItem(bottomDescs)
    end

	
	if beizhu[itemData.Name] then
		local kuan = 240
		if SL:GetMetaValue("WINPLAYMODE") then --电脑端
			kuan = 180
		end
		local beizhuStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(beizhu[itemData.Name][2]), beizhu[itemData.Name][1]) .."<br>"
		local rich_beizhuStr = GUI:RichText_Create(contentPanel, "rich_fengyinStr", 0, 0, beizhuStr, kuan, _setFontSize or _DefaultFSize, "FFFFFF", vspace, nil, fontPath) 
        ItemTips.PushItem(contentPanel, rich_beizhuStr)
		ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
		if beizhu[itemData.Name][3] then --有S1系列标注
			beizhuStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(beizhu[itemData.Name][4]), beizhu[itemData.Name][3]) .."<br>"
			rich_beizhuStr = GUI:RichText_Create(contentPanel, "rich_fengyinStr1", 0, 0, beizhuStr, kuan, _setFontSize or _DefaultFSize, "FFFFFF", vspace, nil, fontPath) 
			ItemTips.PushItem(contentPanel, rich_beizhuStr)
			ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
		end
	end

    removeLastLine()

    local sz = GUI:getContentSize(contentPanel)
    local innerH = sz.height
    maxWidth = math.max(maxWidth, sz.width)

    local posY = GUI:getPositionY(contentPanel)
    GUI:setPositionY(contentPanel, innerH - posY)
    GUI:ScrollView_setInnerContainerSize(scrollView, maxWidth, innerH)
    local listH = math.min(innerH, _TipsMaxH)
    GUI:setContentSize(scrollView, maxWidth, listH)
    GUI:setPosition(scrollView, 15, 10)
    GUI:setContentSize(ListBg, maxWidth + 30, listH + 20)
    GUI:setTag(ListBg, _PanelNum)

    -- 套装属性
    local suitCalType = SL:GetMetaValue("GAME_DATA", "SuitCalType") or 0
    local suitSwitch = tonumber(suitCalType) == 1
    local IsHideSuitTips = (tonumber(SL:GetMetaValue("GAME_DATA", "hideSuitTips")) or 0) == 1
    if not IsHideSuitTips then
        if suitSwitch then -- 新套装
            local suitids = itemData.suitid
            if not ItemTips._diff and suitids and string.len(suitids) > 0 then
                local suitArry = string.split(suitids, "#")
                for k, v in pairs(suitArry) do
                    local id = v and tonumber(v)
                    if id then
                        ItemTips.GetNewSuitPanel(id, itemData)
                    end
                end
            end
        else -- 老套装
            local suitNameConfig = SL:GetMetaValue("SUIT_CONFIG", itemData.originName or itemData.Name)
            if suitNameConfig then
                table.sort(suitNameConfig, function(a, b)
                    return a.Idx < b.Idx
                end)
                for k, v in pairs(suitNameConfig) do
                    ItemTips.GetSuitPanel(v, itemData, k)
                end
            end
        end
    end

    -- 穿戴按钮
    local tipsSz = GUI:getContentSize(ListBg)
    if isWear ~= false and data and data.from == ItemFrom.BAG then
        if IsOpenSwitch(1) then
            local btn = ItemTips.AddButton(ListBg, itemData, 1)
            tipsSz = GUI:getContentSize(ListBg)
        end
    end

    -- 内观预览
    ItemTips.GetModelPanel(itemData)

    -- 调整位置
    ItemTips.RefreshItemPosition(ListBg, scrollView, tipsSz)

    -- 重置内部位置
    ItemTips.ResetEquipPosition()

    if innerH > listH then
        ItemTips.SetTipsScrollArrow(ListBg, scrollView, innerH, listH)
    end

    if ssrGlobal_ItemTipsBasePanelEx then
        local widget = ssrGlobal_ItemTipsBasePanelEx(itemData, ListBg)
        if widget and not tolua.isnull(widget) then
            GUI:addChild(ListBg, widget)
        end
        ItemTips.ResetEquipPosition()
    end

    --
    ItemTips.AddFrameEffect(ListBg, itemDescs)
end

------------  道具tips  ------------------------------------------------
function ItemTips.GetItemTips(data, itemData)
    ItemTips._isItem = true
    ItemTips.CreateItemPanel(data, itemData)
end

function ItemTips.CreateItemPanel(data, itemData)
    if not data or (not data.pos and not data.node) then
        return false
    end

    ResetDescParam()

    local width = 420
    local listMargin = SL:GetMetaValue("WINPLAYMODE") and 0 or -3
    local maxWidth = 0

    _PanelNum = _PanelNum + 1

    local ListBg = ItemTips.AddTipLayout(ItemTips._PMainUI, "ListBg" .. _PanelNum)
    GUI:setPosition(ListBg, 0, 0)
    GUI:setAnchorPoint(ListBg, 0, 0)
    GUI:setTouchEnabled(ListBg, false)

    local scrollView = GUI:ScrollView_Create(ListBg, "scrollView", 10, 10, 0, 0, 1)
    GUI:ScrollView_setClippingEnabled(scrollView, true)
    GUI:setTouchEnabled(scrollView, false)

    local contentPanel = GUI:Layout_Create(scrollView, "contentPanel", 0, 0, 47, 1)
    GUI:setAnchorPoint(contentPanel, 0, 0)
    ItemTips.contentPanel = contentPanel

    local color = (itemData.Color and itemData.Color > 0) and itemData.Color or 255
    local name = itemData.Name or ""
    -- 道具名字
    -- 装备名称
    local nameStr = string.format("<font color='%s' size='%s'>%s</font>", SL:GetHexColorByStyleId(color), 20, name) 
	if SL:GetMetaValue("WINPLAYMODE") then
        local hexColor = SL:GetHexColorByStyleId(color)
        --nameStr = string.format("<shadow color='%s' offsetWidth='0.1' offsetHeight='0.1' blurRadius='1'><font color='%s' size='%s'>%s</font></shadow>", hexColor , hexColor, 14, name) 
		nameStr = string.format("<font color='%s' size='%s'>%s</font>", SL:GetHexColorByStyleId(color), 14, name) 
	end
	
    local r_name = GUI:RichText_Create(contentPanel, "r_name", 0, 0, nameStr, width, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(color), vspace, nil, fontPath)
    ItemTips.PushItem(contentPanel, r_name)

    local itemDescs = GUIFunction:GetParseItemDesc(itemData.Desc)
    -- 顶部描述
    local topDescs = itemDescs.top_desc
    if topDescs then
        if SL:GetMetaValue("WINPLAYMODE") then
            ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace))
        end
        pushDescItem(topDescs, 1)
    end
    ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))

    -- icon
    local isShowIcon = true
    if tonumber(SL:GetMetaValue("GAME_DATA", "itemTypeName")) == 0 then
        isShowIcon = false
    end
    local item = nil
    local size = nil
    if isShowIcon then
        local res = SL:GetMetaValue("WINPLAYMODE") and (_PathRes .. "1900025000.png") or (_PathRes .. "1900025001.png")
        local icon_bg = GUI:Image_Create(contentPanel, "icon_bg", 0, 0, res)
        size = GUI:getContentSize(icon_bg)
        icon_bg._itemWid = size.width
        item = GUI:ItemShow_Create(icon_bg, "item_", size.width / 2, size.height / 2, {itemData = itemData, index = itemData.Index, disShowCount = true, notShowEquipRedMask = true})
        GUI:setAnchorPoint(item, 0.5, 0.5)
        ItemTips.PushItem(contentPanel, icon_bg)
        ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
    end

    local iconMoveY = SL:GetMetaValue("WINPLAYMODE") and -6 or 0
    -- 类型
    local typeStr = ItemTips.GetTypeStr(itemData, true)
    if isShowIcon and typeStr and string.len(typeStr) > 0 then
        local rich_type = GUI:RichText_Create(GUI:ItemShow_GetLayoutExtra(item), "rich_type", size.width + 10, size.height / 2 + iconMoveY, typeStr, width, _setFontSize or _DefaultFSize, "#ffffff", vspace, nil, fontPath)
        GUI:setAnchorPoint(rich_type, 0, 0.5)
        maxWidth = math.max(maxWidth, GUI:getContentSize(rich_type).width + size.width + 20)
        local icon_bg = GUI:getChildByName(contentPanel, "icon_bg")
        icon_bg._itemWid = math.max(icon_bg._itemWid, GUI:getContentSize(rich_type).width + size.width + 20)
    end

    -- 条件限制
    local needStr = ItemTips.GetNeedStr(itemData, true)
    if isShowIcon and needStr and itemData.StdMode ~= 4 then
        local rich_need = GUI:RichText_Create(GUI:ItemShow_GetLayoutExtra(item), "rich_need", size.width + 10, iconMoveY, needStr, width,  _setFontSize or _DefaultFSize, "#ffffff", vspace, nil, fontPath) 
        GUI:setAnchorPoint(rich_need, 0, 0)
        maxWidth = math.max(maxWidth, GUI:getContentSize(rich_need).width + size.width + 20)
        local icon_bg = GUI:getChildByName(contentPanel, "icon_bg")
        icon_bg._itemWid = math.max(icon_bg._itemWid, GUI:getContentSize(rich_need).width + size.width + 20)
    end

    -- 绑定
    local isAddLink = false
    if itemData.BindInfo and string.len(itemData.BindInfo) > 0 then
        local rich_bind = GUI:RichText_Create(contentPanel, "rich_bind", 0, 0, string.format("已绑定[%s]", itemData.BindInfo), width, _setFontSize or _DefaultFSize, SL:GetColorByStyleId(color), vspace, nil, fontPath)
        ItemTips.PushItem(contentPanel, rich_bind)
        isAddLink = true
    end

    if isShowIcon and itemData.Bind and string.len(itemData.Bind) > 0 and SL:GetMetaValue("ITEM_IS_BIND", itemData) then
        -- ！Pos
        local rich_bind = GUI:RichText_Create(GUI:ItemShow_GetLayoutExtra(item), "rich_bind", size.width + 10, size.height + iconMoveY, "已绑定", width, _setFontSize or _DefaultFSize, SL:GetColorByStyleId(color), vspace, nil, fontPath)
        GUI:setAnchorPoint(rich_bind, 0, 1)
        local bindSize = GUI:getContentSize(rich_bind)
        maxWidth = math.max(maxWidth, bindSize.width + size.width + 20)
        local icon_bg = GUI:getChildByName(contentPanel, "icon_bg")
        icon_bg._itemWid = math.max(icon_bg._itemWid, bindSize.width + size.width + 20)
    end

    -- 药品
    local str = ItemTips.GetHP_MP_Str(itemData)
    if str and string.len(str) > 0 then
        local rich_hmp = GUI:RichText_Create(contentPanel, "rich_hmp", 0, 0, str, width, _setFontSize or _DefaultFSize, "#FFFFFF", vspace, nil, fontPath)
        ItemTips.PushItem(contentPanel, rich_hmp)
        isAddLink = true
        maxWidth = math.max(maxWidth, GUI:getContentSize(rich_hmp).width)
    end

    if isAddLink then
        isAddLink = false
        ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
    end

    -- 道具描述
    local itemStr = GUIFunction:GetItemAttDesc(itemData) or {}
    local attrStr = ""
    for i, line in ipairs(itemStr) do
        if next(line) then
            if i ~= 1 then
                attrStr = attrStr .. "<br>"
            end
            for k, txt in ipairs(line) do
                attrStr = attrStr .. txt .. (k ~= #line and "<br>" or "")
            end
        end
    end
    if attrStr and string.len(attrStr) > 0 then
        local rich_attr = GUI:RichText_Create(contentPanel, "rich_attr", 0, 0, attrStr, width, _setFontSize or _DefaultFSize, "#FFFFFF", vspace, nil, fontPath)
        GUI:setAnchorPoint(rich_attr, 0, 0)
        ItemTips.PushItem(contentPanel, rich_attr)
    else
        removeLastLine()
        ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace / 2, true))
    end

    -- 职业等级限制
    if itemData.StdMode == 4 then
        local richStr = ItemTips.GetLimitStr(itemData, data.from)
        if richStr then
            local rich_limit = GUI:RichText_Create(contentPanel, "rich_limit", 0, 0, richStr, width, _setFontSize or _DefaultFSize, "#FFFFFF", vspace, nil, fontPath)
            GUI:setAnchorPoint(rich_limit, 0, 0)
            ItemTips.PushItem(contentPanel, rich_limit)
        end
    end

    -- 道具说明
    local desc = itemDescs.desc
    if desc then
        pushDescItem(desc)
        ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace / 2, true))
    end

    local desc = itemDescs
    if desc and next(desc) then
        pushDescItem(desc)
    end
	
	--SL:print(itemData.Name)
	if shouhun_ttt[itemData.Name] then
		local shouhunStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(154), "获取途径：").."<br>"
		local shouhunjieshao = "通过在盟重省<font color='#00FF00'>NPC\"珍禽异兽\"</font><br>处砸兽魂蛋获得"
		shouhunStr = shouhunStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), shouhunjieshao) .."<br>"
		local rich_shouhun = GUI:RichText_Create(contentPanel, "rich_shouhun", 0, 0, shouhunStr, width, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(255), vspace, nil,  fontPath) 
		ItemTips.PushItem(contentPanel, rich_shouhun)
		ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
		
		shouhunStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(154), "魂兽用途：").."<br>"
		shouhunjieshao = "盟重省<font color='#00FF00'>NPC\"珍禽异兽\"</font>处使用<br>在兽栏激活后可获得对应属性<br>也可收集在<font color='#00FF00'>兽栏</font>或回收<font color='#00FF00'>兽魂值</font>"
		shouhunStr = shouhunStr .. string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(255), shouhunjieshao) .."<br>"
		rich_shouhun = GUI:RichText_Create(contentPanel, "rich_shouhun1", 0, 0, shouhunStr, width, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(255), vspace, nil, fontPath) 
		ItemTips.PushItem(contentPanel, rich_shouhun)
		ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
	end

    -- 聚灵珠
    if itemData.StdMode == 49 then
        local richStr = ItemTips.GetJulingCostStr(itemData)
        if richStr then
            local rich_jl = GUI:RichText_Create(contentPanel, "rich_rl", 0, 0, richStr, width, _setFontSize or _DefaultFSize, SL:GetHexColorByStyleId(69), vspace, nil, fontPath)
            GUI:setAnchorPoint(rich_jl, 0, 0)
            ItemTips.PushItem(contentPanel, rich_jl)
        end
    end

    -- 倒计时
    if itemData.AddValues then
        local timeStr = ItemTips.GetTimeStr(2, itemData.AddValues, _lookPlayer or _isSelf, {from = data.from, itemData = itemData})
        if timeStr then
            local rich_time = GUI:RichText_Create(contentPanel, "rich_time", 0, 0, timeStr, width, _setFontSize or _DefaultFSize, "#28EF01", vspace, nil, fontPath)
            GUI:setAnchorPoint(rich_time, 0, 0)
            ItemTips.PushItem(contentPanel, rich_time)
        end
    end

    -- 物品自定义属性 (针对201类宠物蛋)
    local showExAbil = true
    if SL:GetMetaValue("GAME_DATA", "hidePetsItemExAbil") and tonumber(SL:GetMetaValue("GAME_DATA", "hidePetsItemExAbil")) == 1 then
        showExAbil = false
    end
    if showExAbil and itemData.StdMode == 201 and itemData.ExAbil and type(itemData.ExAbil) == "table" and next(itemData.ExAbil) then
        local rich_custom = ItemTips.GetCustomShow(contentPanel, itemData.ExAbil, true)
        removeLastLine()
        ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
        ItemTips.PushItem(contentPanel, rich_custom)
        maxWidth = math.max(maxWidth, GUI:getContentSize(rich_custom).width)
        ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
    end

    if ssrGlobal_ItemTipsEx then
        local widget = ssrGlobal_ItemTipsEx(itemData)
        if widget and not tolua.isnull(widget) then
            GUI:addChild(contentPanel, widget)
            ItemTips.PushItem(contentPanel, widget)
        end
    end

    -- 来源
    local exten = itemData.ExtendInfo
    if exten and exten.ItmSrc then
        local srcStr = ItemTips.GetSrcStr(exten.ItmSrc)
        if srcStr then
            removeLastLine()
            ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
            local rich_src = GUI:RichText_Create(contentPanel, "rich_src", 0, 0, srcStr, width, _setFontSize or _DefaultFSize, "#28EF01", vspace, nil, fontPath)
            ItemTips.PushItem(contentPanel, rich_src)
            maxWidth = math.max(maxWidth, GUI:getContentSize(rich_src).width)
            ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
        end
    end

    pushDescItem(topDesY)

    local bottomDescs = itemDescs.bottom_desc
    if bottomDescs then
        pushDescItem(bottomDescs)
        ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
    end
	
	if beizhu[itemData.Name] then
		local kuan = 240
		if SL:GetMetaValue("WINPLAYMODE") then --电脑端
			kuan = 180
		end
		local beizhuStr = string.format("<font color='%s'>%s</font>", SL:GetHexColorByStyleId(beizhu[itemData.Name][2]), beizhu[itemData.Name][1]) .."<br>"
		local rich_beizhuStr = GUI:RichText_Create(contentPanel, "rich_fengyinStr", 0, 0, beizhuStr, kuan, _setFontSize or _DefaultFSize, "FFFFFF", vspace, nil, fontPath) 
        ItemTips.PushItem(contentPanel, rich_beizhuStr)
		ItemTips.PushItem(contentPanel, ItemTips.CreateIntervalPanel(contentPanel, _DefaultSpace, true))
	end

    removeLastLine()

    -- 使用/拆分按钮
    if not SL:GetMetaValue("WINPLAYMODE") and data.from == ItemFrom.BAG then
        if IsOpenSwitch(3, itemData.StdMode) then
            if not (itemData.StdMode == 40 and itemData.Shape == 15) then -- 宝箱不显示使用
                ItemTips.AddButton(ListBg, itemData, 3)
            end
        end

        if IsOpenSwitch(2) and itemData.OverLap and itemData.OverLap > 1 then
            local itemConfig = SL:GetMetaValue("ITEM_DATA", itemData.Index)
            if itemConfig and itemConfig.OverLap and itemConfig.OverLap > 1 then
                ItemTips.AddButton(ListBg, itemData, 2) -- 拆分
            end
        end
    end

    local sz = GUI:getContentSize(contentPanel)
    local innerH = sz.height + 5
    local contentPanelPosY = GUI:getPositionY(contentPanel)
    GUI:setPositionY(contentPanel, innerH - contentPanelPosY)

    maxWidth = math.max(maxWidth, sz.width)
    GUI:ScrollView_setInnerContainerSize(scrollView, maxWidth, sz.height)
    local listH = math.min(innerH, _TipsMaxH)
    GUI:setContentSize(scrollView, maxWidth, listH)

    GUI:setContentSize(ListBg, maxWidth, listH)
    local tipsSz = GUI:getContentSize(ListBg)
    ItemTips.RefreshItemPosition(ListBg, scrollView, tipsSz)

    local anchorPoint, pos = ItemTips.GetTipsAnchorPoint(ListBg, data.pos, ItemTips._data.anchorPoint or {x = 0, y = 1})
    GUI:setAnchorPoint(ListBg, anchorPoint.x, anchorPoint.y)
    GUI:setPosition(ListBg, pos.x, pos.y)

    if innerH > listH then
        GUI:setTouchEnabled(scrollView, true)
        ItemTips.SetTipsScrollArrow(ListBg, scrollView, innerH, listH)
    end

    if ssrGlobal_ItemTipsBasePanelEx then
        local widget = ssrGlobal_ItemTipsBasePanelEx(itemData, ListBg)
        if widget and not tolua.isnull(widget) then
            GUI:addChild(ListBg, widget)
        end
    end

    --
    ItemTips.AddFrameEffect(ListBg, itemDescs)
end

------------    按钮    ------------------------------------------------

local _GetBtnCfg = function(btnType)
    local cfg = {
        [1] = {
            normalPic   = "res/public/1900000679.png",
            pressPic    = "res/public/1900000679_1.png",
            btnName     = "佩戴", 
            func        = function(data)
                SL:RequestUseItem(data)
                SL:CloseItemTips()
            end
        },
        [2] = {
            normalPic   = "res/public/1900000679.png",
            pressPic    = "res/public/1900000679_1.png",
            btnName     = "拆分",
            func        = function(data)
                SL:OpenItemSplitPop(data)
                SL:CloseItemTips()
            end
        },
        [3] = {
            normalPic   = "res/public/1900000679.png",
            pressPic    = "res/public/1900000679_1.png",
            btnName     = "使用",
            func        = function(data)
                SL:RequestUseItem(data)
                SL:CloseItemTips()
            end
        },
        [-1] = {
            normalPic   = "res/public/1900000679.png",
            pressPic    = "res/public/1900000679_1.png",
            btnName     = "",
            func        = function(data)
                SL:Print("Not ClickEvent....")
            end
        }
    }
    return cfg[btnType] or cfg[-1]
end

--btnType: 1： 佩戴    2：拆分    3：使用道具
function ItemTips.AddButton(parent, itemData, btnType)
    local btnCfg = _GetBtnCfg(btnType)

    local button = GUI:Button_Create(parent, "BTN_" .. btnType, 0, 0, btnCfg.normalPic)
    GUI:Button_loadTexturePressed(button, btnCfg.pressPic)
    GUI:Button_setTitleText(button, btnCfg.btnName)
    GUI:Button_setTitleFontSize(button, _DefaultFSize)
    GUI:Button_setTitleColor(button, "#FFFFFF")
    GUI:Button_titleEnableOutline(button, "#111111", 1)
    GUI:setAnchorPoint(button, 0, 0)
    GUI:setScale(button, SL:GetMetaValue("WINPLAYMODE") and 0.8 or 1)
    GUI:addOnClickEvent(button, function() 
        btnCfg.func(itemData) 
    end)

    local size = GUI:getContentSize(parent)
    local minW = 200
    if size.width < minW then
        size.width = minW
        GUI:setContentSize(parent, size)
    end

    local minH = 80
    if btnType == 1 and size.height < minH then
        size.height = minH
        GUI:setContentSize(parent, size)
    end

    local btnSz = GUI:getContentSize(button)
    local posY = size.height - btnSz.height - 5
    GUI:setPosition(button, size.width - btnSz.width - 5, posY)

    if btnType == 1 then
        GUI:setPositionY(button, posY - 50)
    end

    return button
end
